{
    "name": "الكتاب الثامن",
    "title": "أحكام مختلفة وختامية",
    "articles": [
      {
        "number": "750",
        "paragraphs": [
          "جميع الآجال المنصوص عليها في هذا القانون آجال كاملة لا تشمل اليوم الأول ولا اليوم الأخير، وتستثنى من ذلك الآجال التي تكون محددة بعدد الساعات.",
          "إذا كان اليوم الأخير للأجل يوم عطلة امتد الأجل إلى أول يوم عمل بعده.",
          "تعتبر أيام عطل جميع الأيام المصرح بأنها كذلك بمقتضى نص خاص."
        ]
      },
      {
        "number": "751",
        "paragraphs": [
          "كل إجراء يأمر به هذا القانون ولم يثبت إنجازه على الوجه القانوني يعد كأن لم ينجز ولا يعتد به، وذلك مع مراعاة مقتضيات الفقرة الثالثة من المادة 442 المتعلقة بجلسات غرفة الجنايات.",
          "ترتب الجهة القضائية المختصة الجزاء المذكور في الفقرة أعلاه."
        ]
      },
      {
        "number": "752",
        "paragraphs": [
          "تطبق أحكام قانون المسطرة المدنية المصادق عليه بالظهير الشريف رقم 1.74.474 الصادر في 11 من رمضان 1394 (28 شتنبر 1974) على الدعاوى المدنية المقامة أمام القضاء الزجري، كلما كانت غير متناقضة مع المقتضيات الخاصة لهذا القانون والمتعلقة بنفس الموضوع."
        ]
      },
      {
        "number": "753",
        "paragraphs": [
          "إذا وقع تغيير في الاختصاص نتيجة تطبيق القانون الجديد، ينقل الملف بقوة القانون وبدون أي إجراء إلى هيئة التحقيق أو الحكم التي أصبحت مختصة."
        ]
      },
      {
        "number": "754",
        "paragraphs": [
          "تبقى إجراءات المسطرة التي أنجزت قبل تاريخ تطبيق هذا القانون صحيحة ولا داعي لإعادتها."
        ]
      },
      {
        "number": "755",
        "paragraphs": [
          "يجري العمل بمقتضيات هذا القانون ابتداء من فاتح أكتوبر من سنة 2003.",
          "غير أن المقررات الصادرة قبل تاريخ دخوله حيز التطبيق تظل خاضعة من حيث الطعون وآجالها للمقتضيات المضمنة في القوانين المنسوخة.",
          "تدخل مقتضيات المادة 66-3 من هذا القانون حيز التنفيذ بعد انصرام خمس سنوات من صدور النص التنظيمي المشار إليه في الفقرة الثانية من نفس المادة."
        ]
      },
      {
        "number": "756",
        "paragraphs": [
          "تنسخ جميع النصوص المخالفة لهذا القانون ولا سيما:",
          "الظهير الشريف رقم 1.58.261 بتاريخ فاتح شعبان 1378 (10 فبراير 1959) الذي يحتوي على قانون المسطرة الجنائية والنصوص المتممة أو المعدلة له؛",
          "الفصل 51 من الظهير الشريف الصادر في 2 ربيع الأول 1377 (27 شتنبر 1957) بشأن إحداث المجلس الأعلى؛",
          "الظهير الشريف بمثابة قانون رقم 1.74.448 بتاريخ 11 من رمضان 1394 (28 شتنبر 1974) المتعلق بالإجراءات الانتقالية تطبيقا للظهير الشريف بمثابة قانون رقم 1.74.338 بتاريخ 24 من جمادى الآخرة 1394 (15 يوليوز 1974) المتعلق بالتنظيم القضائي للمملكة؛",
          "الظهير الشريف رقم 1.58.199 بتاريخ 6 ربيع الأول 1378 (20 شتنبر 1958) بشأن العضوية الاستشارية في القضايا الجنائية، كما وقع تغييره أو تتميمه؛",
          "الظهير الشريف رقم 1.58.057 الصادر في 25 ربيع الثاني 1378 (8 نونبر 1958) بشأن تسليم المجرمين الأجانب إلى حكوماتهم؛",
          "الفصول من 19 إلى 23 من مجموعة القانون الجنائي المصادق عليها بالظهير الشريف رقم 1.59.413 بتاريخ 28 من جمادى الآخرة 1382 (26 نونبر 1962)."
        ]
      }
    ]
  }