{
    "name": "الكتاب الرابع",
    "title": "طرق الطعن غير العادية",
    "sections": [
      {
        "name": "القسم الأول",
        "title": "النقض",
        "chapters": [
          {
            "name": "الباب الأول",
            "title": "أحكام عامة",
            "articles": [
              {
                "number": "518",
                "paragraphs": [
                  "تتولى محكمة النقض النظر في الطعون بالنقض المقدمة ضد الأحكام الصادرة عن المحاكم الزجرية، وتسهر على التطبيق الصحيح للقانون، وتعمل على توحيد الاجتهاد القضائي.",
                  "تمتد مراقبة محكمة النقض إلى التكييف القانوني للوقائع المبنية عليها المتابعة الجنائية وإلى قانونية وشرعية وسائل الإثبات، لكنها لا تمتد إلى الوقائع المادية التي يشهد بثبوتها قضاة المحاكم الزجرية، ولا إلى قيمة الحجج التي أخذوا بها، ما عدا في الحالات التي يجيز فيها القانون هذه المراقبة.",
                  "إذا بلغ إلى علم الرئيس الأول لمحكمة النقض صدور عدة مقررات قضائية انتهائية أو نهائية بتفسيرات مختلفة لمقتضى قانوني واحد، فإنه يمكن للرئيس الأول لمحكمة النقض، بعد استشارة ثلاثة قضاة من محكمة النقض يعينهم لهذه الغاية، أن يحيل ذلك على محكمة النقض وهي مشكلة من مجموع الغرف لإصدار قرار بالتفسير القانوني للمقتضى المختلف بشأنه.",
                  "ويبلغ قرار محكمة النقض فوراً لمجموع الرؤساء والرؤساء الأولين لمحاكم المملكة، ويكون ملزماً لها من تاريخ إصداره، إلى أن يتم العدول عنه وفقاً لنفس المسطرة أعلاه أو بعد صدور نص تشريعي."
                ]
              },
              {
                "number": "519",
                "paragraphs": [
                  "يقدم طلب النقض لمصلحة الأطراف، ويمكن تقديمه بصفة استثنائية لفائدة القانون."
                ]
              }
            ]
          },
          {
            "name": "الباب الثاني",
            "title": "طلب النقض لمصلحة الأطراف",
            "sections": [
              {
                "name": "الفرع الأول",
                "title": "شروط طلب النقض الشكلية وشروط قبوله وآثاره",
                "articles": [
                  {
                    "number": "520",
                    "paragraphs": [
                      "يرمي الطعن بالنقض لمصلحة الأطراف إلى الإبطال الفعلي للمقرر القضائي.",
                      "يقدم الطعن بالنقض من النيابة العامة لمصلحة المجتمع، ويتقدم به لمصلحته الخاصة كل من كان طرفاً في الدعوى."
                    ]
                  },
                  {
                    "number": "521",
                    "paragraphs": [
                      "يمكن الطعن بالنقض في كل الأحكام والقرارات والأوامر القضائية النهائية الصادرة في الجوهر، ما لم ينص القانون على خلاف ذلك.",
                      "إذا كانت المسطرة تشمل عدة أطراف وتغيب بعضهم، فيمكن للطرف الصادر في حقه مقرر حضوري نهائي أن يطعن فيه بالنقض داخل الأجل القانوني، ويمكن للطرف المتغيب الطعن بالنقض عندما يصبح المقرر الصادر في حقه نهائياً.",
                      "تبلغ كتابة ضبط المحكمة المصدرة للمقرر فوراً مقررها للطرف المتغيب."
                    ]
                  },
                  {
                    "number": "522",
                    "paragraphs": [
                      "لا تقبل المقررات الإعدادية أو التمهيدية أو الصادرة بشأن نزاع عارض أو دفع الطعن بالنقض إلا مقروناً بالطعن بالنقض في المقرر النهائي الصادر في الجوهر.",
                      "يسري نفس الحكم على المقررات الصادرة بشأن الاختصاص، ما لم تكن متعلقة بعدم الاختصاص النوعي شريطة إثارته قبل كل دفاع في الجوهر.",
                      "إذا تعلق الأمر بالمقررات القاضية بشأن الاختصاص النوعي في قضايا المعتقلين، يتعين إحالتها على محكمة النقض داخل أجل خمسة أيام من تاريخ الطعن بالنقض، وتبت محكمة النقض داخل أجل ثلاثين يوماً من تاريخ إيداع الملف بكتابة الضبط لديها.",
                      "إذا كان الطعن منصباً على الدعوى المدنية وحدها، فلا يرفع الملف إلى محكمة النقض إلا بعد البت في موضوعها بكامله.",
                      "في حالة وقوع نزاع في نوع الحكم، تطبق المقتضيات المنصوص عليها في الفقرتين الثانية والثالثة من المادة 401 من هذا القانون.",
                      "لا يمكن التمسك، لأجل عدم قبول طلب النقض، بالتنفيذ الطوعي للمقررات أو الأحكام الصادرة وفق الشروط المنصوص عليها في هذه المادة."
                    ]
                  },
                  {
                    "number": "523",
                    "paragraphs": [
                      "لا يقبل طلب النقض من أي شخص إلا إذا كان طرفاً في الدعوى الجنائية وتضرر من الحكم المطعون فيه.",
                      "لا يقبل طلب النقض ضد الأحكام والقرارات والأوامر القضائية الصادرة بغرامة أو ما يماثلها إذا كان مبلغها لا يتجاوز أربعين ألف درهم إلا بعد الإدلاء بما يفيد أداءها.",
                      "يرد مبلغ الغرامة إذا تم نقض الحكم."
                    ]
                  },
                  {
                    "number": "524",
                    "paragraphs": [
                      "لا يمكن طلب نقض قرارات الإحالة إلى محكمة زجرية إلا مع الحكم في الجوهر، مع مراعاة مقتضيات المادة 227 أعلاه.",
                      "يسري نفس الحكم بالنسبة لكل قرار بت في الإفراج المؤقت أو الوضع تحت المراقبة القضائية.",
                      "تكون المحكمة ملزمة بإلغاء القرار المستأنف وإحالة القضية على من له حق النظر في حالة نقض وإبطال قرار الإحالة إلى المحكمة الزجرية."
                    ]
                  },
                  {
                    "number": "525",
                    "paragraphs": [
                      "لا يمكن للطرف المدني أن يطلب نقض القرار بعدم المتابعة إلا إذا نص هذا القرار على عدم قبول تدخله في الدعوى أو إذا أغفل البت في تهمة ما."
                    ]
                  },
                  {
                    "number": "526",
                    "paragraphs": [
                      "يرفع طلب النقض بتصريح لدى كتابة الضبط بالمحكمة التي أصدرت الحكم المطعون فيه.",
                      "يقدم التصريح طالب النقض بنفسه أو بواسطة محام، ويقيد في سجل معد لهذه الغاية ويوقع عليه كاتب الضبط والمصرح، وإذا كان المصرح لا يحسن التوقيع توضع بصمته.",
                      "إذا كان طالب النقض معتقلاً، يكون تصريحه صحيحاً إذا قدمه شخصياً إلى كتابة الضبط بالمؤسسة السجنية، ويقيد فوراً بالسجل القانوني ويوجه إلى المحكمة داخل أربع وعشرين ساعة.",
                      "يسلم وصل عن التصريح."
                    ]
                  },
                  {
                    "number": "527",
                    "paragraphs": [
                      "يحدد أجل طلب النقض في عشرة أيام من يوم صدور المقرر المطعون فيه ما لم تنص مقتضيات خاصة على خلاف ذلك.",
                      "لا يبتدئ هذا الأجل إلا من يوم تبليغ المقرر إلى الشخص نفسه أو في موطنه في الحالات المنصوص عليها قانوناً.",
                      "لا يبتدئ أجل طلب النقض في الأحكام الغيابية إلا من اليوم الذي يصبح فيه التعرض غير مقبول.",
                      "يعتبر الطعن بالنقض بمثابة تنازل عن الحق في الطعن بالتعرض من قبل الطرف الذي قدمه."
                    ]
                  },
                  {
                    "number": "528",
                    "paragraphs": [
                      "يسلم كاتب الضبط نسخة مشهوداً بمطابقتها للأصل من المقرر القضائي المطعون فيه داخل أجل أقصاه ثلاثون يوماً من تاريخ التصريح بالنقض.",
                      "يضع طالب النقض بواسطة محام مقبول لدى محكمة النقض مذكرة بوسائل الطعن داخل أجل ستين يوماً من تاريخ التصريح.",
                      "تكون المذكرة اختيارية في قضايا الجنايات.",
                      "يوجه الملف إلى محكمة النقض بمجرد وضع المذكرة، وفي جميع الأحوال داخل أجل أقصاه تسعون يوماً.",
                      "إذا لم تسلم نسخة المقرر داخل الأجل القانوني، يطلع طالب النقض على الملف بمحكمة النقض ويضع مذكرة الطعن داخل الأجل المحدد تحت طائلة سقوط الطلب."
                    ]
                  },
                  {
                    "number": "529",
                    "paragraphs": [
                      "تتقدم النيابة العامة بالطعن بالنقض والمذكرات مباشرة وتعفى الدولة من مؤازرة المحامي.",
                      "يوقع مذكرات الدولة عند عدم الاستعانة بمحام الوزير المختص أو موظف مفوض له تفويضاً خاصاً."
                    ]
                  },
                  {
                    "number": "530",
                    "paragraphs": [
                      "يجب على طالب النقض، باستثناء النيابة العامة أو الإدارات العمومية، إيداع مبلغ ثلاثة آلاف درهم كضمانة مع مذكرة النقض.",
                      "يرد مبلغ الضمانة في حالة عدم الحكم بالغرامة وبعد استيفاء المصاريف القضائية عند رفض الطلب.",
                      "يعفى من إيداع الضمانة طالبو النقض المعتقلون أو من يدلون بشهادة عوز.",
                      "يترتب عن عدم إيداع مبلغ الضمانة سقوط طلب النقض."
                    ]
                  },
                  {
                    "number": "531",
                    "paragraphs": [
                      "لا يمكن لأي سبب ولا بناء على أية وسيلة للطرف الذي سبق رفض طلبه الرامي إلى النقض أن يطلب من جديد نقض نفس القرار."
                    ]
                  },
                  {
                    "number": "532",
                    "paragraphs": [
                      "يبقى المحكوم عليه بعقوبة سالبة للحرية رهن الاعتقال إذا كان معتقلاً احتياطياً، وذلك أثناء أجل الطعن بالنقض أو في حالة تقديم هذا الطعن، غير أنه يفرج عنه بمجرد ما يقضي العقوبة المحكوم بها عليه.",
                      "يفرج كذلك في الحال عن المتهمين المحكوم ببراءتهم أو بإعفائهم أو بسقوط الدعوى العمومية في حقهم، أو المحكوم عليهم بعقوبة سالبة للحرية موقوفة التنفيذ أو بغرامة فقط، وذلك بالرغم من الطعن بالنقض.",
                      "يوقف أجل الطعن بالنقض والطعن بالنقض تنفيذ العقوبة الجنائية في جميع الحالات الأخرى، ما عدا إذا طبقت المادتان 392 و431 أعلاه من لدن هيئة الحكم.",
                      "لا يوقف الطعن بالنقض أمام محكمة النقض أو أجله تنفيذ التعويضات المدنية المحكوم بها على المحكوم عليه."
                    ]
                  },
                  {
                    "number": "533",
                    "paragraphs": [
                      "ينحصر أثر الطعن بالنقض المرفوع من النيابة العامة، فيما يرجع لنظر محكمة النقض، في المقتضيات المتعلقة بالدعوى العمومية، ولا يمكن التنازل عنه بعد رفعه.",
                      "ينحصر أثر الطعن بالنقض المرفوع من الطرف المدني أو المسؤول عن الحقوق المدنية، فيما يرجع لنظر محكمة النقض، في المقتضيات المتعلقة بالدعوى المدنية.",
                      "يترتب عن الطعن بالنقض الذي يرفعه المحكوم عليه عرض الحكم الصادر على محكمة النقض، سواء فيما يرجع للدعوى العمومية أو للدعوى المدنية، وذلك في حدود مصلحة الطالب، ما لم توجد قيود منصوص عليها في القانون أو في تصريح الطعن بالنقض.",
                      "إذا كان الطرف المدني هو الذي أقام الدعوى العمومية عن طريق الاستدعاء المباشر، فإن طعنه بالنقض يترتب عنه النظر في الدعويين العمومية والمدنية معاً."
                    ]
                  }
                ]
              },
              {
                "name": "الفرع الثاني",
                "title": "أسباب النقض",
                "articles": [
                  {
                    "number": "534",
                    "paragraphs": [
                      "يجب أن يرتكز الطعن بالنقض في الأوامر أو القرارات أو الأحكام القابلة للطعن بالنقض على أحد الأسباب الآتية:",
                      "خرق الإجراءات الجوهرية للمسطرة.",
                      "الشطط في استعمال السلطة.",
                      "عدم الاختصاص.",
                      "الخرق الجوهري للقانون.",
                      "انعدام الأساس القانوني أو انعدام التعليل."
                    ]
                  },
                  {
                    "number": "535",
                    "paragraphs": [
                      "لا تقبل وسيلة النقض المبنية على سبب للإبطال حدث أثناء النظر في القضية ابتدائياً ولم تتم إثارته أمام محكمة الاستئناف."
                    ]
                  },
                  {
                    "number": "536",
                    "paragraphs": [
                      "لا تقبل وسيلة النقض المستخلصة من أسباب ليست ضرورية لمنطوق المقرر المطعون فيه."
                    ]
                  },
                  {
                    "number": "537",
                    "paragraphs": [
                      "إذا كانت العقوبة المحكوم بها هي نفس العقوبة المقررة في النص الذي ينطبق على الجريمة المرتكبة، فلا يمكن لأي كان أن يطلب إبطال المقرر بدعوى وجود خطأ في التكييف الذي أعطي للجريمة أو في نصوص القانون التي أشار إليها المقرر، ما لم يترتب عن ذلك التكييف ضرر للطالب.",
                      "إذا وجد في إحدى التهم ما يبرر العقوبة الصادرة، فلا يمكن إبطال الحكم، غير أن محكمة النقض تصرح في هذه الحالة بأن العقوبة المنصوص عليها في المقرر المطعون فيه لا تنطبق إلا على التهمة التي ثبتت قانونياً من بين التهم الأخرى."
                    ]
                  }
                ]
              },
              {
                "name": "الفرع الثالث",
                "title": "التحقيق في طلبات النقض والجلسات",
                "articles": [
                  {
                    "number": "538",
                    "paragraphs": [
                      "يتعين على النيابة العامة بالمحكمة التي تلقت المقرر القضائي المطعون فيه أن ترفع، داخل أجل خمسة عشر يوماً من تاريخ التوصل بالملف من كتابة الضبط، إلى الوكيل العام للملك لدى محكمة النقض ملف الدعوى ونسخة مطابقة للأصل من المقرر المطعون فيه والتصريح بالنقض والوصل المتعلق بإيداع المبلغ المنصوص عليه في المادة 530 والنسخ المشار إليها في المادة 528 والمذكرات إن تم إيداعها.",
                      "يحرر كاتب الضبط بالمحكمة علاوة على ذلك قائمة بالمستندات، وفي حالة عدم إيداع المبلغ المشار إليه أو عدم تقديم المذكرة ونسخ منها، ينص على ذلك بوضوح في قائمة المستندات."
                    ]
                  },
                  {
                    "number": "539",
                    "paragraphs": [
                      "بمجرد تسجيل القضية في كتابة الضبط بمحكمة النقض، يوجه الرئيس الأول الملف إلى رئيس الغرفة المختصة.",
                      "يعين رئيس الغرفة المختصة أو رئيس الهيئة مستشاراً مقرراً يعهد إليه بتسيير المسطرة."
                    ]
                  },
                  {
                    "number": "540",
                    "paragraphs": [
                      "يأمر المستشار المقرر بتبليغ المذكرة المنصوص عليها في المادة 528 إلى جميع الأطراف الذين لهم مصلحة في البت في طلب النقض، وإلى الوكيل القضائي للمملكة إذا كان قد تدخل أمام محكمة الموضوع.",
                      "إذا كانت المذكرة اختيارية ولم يقع تقديمها، يأمر بتبليغ التصريح بالنقض.",
                      "يحق للأطراف المعنية أن تقدم مذكرة دفاعها داخل أجل ثلاثين يوماً من تاريخ هذا التبليغ، مرفقة بالمستندات التي تعتزم الاستدلال بها، ويمكن بصفة استثنائية للمستشار المقرر أن يمنح أجلاً إضافياً يحدد مدته.",
                      "يتعين إمضاء مذكرة الدفاع من طرف محام مقبول لدى محكمة النقض، ما عدا في حالات الاستغناء المنصوص عليها في المادتين 528 و529 أعلاه."
                    ]
                  },
                  {
                    "number": "541",
                    "paragraphs": [
                      "يعد المستشار المقرر تقريراً كتابياً ويصدر أمراً بإحالة الملف إلى النيابة العامة للاطلاع عليه.",
                      "يتعين على النيابة العامة إرجاع ملف الدعوى إلى المستشار المقرر مرفقاً بمستنتجاتها الكتابية داخل أجل ثلاثين يوماً من تاريخ صدور الأمر بالاطلاع."
                    ]
                  },
                  {
                    "number": "542",
                    "paragraphs": [
                      "تقيد القضية في جدول الجلسة بأمر من رئيس الغرفة بعد استشارة النيابة العامة، ويجب تبليغ تاريخ الجلسة إلى جميع الأطراف المعنية قبل الجلسة بخمسة أيام على الأقل.",
                      "يمكن للرئيس الأول أو لرئيس الغرفة الجنائية أو للغرفة تلقائياً أو بناءً على ملتمس من الوكيل العام للملك لدى محكمة النقض أو بطلب من دفاع الأطراف إحالة القضية إلى هيئة للحكم مكونة من غرفتين مجتمعتين أو إلى هيئتين جماعيتين قصد البت فيها.",
                      "يعين الرئيس الأول في هذه الحالة الغرفة أو الهيئة، ويرجح في حالة تعادل الأصوات صوت الرئيس حسب نظام الأسبقية.",
                      "يمكن للهيئة المؤلفة من غرفتين أو هيئتين أن تقرر إحالة القضية إلى محكمة النقض للبت فيها بمجموع غرفها.",
                      "يتم البت من قبل مجموع غرف محكمة النقض بواسطة هيئة تتألف من رؤساء الغرف وقيدوميها، إضافة إلى أعضاء الغرفتين اللتين قررتا الإحالة."
                    ]
                  },
                  {
                    "number": "543",
                    "paragraphs": [
                      "تكون الجلسات علنية، وللمحكمة حق عقدها سرية.",
                      "بعد تلاوة التقرير من طرف المستشار المقرر، يمكن لمحامي الأطراف تقديم ملاحظات شفوية.",
                      "تعرض النيابة العامة مستنتجاتها ويستمع إلى رأيها في جميع القضايا.",
                      "تحجز القضية بعد ذلك للمداولة، ويصدر القرار في جلسة علنية."
                    ]
                  },
                  {
                    "number": "544",
                    "paragraphs": [
                      "إذا تبين للمستشار المقرر عند دراسة القضية وجود سبب واضح للبطلان أو لعدم قبول الطلب أو لسقوطه، أمكنه بعد موافقة رئيس الغرفة والنيابة العامة أن يأمر بتقييد القضية في جدول جلسة مقبلة دون مراعاة الإجراءات المنصوص عليها في المادة 540.",
                      "يبلغ حينئذ تاريخ الجلسة إلى طالب النقض وحده قبل انعقادها بخمسة أيام على الأقل."
                    ]
                  },
                  {
                    "number": "545",
                    "paragraphs": [
                      "تطبق، في حالة وقوع جريمة أثناء جلسة من جلسات محكمة النقض، مقتضيات المواد 359 إلى 361 من هذا القانون."
                    ]
                  },
                  {
                    "number": "546",
                    "paragraphs": [
                      "يتعين على محكمة النقض البت بكيفية استعجالية وبالأولوية في طلبات النقض المرفوعة من طرف المتهمين المعتقلين داخل أجل أقصاه ثلاثة أشهر من تاريخ التوصل بالملف."
                    ]
                  },
                  {
                    "number": "547",
                    "paragraphs": [
                      "تبدأ المداولات بتلاوة المستشار المقرر لتقريره الكتابي، ويبدي بعده المستشارون آراءهم بدءاً بأقدمهم في التعيين ثم يليهم الرئيس."
                    ]
                  }
                ]
              },
              {
                "name": "الفرع الرابع",
                "title": "قرارات محكمة النقض",
                "articles": [
                  {
                    "number": "548",
                    "paragraphs": [
                      "تصدر قرارات محكمة النقض باسم جلالة الملك وطبقاً للقانون، ويجب أن تكون معللة وأن تشير إلى النصوص التي طبقت مقتضياتها.",
                      "يجب أن تتضمن القرارات أسماء الأطراف العائلية والشخصية وصفتهم وحرفتهم وموطنهم وأسماء محاميهم.",
                      "تتضمن القرارات المذكرات المدلى بها ونص الوسائل المستدل بها ومستنتجات الأطراف.",
                      "تتضمن القرارات أسماء القضاة الذين أصدروا القرار مع بيان اسم المستشار المقرر.",
                      "تتضمن القرارات اسم ممثل النيابة العامة واسم كاتب الضبط.",
                      "يشار في القرارات إلى تلاوة تقرير المستشار ومضمون مستنتجات النيابة العامة ومضمون إيضاحات الدفاع إن وجدت.",
                      "يشار في القرارات إلى تاريخ النطق بها وإلى أنها صدرت في جلسة علنية.",
                      "يوقع على أصل القرار كل من الرئيس والمستشار المقرر وكاتب الضبط، وفي حالة حدوث مانع تطبق الإجراءات المنصوص عليها في المادة 371 من هذا القانون."
                    ]
                  },
                  {
                    "number": "549",
                    "paragraphs": [
                      "يتحمل أداء المصاريف الطرف الذي خسر الدعوى، غير أنه يمكن الحكم بتوزيع تلك المصاريف بين الأطراف.",
                      "يمكن في حالة تقديم طلب نقض كيدي أو تعسفي الحكم على الطالب بغرامة مدنية لا تتجاوز عشرة آلاف درهم.",
                      "للمحكمة أن تبت في طلب التعويض عن الضرر الناتج عن الطعن التعسفي."
                    ]
                  },
                  {
                    "number": "550",
                    "paragraphs": [
                      "إذا أبطلت محكمة النقض مقرراً صادراً عن محكمة زجرية، أحالت الدعوى والأطراف إلى نفس المحكمة متركبة من هيئة أخرى أو إلى محكمة أخرى من نفس النوع والدرجة.",
                      "إذا كان الإبطال بسبب عدم اختصاص المحكمة التي أصدرت الحكم، تحال القضية إلى المحكمة المختصة قانوناً."
                    ]
                  },
                  {
                    "number": "551",
                    "paragraphs": [
                      "إذا تعين على المتهم الحضور من جديد أمام غرفة الجنايات الاستئنافية بعد إبطال القرار الصادر ضده، تطبق عند الاقتضاء مقتضيات المادة 404 من هذا القانون.",
                      "يفرج فوراً عن الشخص المتابع إذا أبطل القرار الصادر ضده بدون إحالة."
                    ]
                  },
                  {
                    "number": "552",
                    "paragraphs": [
                      "إذا رفضت محكمة النقض طلب نقض وأصبح القرار المطعون فيه مكتسباً لقوة الشيء المقضي به وترتب عن ذلك تنازع سلبي للاختصاص، تعين على محكمة النقض اعتبار طلب النقض بمثابة طلب للفصل في تنازع الاختصاص.",
                      "تبت محكمة النقض في تعيين المحكمة المختصة."
                    ]
                  },
                  {
                    "number": "553",
                    "paragraphs": [
                      "تحكم محكمة النقض بالنقض دون إحالة إذا لم يترك الحكم المطعون فيه شيئاً في الجوهر يمكن البت فيه أو إذا تحققت إحدى أسباب سقوط الدعوى العمومية.",
                      "يكون النقض جزئياً إذا كان الإبطال لا يسري إلا على إحدى المقتضيات الفرعية أو لا يؤثر على جوهر العقوبة المحكوم بها."
                    ]
                  },
                  {
                    "number": "554",
                    "paragraphs": [
                      "يتعين على المحكمة التي أحيلت إليها القضية بعد النقض أن تلتزم بقرار محكمة النقض فيما يرجع للنقطة القانونية التي بتت فيها."
                    ]
                  },
                  {
                    "number": "555",
                    "paragraphs": [
                      "يسلم كاتب الضبط داخل عشرين يوماً نسخة من القرار الصادر في طلب النقض إلى الوكيل العام للملك بمحكمة النقض لتوجيهه إلى ممثل النيابة العامة بالمحكمة التي أصدرت المقرر المطعون فيه.",
                      "إذا كان المتهم في حالة اعتقال، يتم إشعار المؤسسة السجنية بالقرار فوراً."
                    ]
                  },
                  {
                    "number": "556",
                    "paragraphs": [
                      "تتصدى محكمة النقض للقضية إذا تم الطعن فيها بالنقض للمرة الثانية وكانت جاهزة للحكم ولم تتوفر ضرورة للإحالة."
                    ]
                  },
                  {
                    "number": "557",
                    "paragraphs": [
                      "إذا أبطل مقرر، فإن الطعن بالنقض في المقرر الذي يصدر بعد ذلك في نفس القضية وبين نفس الأطراف الذين قدموا طعونهم بنفس الصفة وبناء على نفس الوسائل، يعرض على غرفتين مجتمعتين بمحكمة النقض قصد البت فيه."
                    ]
                  }
                ]
              }
            ]
          },
          {
            "name": "الباب الثالث",
            "title": "طلبات النقض المرفوعة لفائدة القانون",
            "articles": [
              {
                "number": "558",
                "paragraphs": [
                  "تنقسم طلبات النقض لفائدة القانون إلى طلبات يرفعها الوكيل العام للملك لدى محكمة النقض وطلبات يرفعها رئيس النيابة العامة بهذه الصفة."
                ]
              },
              {
                "number": "559",
                "paragraphs": [
                  "إذا بلغ لعلم الوكيل العام للملك بمحكمة النقض أن حكماً غير قابل للاستئناف صدر خرقاً للقانون أو للصيغ الجوهرية المتعلقة بالإجراءات، ولم يتقدم أي أحد من الأطراف بطلب نقض هذا الحكم داخل الأجل المقرر، تولى الوكيل العام للملك رفع هذا الطلب إلى المحكمة بصفة تلقائية.",
                  "إذا صدر الحكم بالنقض، فإنه يمكن للأطراف الاحتجاج به لتفادي مقتضيات الحكم المنقوض أو لمعارضة تنفيذه."
                ]
              },
              {
                "number": "560",
                "paragraphs": [
                  "يمكن لرئيس النيابة العامة أن يحيل إلى الغرفة الجنائية الإجراءات القضائية أو القرارات أو الأحكام التي تصدر خرقاً للقانون أو خرقاً للإجراءات الجوهرية للمسطرة.",
                  "يمكن لمحكمة النقض أن تبطل الأحكام المطعون فيها بالنقض لفائدة القانون، وفي هذه الحالة يمكن أن يستفيد المحكوم عليه من الإبطال دون أن يضر ذلك بمصالحه، ودون أن يكون له أي مفعول على الحقوق المدنية."
                ]
              },
              {
                "number": "561",
                "paragraphs": [
                  "لا يمكن أن يرتكز الطعن بالنقض لفائدة القانون المرفوع طبقاً لمقتضيات المادة 560 أعلاه على أسباب كانت محكمة النقض قد رفضتها بمناسبة طعن سابق في الحكم نفسه."
                ]
              },
              {
                "number": "562",
                "paragraphs": [
                  "تراعى في تقديم طلبات الطعن بالنقض المقدمة لفائدة القانون وفي البت فيها المسطرة العادية لدى محكمة النقض.",
                  "غير أن الوكيل العام للملك، باعتباره طرفاً رئيسياً في الدعوى، يقدم مستنتجاته قبل تقرير المستشار المقرر."
                ]
              }
            ]
          }
        ]
      },
      {
        "name": "القسم الثاني",
        "title": "إعادة النظر وتصحيح القرارات",
        "articles": [
          {
            "number": "563",
            "paragraphs": [
              "يجوز طلب إعادة النظر في القرارات التي تصدرها محكمة النقض في الحالات التالية:",
              "أولاً: ضد القرارات الصادرة استناداً إلى وثائق صرح أو اعترف بزوريتها. يجب في هذه الحالة على الطرف الذي يطلب إعادة النظر، ما عدا النيابة العامة أو الإدارات العمومية، أن يودع كفالة مالية مبلغها خمسة آلاف درهم تحت طائلة عدم القبول، ويحتفظ بمبلغ الكفالة لفائدة الخزينة العامة في حالة عدم قبول دعوى إعادة النظر.",
              "ثانياً: من أجل تصحيح القرارات التي لحقها خطأ مادي واضح يمكن تصحيحه من خلال عناصر مأخوذة من القرارات نفسها، ويقدم طلب التصحيح بمذكرة ترفع إلى الغرفة التي أصدرت القرار موضوع التصحيح.",
              "ثالثاً: إذا أغفل البت في أحد الطلبات المعروضة بمقتضى وسائل استدل بها، أو في حالة عدم تعليل القرار.",
              "رابعاً: ضد القرارات الصادرة بعدم القبول أو بالسقوط لأسباب ناشئة عن بيانات ذات صبغة رسمية تبين عدم صحتها عن طريق وثائق رسمية جديدة وقع الاستدلال بها فيما بعد.",
              "يقدم طلب إعادة النظر من قبل الطرف المعني بواسطة محام مقبول للترافع أمام محكمة النقض، أو من النيابة العامة أو من الإدارات العمومية، بإيداع مذكرة بكتابة ضبط محكمة النقض داخل أجل ستين يوماً من تاريخ تبليغ القرار المطعون فيه، باستثناء الحالة المشار إليها في البند الأول أعلاه.",
              "تبت محكمة النقض في الطلب وفقاً لمقتضيات المواد من 539 إلى 557 من هذا القانون، مع مراعاة مقتضيات المادة 564 بعده.",
              "إذا تعلق الأمر بتصحيح أخطاء مادية، فإن محكمة النقض تصرح في حالة قبول الطلب بتصحيح الخطأ دون حاجة إلى الإحالة.",
              "في كل الأحوال، لا يترتب عن طلب إعادة النظر في القرارات الصادرة عن محكمة النقض أي أثر موقف للعقوبة المحكوم بها."
            ]
          },
          {
            "number": "564",
            "paragraphs": [
              "يجب، تحت طائلة البطلان، أن يكون طلب الطعن بإعادة النظر بسبب الزور في وثيقة قدمت إلى محكمة النقض مرفقاً بتوكيل خاص صادر عن مدعي الزور ومصادق على إمضائه عليه، ويقدم الطلب إلى الرئيس الأول لمحكمة النقض.",
              "لا يقبل الطلب إلا إذا تم إيداع الكفالة المشار إليها في المادة السابقة بكتابة الضبط.",
              "تبلغ المذكرة إلى النيابة العامة.",
              "يصدر الرئيس أمراً بالرفض أو أمراً يأذن فيه بتقييد دعوى الزور.",
              "يبلغ الأمر الذي يأذن بتقييد دعوى الزور إلى علم المدعي به داخل أجل خمسة عشر يوماً ابتداءً من تاريخ النطق به، مع الترخيص له بتقييد دعوى الزور موضوع طلبه بكتابة ضبط محكمة النقض.",
              "تبت المحكمة، بعد إجراء بحث، في مدى صحة الادعاء.",
              "إذا ثبت الزور، تصرح المحكمة بوجوده وتأمر برد المبلغ المودع للطالب."
            ]
          }
        ]
      },
      {
        "name": "القسم الثالث",
        "title": "المراجعة",
        "articles": [
          {
            "number": "565",
            "paragraphs": [
              "لا يفتح باب المراجعة إلا لتدارك خطأ في الوقائع تضرر منه شخص حكم عليه من أجل جناية أو جنحة.",
              "لا تقبل المراجعة إلا عند انعدام أية طريقة أخرى من طرق الطعن وفي الحالات وضمن الشروط المنصوص عليها في المواد من 566 إلى 574 من هذا القانون."
            ]
          },
          {
            "number": "566",
            "paragraphs": [
              "يمكن أن يقدم طلب المراجعة أيا كانت المحكمة التي بتت في الدعوى وأيا كانت العقوبة الصادرة فيها:",
              "-1 إذا صدرت عقوبة في دعوى القتل، وأدلي بعد ذلك بمستندات أو حجج ثبت منها قيام قرائن أو علامات كافية تدل على وجود المجني عليه المزعوم قتله؛",
              "-2 إذا صدرت عقوبة على متهم، وصدر بعد ذلك مقرر ثان يعاقب متهما آخر من أجل نفس الفعل، ولم يمكن التوفيق بين المقررين لما بينهما من تناقض يستخلص منه الدليل على براءة أحد المحكوم عليهما؛",
              "-3 إذا جرت بعد صدور الحكم بالإدانة متابعة شاهد سبق الاستماع إليه، وحكم عليه من أجل شهادة الزور ضد المتهم، ولا يمكن أثناء المناقشات الجديدة الاستماع إلى الشاهد المحكوم عليه بهذه الصفة؛",
              "-4 إذا طرأت واقعة بعد صدور الحكم بالإدانة أو تم الكشف عنها، أو إذا تم تقديم مستندات كانت مجهولة أثناء المناقشات، ومن شأنها أن تثبت براءة المحكوم عليه."
            ]
          },
          {
            "number": "567",
            "paragraphs": [
              "يخول حق طلب المراجعة في الحالات الثلاث الأولى المشار إليها في المادة 566 أعلاه لمن يأتي ذكرهم:",
              "-1 للوكيل العام للملك لدى محكمة النقض؛",
              "-2 للمحكوم عليه أو نائبه القانوني في حالة عدم الأهلية؛",
              "-3 لزوج المحكوم عليه المتوفى أو المصرح بغيبته وأولاده ووالديه وورثته والموصى لهم، ولمن تلقى توكيلاً خاصاً منه قبل وفاته.",
              "يرجع حق طلب المراجعة في الحالة الرابعة المنصوص عليها في المادة 566 أعلاه إلى الوكيل العام للملك لدى محكمة النقض بصفته رئيساً للنيابة العامة."
            ]
          },
          {
            "number": "1-567",
            "paragraphs": [
              "تحدث بمحكمة النقض هيئة للمراجعة تبت في قبول أو عدم قبول طلبات المراجعة.",
              "تتألف هيئة المراجعة من ثلاثة مستشارين يعينهم الرئيس الأول لمحكمة النقض، ويمكن للهيئة أن تعين مقررا لكل قضية.",
              "تتأكد هيئة المراجعة من توفر الصفة في مقدم الطلب وتوفر الشروط اللازمة والوثائق المدعمة للطلب.",
              "باستثناء الوكيل العام للملك لدى محكمة النقض، لا يقبل طلب المراجعة إلا بعد إيداع طالب المراجعة مبلغ 20.000 درهم بصندوق المحكمة.",
              "تحيل هيئة المراجعة الطلبات التي تتوصل بها إلى الوكيل العام للملك لدى محكمة النقض قصد تقديم ملتمساته داخل أجل ثمانية أيام من تاريخ توصله بها، وتبت في قبول طلب المراجعة داخل أجل خمسة عشر يوما من تقديم هذه الملتمسات. ولا تقبل قراراتها أي طعن.",
              "يرد المبلغ المودع لطالب المراجعة في حالة قبول الطلب."
            ]
          },
          {
            "number": "568",
            "paragraphs": [
              "تقبل هيئة المراجعة طلبات المراجعة المستوفية للشروط القانونية وتحيلها إلى الغرفة الجنائية بمحكمة النقض للبت فيها وفقا للقانون.",
              "لا يترتب عن طلب المراجعة أي أثر موقف للعقوبة المحكوم بها.",
              "لا يشارك القضاة أعضاء هيئة المراجعة المنصوص عليها في المادة 1-567 أعلاه ضمن الهيئة التي تبت في الطلب تحت طائلة البطلان."
            ]
          },
          {
            "number": "569",
            "paragraphs": [
              "يوقف بقوة القانون تنفيذ المقرر القضائي الصادر بالعقوبة إذا كان لم ينفذ، وذلك ابتداء من تاريخ إحالة طلب المراجعة إلى الغرفة الجنائية بمحكمة النقض.",
              "إذا كان المحكوم عليه في حالة اعتقال، فإنه يمكن إيقاف التنفيذ بمقرر صادر عن الغرفة الجنائية بمحكمة النقض بعد إدلاء النيابة العامة بمستنتجاتها.",
              "كما يمكن إيقاف التنفيذ فيما بعد إن اقتضى الحال، بمقتضى القرار الصادر عن محكمة النقض تطبيقا للمادة 571 أدناه، ويمكن للمحكمة عند الاقتضاء إخضاع المحكوم عليه لواحد أو أكثر من تدابير المراقبة القضائية المنصوص عليها في المادة 161 من هذا القانون.",
              "في كلتا الحالتين لا تحتسب مدة إيقاف التنفيذ ضمن أجل التقادم."
            ]
          },
          {
            "number": "570",
            "paragraphs": [
              "تبت الغرفة الجنائية بمحكمة النقض في قبول طلب المراجعة المحال إليها وفقاً لمقتضيات المادة 568 أعلاه.",
              "تجري الغرفة الجنائية إن اقتضى الحال، إما مباشرة أو بواسطة إنابة قضائية، جميع الأبحاث والمقابلات والتحقيقات في هوية الأشخاص والتحريات الكفيلة بإظهار الحقيقة.",
              "عندما تصبح القضية جاهزة للبت فيها، تصدر محكمة النقض حسب الأحوال قراراً بالرفض أو قراراً بالإبطال، وإذا لم يترك الإبطال ما يمكن وصفه بأنه جناية أو جنحة بالنسبة للمحكوم عليهم الذين ما زالوا أحياء، فيقع التصريح بعدم الإحالة."
            ]
          },
          {
            "number": "571",
            "paragraphs": [
              "إذا ارتأت المحكمة، في حالة الإبطال، أنه يمكن أن تجرى من جديد مناقشات شفهية حضورية، أحالت القضية للحكم فيها مرة أخرى إلى محكمة مماثلة نوعاً ودرجة للمحكمة التي أصدرت المقرر الذي تم إبطاله، أو إلى نفس المحكمة وهي متركبة من هيئة أخرى.",
              "تنظر هذه المحكمة في القضية من جديد حسب الإجراءات العادية.",
              "إذا كان المتهم قد توفي أو اعتراه خلل عقلي، أو إذا كانت الأفعال لم تعد توصف قانوناً بجريمة بعد صدور قرار محكمة النقض الذي أبطل الحكم أو القرار بالإدانة، فإن الغرفة الجنائية، بناءً على ملتمسات الوكيل العام للملك لدى محكمة النقض، تبت في القضية طبقاً لما ورد في الفقرة الأولى من المادة 572 والمادة 573 بعده."
            ]
          },
          {
            "number": "572",
            "paragraphs": [
              "إذا استحال في حالة الإبطال إجراء مناقشات شفهية جديدة بين جميع الأطراف، وبالأخص في حالة وفاة المحكوم عليه أو إصابته بخلل عقلي، أو عند إجراء المسطرة الغيابية في حقه أو في حالة تغيبه، أو في حالة انعدام مسؤوليته الجنائية، أو عند وجود عذر قانوني، وكذا في حالة تقادم الدعوى أو تقادم العقوبة، فإن محكمة النقض، بعد التثبت صراحة من هذه الاستحالة، تبت في جوهر الدعوى بدون سابق نقض ولا إحالة، وذلك بحضور الأطراف المدنية إن كانوا موجودين في الدعوى، والقيمين الذين تعينهم المحكمة ليقوموا مقام كل متوفى.",
              "يقتصر نظر المحكمة في هذه الحالة على إبطال العقوبات التي صدرت في غير محلها."
            ]
          },
          {
            "number": "573",
            "paragraphs": [
              "يمكن استنادا إلى المقرر الجديد المترتبة عنه براءة المحكوم عليه، وبناء على طلبه، الحكم له بتعويض عن الضرر الذي لحقه بسبب الإدانة.",
              "إذا كان ضحية الخطأ القضائي قد توفي، انتقل الحق في رفع طلب التعويض، حسب نفس الشروط، إلى زوجه وأصوله وفروعه، ولا يمكن أن يؤول هذا الحق لأقارب آخرين أبعد صلة إلا إذا أدلوا بما يبرر أن ضررا ماديا لحقهم من العقوبة المحكوم بها.",
              "يقبل طلب التعويض في سائر مراحل مسطرة المراجعة.",
              "تتحمل الدولة ما يحكم به من تعويضات، على أنه يحق لها الرجوع على الطرف المدني أو الواشي أو شاهد الزور الذين تسببوا بخطئهم في صدور العقوبة، وتؤدى التعويضات كما تؤدى مصاريف القضاء الجنائي."
            ]
          },
          {
            "number": "574",
            "paragraphs": [
              "يؤدي طالب المراجعة مسبقا مصاريف الدعوى إلى غاية صدور القرار بقبولها، أما المصاريف الواجبة بعد هذا القرار فتؤديها مسبقا الخزينة.",
              "إذا ترتب عن المراجعة صدور قرار أو حكم نهائي بعقوبة، فإن المحكوم عليه يتحمل رد المصاريف للخزينة، ويمكن تحميلها لطالبي المراجعة إن اقتضى الحال.",
              "إذا خسر طالب المراجعة الدعوى حكم عليه بجميع المصاريف.",
              "إذا ترتب عن المراجعة قرار أو حكم ببراءة المحكوم عليه، فإن القرار أو الحكم يعلق على جدران المدينة التي صدر فيها الحكم بالإدانة سابقا، والمدينة التي بها مقر المحكمة التي بتت في المراجعة، والجماعة التي ارتكبت فيها الجناية أو الجنحة، والجماعة التي يوجد فيها موطن طالب المراجعة، والتي كان فيها آخر موطن للشخص الذي وقع في حقه الخطأ القضائي.",
              "إذا كان هذا الشخص قد توفي، نشر القرار أو الحكم تلقائيا وبدون طلب في الجريدة الرسمية، ويؤمر بنشره زيادة على ذلك في خمس جرائد يختارها طالب المراجعة إن طلب ذلك.",
              "تتحمل الخزينة مصاريف النشر المشار إليها."
            ]
          }
        ]
      }
    ]
  }