{
    "name": "الكتاب الثاني",
    "title": "الحكم في الجرائم",
    "sections": [
      {
        "name": "القسم الأول",
        "title": "الاختصاص",
        "articles": [
          {
            "number": "251",
            "paragraphs": [
              "تختص بالنظر في الجرائم، ما لم تنص قوانين خاصة على خلاف ذلك، المحاكم الزجرية الآتي بيانها:",
              "1 - المحاكم الابتدائية؛",
              "2 - محاكم الاستئناف."
            ]
          }
        ],
        "chapters": [
          {
            "name": "الباب الأول",
            "title": "قواعد الاختصاص العادية وفصل تنازع الاختصاص",
            "sections": [
              {
                "name": "الفرع الأول",
                "title": "قواعد الاختصاص العادية",
                "articles": [
                  {
                    "number": "252",
                    "paragraphs": [
                      "تختص المحاكم الابتدائية بالنظر في الجنح والمخالفات."
                    ]
                  },
                  {
                    "number": "253",
                    "paragraphs": [
                      "تختص غرف الجنح الاستئنافية بالنظر في الاستئنافات المرفوعة ضد الأحكام الصادرة ابتدائيا عن المحاكم الابتدائية.",
                      "تختص الغرفة الجنحية بمحكمة الاستئناف وفقا لمقتضيات المواد 231 وما يليها إلى 247 من هذا القانون.",
                      "استثناء من أحكام الفقرة الأولى تختص غرفة الاستئنافات بالمحكمة الابتدائية بالنظر في الاستئنافات المرفوعة ضد الأحكام الصادرة ابتدائيا عن المحاكم الابتدائية في قضايا المخالفات المشار إليها في المادة 396 بعده، وفي القضايا الجنحية التي لا تتجاوز عقوبتها سنتين حبسا وغرامة أو إحدى هاتين العقوبتين فقط."
                    ]
                  },
                  {
                    "number": "254",
                    "paragraphs": [
                      "تختص غرفة الجنايات بمحكمة الاستئناف بالنظر في الجرائم المنصوص عليها في المادة 416 بعده.",
                      "تختص غرفة الجنايات الاستئنافية وفقاً لمقتضيات المادة 457 من هذا القانون."
                    ]
                  },
                  {
                    "number": "255",
                    "paragraphs": [
                      "يرجع النظر في حالة تعدد الجرائم واجتماعها بسبب عدم قابليتها للتجزئة إلى المحكمة المختصة بالحكم في الجريمة الأشد.",
                      "تطبق نفس القاعدة بصفة اختيارية إذا اتحدت جرائم فيما بينها بعلاقة الارتباط."
                    ]
                  },
                  {
                    "number": "256",
                    "paragraphs": [
                      "تعتبر الجرائم غير قابلة للتجزئة خاصة إذا كانت متصلة اتصالاً وثيقاً لدرجة أن وجود بعضها لا يتصور بدون وجود البعض الآخر، أو عندما تكون مترتبة عن نفس السبب وناشئة عن نفس الدافع وارتكبت في نفس الزمن وفي نفس المكان."
                    ]
                  },
                  {
                    "number": "257",
                    "paragraphs": [
                      "تكون الجرائم مرتبطة إذا ارتكبت في وقت واحد من طرف عدة أشخاص مجتمعين.",
                      "تكون الجرائم مرتبطة إذا ارتكبت من طرف أشخاص مختلفين ولو في أوقات متباينة وفي أماكن مختلفة على إثر اتفاق تم بينهم من قبل.",
                      "تكون الجرائم مرتبطة إذا ارتكب الجناة جرائم للحصول على وسائل تمكنهم من ارتكاب جرائم أخرى، أو تساعدهم على إتمام تنفيذها أو تمكنهم من الإفلات من العقوبة.",
                      "يعتبر إخفاء الأشياء مرتبطاً بالجريمة التي مكنت من الحصول على الأشياء المخفاة أو من انتزاعها أو اختلاسها كلاً أو بعضاً."
                    ]
                  },
                  {
                    "number": "258",
                    "paragraphs": [
                      "تختص المحكمة المحالة عليها الدعوى العمومية بالبت في كل دفع يثيره المتهم للدفاع عن نفسه.",
                      "غير أن المحكمة المذكورة لا تكون مختصة بالبت في الدفع الذي يثيره المتهم للدفاع عن نفسه إذا قرر القانون خلاف ذلك أو إذا تعلق الأمر بحق عيني عقاري.",
                      "لا يقبل أي دفع في الأحوال المنصوص عليها في الفقرة الثانية من هذه المادة إلا إذا كان مبرراً بوقائع أو بمستندات تدعم ادعاءات المتهم، وكان الدفع المثار من شأنه أن يجرد الفعل المرتكز عليه في المتابعة من طابع المخالفة للقانون الجنائي.",
                      "في حالة قبول الدفع، تحدد المحكمة أجلاً قصيراً يتعين على المتهم أثناءه أن يرفع دعواه إلى المحكمة المختصة.",
                      "إذا لم ترفع الدعوى في الأجل المحدد ولم يدل المتهم بما يثبت مباشرته للإجراءات المتعلقة بها، تعرض المحكمة عن دفعه وتواصل النظر في القضية."
                    ]
                  },
                  {
                    "number": "259",
                    "paragraphs": [
                      "يرجع الاختصاص، مع مراعاة مقتضيات القسمين الأول والثاني من الكتاب السابع من هذا القانون، إلى المحكمة التي يقع في دائرة نفوذها محل ارتكاب الجريمة، أو محل إقامة المتهم، أو محل إقامة أحد المساهمين أو المشاركين معه في الجريمة.",
                      "يرجع الاختصاص كذلك إلى محل إلقاء القبض على المتهم أو على أحد المشاركين ولو كان القبض مترتباً عن سبب آخر.",
                      "كما يرجع الاختصاص إلى محل المؤسسة السجنية المعتقل بها أحد الأشخاص المشار إليهم في هذه المادة."
                    ]
                  },
                  {
                    "number": "260",
                    "paragraphs": [
                      "لا تطبق أحكام هذا الفرع المتعلقة بقواعد الاختصاص العادية على الأحداث الذين يقل سنهم عن ثمانية عشر عاماً إلا مع مراعاة المقتضيات المنصوص عليها في الكتاب الثالث من هذا القانون."
                    ]
                  },
                  {
                    "number": "260-1",
                    "paragraphs": [
                      "استثناء من قواعد الاختصاص المنصوص عليها في هذا الفرع، تختص أقسام الجرائم المالية بمحاكم الاستئناف المحددة والمعينة دوائر نفوذها بمرسوم بالنظر في الجنايات المنصوص عليها في الفصول من 241 إلى 256-7 من مجموعة القانون الجنائي وكذا الجرائم التي لا يمكن فصلها عنها أو المرتبطة بها.",
                      "كما تختص محاكم الرباط والدار البيضاء وفاس ومراكش، المحددة والمعينة دوائر نفوذها بمرسوم، بالمتابعة والتحقيق والبت في الأفعال التي تكون جرائم غسل الأموال."
                    ]
                  }
                ]
              },
              {
                "name": "الفرع الثاني",
                "title": "فصل تنازع الاختصاص",
                "articles": [
                  {
                    "number": "261",
                    "paragraphs": [
                      "يتعين الفصل في تنازع الاختصاص إذا تمت المتابعة من أجل نفس الفعل في آن واحد أمام محاكم استئناف ومحاكم أخرى، أو أمام عدة قضاة للتحقيق.",
                      "يتعين الفصل في تنازع الاختصاص إذا أعلنت عدة محاكم عن عدم اختصاصها بالنظر في نفس الفعل بمقرر نهائي.",
                      "يتعين الفصل في تنازع الاختصاص إذا أعلنت هيئة الحكم عن عدم اختصاصها بمقرر نهائي بعد أن أحيلت إليها القضية بأمر من قاضي التحقيق أو من الغرفة الجنحية."
                    ]
                  },
                  {
                    "number": "262",
                    "paragraphs": [
                      "في حالة وجود نزاع بين محكمتين تابعتين لدائرة نفوذ محكمة استئناف واحدة، فإن النزاع يرفع إلى غرفة الجنح الاستئنافية.",
                      "في حالة وجود نزاع بين محكمتين تخضع كل واحدة منهما لنفوذ محكمة استئناف مختلفة، فإن النزاع يرفع إلى الغرفة الجنائية بمحكمة النقض.",
                      "يسري نفس الحكم في حالة وجود نزاع بين محكمتين استئنافيتين، أو نزاع بين محاكم لا توجد محكمة أعلى مشتركة بينها."
                    ]
                  },
                  {
                    "number": "263",
                    "paragraphs": [
                      "يمكن أن يطلب الفصل في تنازع الاختصاص كل من النيابة العامة أو المتهم أو الطرف المدني، ويقدم هذا الطلب بمذكرة تودع بكتابة الضبط للمحكمة التي تبت في تنازع الاختصاص.",
                      "تبلغ المذكرة لجميع الأطراف داخل خمسة أيام من يوم إيداعها، ولهم أجل عشرة أيام لإيداع مذكراتهم الجوابية بكتابة الضبط.",
                      "على المحكمة أن تبت داخل أجل شهرين من تاريخ تبليغ المذكرة المتضمنة للطلب.",
                      "لا يترتب عن تقديم الطلب ولا عن الدعوى المثارة أي أثر موقف، ما لم تقرر المحكمة التي ستنظر في تنازع الاختصاص خلاف ذلك.",
                      "لهذه المحكمة أن تأمر بإحضار جميع الوثائق المفيدة، ولها حق البت في صحة جميع الإجراءات التي قامت بها المحكمة التي صدر إليها الأمر بالتخلي.",
                      "لا يقبل مقرر المحكمة التي بتت في تنازع الاختصاص التعرض أو الاستئناف."
                    ]
                  }
                ]
              }
            ]
          },
          {
            "name": "الباب الثاني",
            "title": "قواعد الاختصاص الاستثنائية",
            "sections": [
              {
                "name": "الفرع الأول",
                "title": "الحكم في الجنايات أو الجنح المنسوبة لبعض القضاة أو الموظفين",
                "articles": [
                  {
                    "number": "264",
                    "paragraphs": [
                      "تجري المسطرة وفقا للشكليات المنصوص عليها في هذا الفرع في حق الأشخاص المشار إليهم في المواد من 265 إلى 268 أدناه، إذا نسب إليهم ارتكاب فعل معاقب عليه بوصفه جناية أو جنحة."
                    ]
                  },
                  {
                    "number": "1-264",
                    "paragraphs": [
                      "تجري مسطرة البحث، في حق الأشخاص المشار إليهم في المواد 265 و266 و267 أدناه، إذا نسب إليهم ارتكاب فعل معاقب عليه بوصفه جناية أو جنحة، وفقا للمقتضيات المنصوص عليها في القسم الثاني من الكتاب الأول من هذا القانون.",
                      "تطبق نفس المسطرة في حق الأشخاص المشار إليهم في المادة 268 أدناه إذا نسب إليهم أثناء مزاولة مهامهم ارتكاب جناية أو جنحة.",
                      "إذا تعلق الأمر بالأشخاص المشار إليهم في المادة 265 أدناه، فإن الوكيل العام للملك لدى محكمة النقض أو من ينوب عنه من المحامين العامين هو الذي يشرف على البحث ويباشر شخصيا الاستماع إليهم وتفتيش منازلهم، كما يمكن له أن ينتدب لهذه الغاية واحدا أو أكثر من قضاة النيابة العامة أو من ضباط الشرطة القضائية من ذوي الاختصاص الوطني.",
                      "إذا تعلق الأمر بالأشخاص المشار إليهم في المواد من 266 إلى 268 أدناه، فإن الوكيل العام للملك لدى محكمة الاستئناف المختص ترابيا هو الذي يشرف على البحث ويقوم شخصيا أو بواسطة أحد قضاة النيابة العامة العاملين بدائرة نفوذه بالاستماع إليهم وتفتيش منازلهم، كما يمكن له أن ينتدب لذلك أحد ضباط الشرطة القضائية من ذوي الاختصاص الوطني.",
                      "غير أنه لا يمكن إلقاء القبض على الأشخاص المشار إليهم في الفقرة السابقة أو إخضاعهم لتدبير الحراسة النظرية أو المراقبة القضائية أو اتخاذ أي إجراء يقيد من حريتهم إلا بموافقة الوكيل العام للملك لدى محكمة النقض، بناء على طلب يرفعه إليه الوكيل العام للملك لدى محكمة الاستئناف المختص كلما اقتضى البحث اتخاذ أحد الإجراءات المذكورة."
                    ]
                  },
                  {
                    "number": "265",
                    "paragraphs": [
                      "إذا كان الفعل منسوباً إلى رئيس الحكومة أو إلى مستشار لجلالة الملك أو إلى رئيس مجلس النواب أو رئيس مجلس المستشارين أو عضو من أعضاء الحكومة أو رئيس المحكمة الدستورية أو عضو بها أو عضو في المجلس الأعلى للسلطة القضائية أو رئيس أول لمحكمة ثاني درجة أو وكيل عام للملك لديها، أو قاض بمحكمة النقض أو بالمجلس الأعلى للحسابات أو بالمحكمة العسكرية، أو قاض ملحق أو رهن الإشارة بإدارة ذات اختصاص وطني، أو إلى وال أو عامل أو ضابط للشرطة القضائية له اختصاص وطني، فإن الوكيل العام للملك لدى محكمة النقض عند الاقتضاء يحيل القضية إلى الغرفة الجنائية بمحكمة النقض.",
                      "إذا تعلق الأمر بفعل منسوب إلى الرئيس الأول لمحكمة النقض أو للوكيل العام للملك لديها، فإن المتابعة تقرر فيها لجنة تتألف من أقدم رئيس غرفة وأقدم محام عام ومن أقدم عضو بالغرفة الجنائية بمحكمة النقض، وتتولى هذه اللجنة ممارسة اختصاصات الوكيل العام للملك لدى محكمة النقض المشار إليها في الفقرة الأولى من هذه المادة.",
                      "تقوم الغرفة الجنائية بمحكمة النقض وفق الفقرتين الأولى والثانية أعلاه، بناء على ملتمس النيابة العامة لديها، بتعيين مستشار لإجراء تحقيق في القضية، وعند الاقتضاء يعين مستشاراً أو أكثر لمساعدته في إجراءات التحقيق.",
                      "يجري التحقيق حسب الكيفية المنصوص عليها في القسم الثالث من الكتاب الأول من هذا القانون، مع مراعاة أن البت في الطعن بالاستئناف في الأوامر الصادرة عن المستشار المكلف بالتحقيق يتم أمام الغرفة الجنائية بمحكمة النقض دون حضور المستشار أو المستشارين المكلفين بالتحقيق.",
                      "بعد انتهاء التحقيق يصدر المستشار أو المستشارون المكلفون بالتحقيق، حسب الأحوال، أمراً قضائياً بعدم المتابعة أو بالإحالة إلى الغرفة الجنائية بمحكمة النقض.",
                      "تبت الغرفة الجنائية بمحكمة النقض في القضية.",
                      "يقبل قرار الغرفة الجنائية الاستئناف داخل أجل خمسة عشر يوماً، وتبت في الاستئناف غرف محكمة النقض مجتمعة باستثناء الغرفة الجنائية التي بتت في القضية.",
                      "لا تقبل أي مطالبة بالحق المدني أمام محكمة النقض."
                    ]
                  },
                  {
                    "number": "266",
                    "paragraphs": [
                      "إذا كان الفعل منسوباً إلى قاض بمحكمة الدرجة الثانية أو رئيس محكمة درجة أولى أو وكيل الملك لديها أو قاض بمجلس جهوي للحسابات، فإن الوكيل العام للملك لدى محكمة الاستئناف الذي أجرى البحث أو أشرف عليه، عندما يقرر إجراء المتابعة، يطلب من الوكيل العام للملك لدى محكمة النقض تعيين محكمة استئناف غير التي يزاول المعني بالأمر مهامه بدائرتها لمواصلة الإجراءات.",
                      "يقوم الرئيس الأول لمحكمة الاستئناف المعينة وفق الفقرة الأولى أعلاه، بناء على ملتمس النيابة العامة لديها، بتعيين مستشار لإجراء تحقيق في القضية، وعند الاقتضاء يعين مستشاراً أو أكثر لمساعدته في إجراءات التحقيق.",
                      "يجري التحقيق حسب الكيفية المنصوص عليها في القسم الثالث من الكتاب الأول من هذا القانون.",
                      "بعد انتهاء التحقيق يصدر المستشار أو المستشارون المكلفون بالتحقيق، حسب الأحوال، أمراً قضائياً بعدم المتابعة أو بالإحالة إلى الجهة القضائية المختصة.",
                      "تحال القضية إلى غرفة الجنايات بمحكمة الاستئناف إذا تعلق الأمر بجناية، وتجري المحاكمة وفق القواعد العادية.",
                      "إذا تعلق الأمر بجنحة تحال القضية إلى محكمة الاستئناف، وتبت فيها حينئذ هيئة تتألف من ثلاثة مستشارين، وتستأنف أحكامها لدى غرفة الجنح الاستئنافية التي تقبل قراراتها الطعن بالنقض وفق الإجراءات وداخل الآجال العادية.",
                      "تكون أوامر المستشار أو المستشارين المكلفين بالتحقيق قابلة للطعن طبقاً للمقتضيات المنصوص عليها في القسم الثالث من الكتاب الأول من هذا القانون.",
                      "يمكن للطرف المدني أن يتدخل أمام هيئة التحقيق أو الحكم إذا أحيلت إليها القضية طبقاً لهذه المادة حسب المقتضيات المنصوص عليها في المواد 94 و350 و351 من هذا القانون."
                    ]
                  },
                  {
                    "number": "267",
                    "paragraphs": [
                      "إذا كان الفعل منسوباً إلى قاض بمحكمة أول درجة، تطبق المسطرة المنصوص عليها في المادة 266 أعلاه."
                    ]
                  },
                  {
                    "number": "268",
                    "paragraphs": [
                      "إذا نسب لكاتب عام لعمالة أو إقليم أو باشا أو رئيس دائرة أو رئيس منطقة حضرية أو قائد أو لضابط شرطة قضائية من غير الضباط المشار إليهم في المادة 265 أعلاه، أو موظف أو عون إدارة من حاملي السلاح مخول له الصفة الضبطية ارتكابه لجناية أو جنحة أثناء مزاولة مهامه، تطبق المقتضيات المنصوص عليها في المادة 266 أعلاه."
                    ]
                  }
                ]
              },
              {
                "name": "الفرع الثاني",
                "title": "المعاقبة على الجرائم المرتكبة أثناء جلسات هيئة الحكم",
                "articles": [
                  {
                    "number": "269",
                    "paragraphs": [
                      "خلافا للقواعد العادية الراجعة للاختصاص أو المسطرة، تنظر المحاكم في الجرائم التي قد ترتكب خلال الجلسات، وذلك إما بموجب ملتمسات من النيابة العامة أو تلقائيا وضمن الشروط المحددة في المادة 357 وما يليها إلى المادة 361 من هذا القانون.",
                      "إذا كانت الجريمة المقترفة لها صفة جناية، فإن الهيئة القضائية تأمر بتحرير محضر بالوقائع، وتحيل فورا مرتكب الفعل بواسطة القوة العمومية والمستندات إلى النيابة العامة المختصة."
                    ]
                  }
                ]
              },
              {
                "name": "الفرع الثالث",
                "title": "الإحالة من أجل تشكك مشروع",
                "articles": [
                  {
                    "number": "270",
                    "paragraphs": [
                      "يمكن للغرفة الجنائية بمحكمة النقض أن تسحب الدعوى من أجل تشكك مشروع من أي هيئة للتحقيق أو هيئة للحكم، وتحيلها إلى هيئة قضائية من نفس الدرجة."
                    ]
                  },
                  {
                    "number": "271",
                    "paragraphs": [
                      "يجب أن تقدم طلبات الإحالة قبل أي استجواب أو مناقشة في الجوهر، ما لم تكن الأفعال المستند عليها مبررا للإحالة قد طرأت أو اكتشفت بعد ذلك.",
                      "يودع الطلب بكتابة الضبط بمحكمة النقض إما من طرف الوكيل العام للملك لدى هذه المحكمة أو النيابة العامة بالمحكمة المرفوعة إليها الدعوى، أو المتهم، أو الطرف المدني.",
                      "لا يترتب عن إيداع الطلب أي أثر موقف، ما لم تقرر الغرفة الجنائية بمحكمة النقض خلاف ذلك.",
                      "يبلغ الطلب فورا لجميع الأطراف الذين يهمهم الأمر ويحدد لهم أجل عشرة أيام لإيداع مذكرة بكتابة الضبط بمحكمة النقض.",
                      "تبت الغرفة الجنائية بمحكمة النقض في غرفة المشورة دون حضور الأطراف داخل أجل شهر من تاريخ تقديم الطلب، ويبلغ إليهم على الفور القرار الصادر عنها.",
                      "لا يقبل القرار الصادر أي طعن."
                    ]
                  }
                ]
              },
              {
                "name": "الفرع الرابع",
                "title": "الإحالة من أجل مصلحة عامة",
                "articles": [
                  {
                    "number": "272",
                    "paragraphs": [
                      "يمكن للغرفة الجنائية بمحكمة النقض، بناء على ملتمس من الوكيل العام للملك لدى محكمة النقض وحده، أن تأمر بالإحالة من أجل الأمن العمومي.",
                      "ويمكن أيضا لنفس الغرفة، بناء على ملتمس من الوكيل العام للملك لدى محكمة النقض أو من الوكيل العام للملك لدى محكمة الاستئناف المعنية، تلقائيا أو بناء على طلب الأطراف، أن تأمر بالإحالة لتحقيق حسن سير العدالة، بشرط ألا ينتج عن ذلك أي ضرر يعرقل ظهور الحقيقة أو يمس بممارسة حقوق الدفاع.",
                      "تجري المسطرة في الحالتين حسب الكيفيات المنصوص عليها في المادة 271 أعلاه.",
                      "غير أنه يمكن تقديم طلب الإحالة في جميع مراحل المسطرة بما فيها مرحلة البحث وكذلك في جميع مراحل ممارسة الدعوى العمومية.",
                      "ويخفض الأجل الممنوح للأطراف لإيداع المذكرة إلى 48 ساعة.",
                      "كما أن الغرفة الجنائية لمحكمة النقض تبت في الطلب داخل أجل لا يتعدى عشرة أيام من تاريخ تقديمه.",
                      "لا يقبل القرار الصادر أي طعن."
                    ]
                  }
                ]
              }
            ]
          }
        ]
      },
      {
        "name": "القسم الثاني",
        "title": "تجريح القضاة",
        "articles": [
          {
            "number": "273",
            "paragraphs": [
              "يمكن تجريح كل قاض من قضاة الحكم في الأحوال الآتية:",
              "إذا كانت له أو لزوجه مصلحة شخصية مباشرة أو غير مباشرة في الحكم في الدعوى.",
              "إذا كانت له أو لزوجه قرابة أو مصاهرة مع أحد الأطراف بما فيها درجة أبناء الأعمام والأخوال.",
              "إذا كان بين أحد الأطراف والقاضي أو زوجه أو أصولهما أو فروعهما دعوى لا تزال جارية أو انتهت منذ أقل من سنتين.",
              "إذا كان القاضي دائنا أو مدينا لأحد الأطراف.",
              "إذا كان قد سبق له أن قدم استشارة أو رافع أو مثل أمام القضاء في قضية أو نظر فيها بصفته حكما أو أدلى فيها بشهادة أو بت فيها في طورها الابتدائي.",
              "إذا كان قد تصرف بصفته ممثلا قانونيا لأحد الأطراف.",
              "إذا كانت هناك علاقة تبعية بين القاضي أو زوجه وأحد الأطراف أو زوجه.",
              "إذا كانت بين القاضي وأحد الأطراف صداقة أو عداوة معروفة.",
              "إذا كان القاضي هو المشتكي."
            ]
          },
          {
            "number": "274",
            "paragraphs": [
              "لا يمكن تجريح قضاة النيابة العامة."
            ]
          },
          {
            "number": "275",
            "paragraphs": [
              "يتعين على كل قاض بينه وبين متهم سبب من أسباب التجريح المنصوص عليها في المادة 273 أو أي سبب آخر لتنحيته، أن يقدم تصريحا بذلك إلى الرئيس الأول لمحكمة النقض أو الرئيس الأول لمحكمة الاستئناف حسب الكيفيات المنصوص عليها في المادة 278 بعده."
            ]
          },
          {
            "number": "276",
            "paragraphs": [
              "يملك حق التجريح المتهم والمسؤول المدني والطرف المدني."
            ]
          },
          {
            "number": "277",
            "paragraphs": [
              "يجب على من أراد تجريح قاض أن يقوم بذلك قبل أية مناقشة في الجوهر.",
              "وإذا كان التجريح موجها إلى القاضي المكلف بالتحقيق، فيجب أن يقدم قبل أي استجواب أو استماع يتعلق بالجوهر، ما لم تكن أسباب التجريح قد طرأت أو لم يعلم بها المطالب بالتجريح إلا لاحقا."
            ]
          },
          {
            "number": "278",
            "paragraphs": [
              "يقدم طلب التجريح كتابة، ويجب أن تبين فيه تحت طائلة البطلان الوسيلة المثارة للتجريح، وأن يرفق بجميع الحجج المفيدة ويوقعه طالب التجريح أو وكيله الخاص.",
              "يرفع التجريح إلى الرئيس الأول لمحكمة الاستئناف إذا كان موجها ضد قاض تابع لدائرة نفوذ هذه المحكمة وإلى الرئيس الأول لمحكمة النقض إذا كان التجريح موجها ضد أحد قضاة المحكمة المذكورة."
            ]
          },
          {
            "number": "279",
            "paragraphs": [
              "لا يترتب عن إيداع طلب التجريح تخلي القاضي الذي قدم بشأنه هذا الطلب إلا في الحالة المنصوص عليها في المادة 284 بعده.",
              "غير أنه يمكن للرئيس الأول أن يأمر بعد استشارة الوكيل العام للملك إما بإيقاف متابعة التحقيق أو المناقشات، وإما بإيقاف صدور الحكم."
            ]
          },
          {
            "number": "280",
            "paragraphs": [
              "يطلب الرئيس الأول إيضاحات من القاضي أو القضاة المقدم طلب التجريح في حقهم.",
              "وله أن يطلب إيضاحات تكميلية من طالب التجريح إذا ارتأى أن ذلك ضروري.",
              "ويبت في ملتمس التجريح بعد استشارة الوكيل العام للملك."
            ]
          },
          {
            "number": "281",
            "paragraphs": [
              "لا يعلل الأمر الصادر بقبول طلب التجريح ولا يقبل أي طعن.",
              "ويترتب عنه التخلي عن الدعوى فورا من طرف القاضي أو القضاة الذين وقع تجريحهم."
            ]
          },
          {
            "number": "282",
            "paragraphs": [
              "يعلل الأمر القضائي الصادر برفض طلب التجريح.",
              "ويمكن الطعن فيه أمام محكمة النقض، غير أن تقديم هذا الطعن لا يحول دون متابعة المسطرة ولا دون صدور الحكم في الدعوى."
            ]
          },
          {
            "number": "283",
            "paragraphs": [
              "كل طلب تجريح موجه ضد الرئيس الأول لمحكمة الاستئناف، يجب أن يقدم بمذكرة إلى الرئيس الأول لمحكمة النقض الذي يبت فيه بعد استشارة الوكيل العام للملك لدى نفس المحكمة بأمر قضائي غير قابل لأي طعن.",
              "وتطبق المقتضيات المنصوص عليها في المادة 279 أعلاه."
            ]
          },
          {
            "number": "284",
            "paragraphs": [
              "إذا ادعى أحد الأطراف في بداية الاستجواب أو الجلسة بأن سببا من أسباب التجريح قد طرأ، أو أخبر به في ذلك الوقت، وصرح بأنه يطلب تجريح قاض للتحقيق أو قاض أو أكثر من القضاة المكونين لهيئة الحكم، تعين عليه أن يحرر فورا مذكرة بذلك.",
              "ويترتب عن الطلب إيقاف الاستجواب أو المناقشات وتوجه المذكرة دون تأخير إلى الرئيس الأول."
            ]
          },
          {
            "number": "285",
            "paragraphs": [
              "يمكن الحكم على من خسر طلب التجريح بغرامة تتراوح بين 1200 و2500 درهم، بصرف النظر عن العقوبة التي قد يتعرض لها عند الاقتضاء، من أجل إهانة القضاء إذا كان من طبيعة الوقائع المزعومة المس بشرف وسمعة القاضي."
            ]
          }
        ]
      },
      {
        "name": "القسم الثالث",
        "title": "بشأن عقد الجلسات وصدور الأحكام",
        "chapters": [
          {
            "name": "الباب الأول",
            "title": "الجلسات",
            "sections": [
              {
                "name": "الفرع الأول",
                "title": "وسائل الإثبات",
                "articles": [
                  {
                    "number": "286",
                    "paragraphs": [
                      "يمكن إثبات الجرائم بأية وسيلة من وسائل الإثبات، ما عدا في الأحوال التي يقضي القانون فيها بخلاف ذلك، ويحكم القاضي حسب اقتناعه الصميم، ويجب أن يتضمن المقرر ما يبرر اقتناع القاضي وفقا للبند 8 من المادة 365 من هذا القانون.",
                      "لا يجوز للمحكمة أن تبني قناعتها بالإدانة على تصريحات متهم ضد متهم آخر إلا إذا كانت معززة بقرائن قوية ومنسجمة.",
                      "تتلقى المحكمة هذه التصريحات دون أداء اليمين القانونية.",
                      "إذا ارتأت المحكمة أن الإثبات غير قائم صرحت بعدم إدانة المتهم وحكمت ببراءته."
                    ]
                  },
                  {
                    "number": "287",
                    "paragraphs": [
                      "لا يمكن للمحكمة أن تبني مقررها إلا على حجج عرضت أثناء الجلسة ونوقشت شفهياً وحضورياً أمامها."
                    ]
                  },
                  {
                    "number": "288",
                    "paragraphs": [
                      "إذا كان ثبوت الجريمة يتوقف على دليل تسري عليه أحكام القانون المدني أو أحكام خاصة، تراعي المحكمة في ذلك الأحكام المذكورة."
                    ]
                  },
                  {
                    "number": "289",
                    "paragraphs": [
                      "لا يعتد بالمحاضر التي يحررها ضباط وأعوان الشرطة القضائية والموظفون والأعوان المكلفون ببعض مهام الشرطة القضائية إلا إذا كانت صحيحة في الشكل، وضمن فيها محررها وهو يمارس مهام وظيفته ما عاينه أو تلقاه شخصياً في مجال اختصاصه."
                    ]
                  },
                  {
                    "number": "290",
                    "paragraphs": [
                      "يعتد بالمحاضر التي يحررها ضباط الشرطة القضائية في شأن التثبت من الجنح والمخالفات إلى أن يثبت العكس بأي وسيلة من وسائل الإثبات."
                    ]
                  },
                  {
                    "number": "291",
                    "paragraphs": [
                      "يعتبر ما عدا ذلك من المحاضر المشار إليها في المادة 290 أعلاه مجرد تصريحات تخضع لتقدير المحكمة."
                    ]
                  },
                  {
                    "number": "292",
                    "paragraphs": [
                      "إذا نص قانون خاص على أنه لا يمكن الطعن في مضمون بعض المحاضر أو التقارير إلا بالزور، فلا يمكن تحت طائلة البطلان إثبات عكسها بغير هذه الوسيلة."
                    ]
                  },
                  {
                    "number": "293",
                    "paragraphs": [
                      "يخضع الاعتراف كغيره من وسائل الإثبات للسلطة التقديرية للقضاة.",
                      "لا يعتد بكل اعتراف ثبت انتزاعه بالعنف أو الإكراه.",
                      "وعلاوة على ذلك، يتعرض مرتكب العنف أو الإكراه للعقوبات المنصوص عليها في القانون الجنائي."
                    ]
                  },
                  {
                    "number": "294",
                    "paragraphs": [
                      "لا يمكن أن ينتج الدليل الكتابي من الرسائل المتبادلة بين المتهم ومحاميه."
                    ]
                  },
                  {
                    "number": "295",
                    "paragraphs": [
                      "يجب على المحكمة التي تأمر بإجراء الخبرة أن تراعي في ذلك مقتضيات المادتين 194 و195 والمادة 198 وما يليها إلى غاية 208 من هذا القانون."
                    ]
                  },
                  {
                    "number": "296",
                    "paragraphs": [
                      "تقام الحجة بشهادة الشهود وفقاً لمقتضيات المواد من 325 إلى 347-3 من هذا القانون."
                    ]
                  }
                ]
              },
              {
                "name": "الفرع القاني",
                "title": "تشكيل الهيئات القضائية",
                "articles": [
                  {
                    "number": "297",
                    "paragraphs": [
                      "يشترط لصحة انعقاد الجلسات أن تشكل كل هيئة قضائية طبقاً للقانون المؤسس لها.",
                      "يجب تحت طائلة البطلان أن تصدر مقرراتها عن قضاة شاركوا في جميع المناقشات، وإذا تعذر حضور قاض أو أكثر أثناء النظر في القضية تعاد المناقشات من جديد.",
                      "بصرف النظر عن المقتضيات المنصوص عليها في المادة 52 المتعلقة بقاضي التحقيق، لا يمكن تحت طائلة البطلان لأي قاض من النيابة العامة عين أو انتدب لمهام قضاء الحكم أن يشارك في البت في قضايا سبق له أن مارس فيها الدعوى العمومية.",
                      "علاوة على ذلك، وتحت طائلة نفس الجزاء، لا يمكن لقضاة الحكم أن يشاركوا في الحكم في قضية سبق لهم البت في موضوعها."
                    ]
                  }
                ]
              },
              {
                "name": "الفرع الثالث",
                "title": "القواعد العامة بشأن سير الجلسة",
                "articles": [
                  {
                    "number": "298",
                    "paragraphs": [
                      "يتولى رئيس الجلسة ضبط النظام وتسيير البحث والمناقشات بها.",
                      "له، مع مراعاة حقوق الدفاع، رفض كل ما يرمي إلى إطالتها بدون جدوى، وله أن يوقفها."
                    ]
                  },
                  {
                    "number": "299",
                    "paragraphs": [
                      "تبت الهيئة القضائية تلقائياً أو بناء على طلب في مدى استمرارية الاعتقال الاحتياطي أو تدابير الوضع تحت المراقبة القضائية، ويقبل المقرر الصادر عنها الطعن وفقاً للكيفيات المنصوص عليها في المادتين 181 و181-1 من هذا القانون.",
                      "تبت الهيئة القضائية في الطلبات الرامية إلى تأجيل القضية إلى تاريخ لاحق.",
                      "إذا كان جميع الأطراف حاضرين أو ممثلين في الجلسة، يمكن للمحكمة أن تؤجل القضية إلى تاريخ تحدده على الفور وتشعر به الأطراف دون حاجة لتسليم استدعاءات جديدة.",
                      "يمكن للمحكمة، إذا دعت الضرورة، أن تؤجل القضية لأجل غير معين، غير أنه يجب في هذه الحالة تجديد استدعاء الأطراف للحضور من جديد.",
                      "يحق للمحكمة، تلقائياً أو بناء على ملتمس من النيابة العامة أو طلب من الأطراف، أن تأمر بعقل العقار كلما تعلق الأمر بجريمة تمس بحق الملكية العقارية.",
                      "يترتب عن هذا الإجراء منع التصرف في العقار طيلة مدة سريان مفعوله، ويكون كل تصرف بعوض أو بدون عوض مع وجود العقل باطلاً وعديم الأثر."
                    ]
                  },
                  {
                    "number": "300",
                    "paragraphs": [
                      "يجب تحت طائلة البطلان أن تتم إجراءات البحث والمناقشات في جلسة علنية، ما عدا في الحالات المنصوص عليها في المادتين 301 و302 بعده.",
                      "لا يمكن إثارة هذا البطلان فيما بعد إلا إذا طلب ممثل النيابة العامة أو الطرف المدني أو المتهم تسجيل الإشهاد بعدم علنية الجلسة."
                    ]
                  },
                  {
                    "number": "301",
                    "paragraphs": [
                      "يمكن للرئيس أن يمنع الأحداث أو بعضهم من دخول قاعة الجلسات إذا ارتأى أن حضورهم فيها غير مناسب."
                    ]
                  },
                  {
                    "number": "302",
                    "paragraphs": [
                      "إذا اعتبرت المحكمة أن في علنية الجلسة خطراً على الأمن أو على الأخلاق، أصدرت مقرراً بجعل الجلسة سرية.",
                      "إذا تعلق الأمر بقضية عنف أو اعتداء جنسي ضد المرأة أو القاصر، يمكن للمحكمة أن تعقد جلسة سرية بطلب من الضحية.",
                      "إذا تقررت سرية الجلسة للأسباب المذكورة، فإنها تشمل أيضاً تلاوة أي حكم يبت في نزاع عارض طرأ أثناء البحث أو المناقشات."
                    ]
                  },
                  {
                    "number": "303",
                    "paragraphs": [
                      "يمكن للرئيس بعد أخذ رأي النيابة العامة أن يأذن باستعمال آلات التصوير أو التسجيل أو الإرسال أو الالتقاط أو الاتصال المختلفة بقاعة الجلسات أو في أي مكان آخر يجري به تحقيق قضائي.",
                      "يعاقب عن مخالفة هذه المقتضيات بغرامة تتراوح بين خمسة آلاف وخمسين ألف درهم، وتصادر المحكمة الآلات والأشرطة عند الاقتضاء.",
                      "يعاقب بنفس العقوبة كل من يقوم بتصوير شخص في حالة اعتقال أو يحمل أصفاداً أو قيوداً دون موافقة منه، وكل من يقوم بنشر صورة أخذت في هذه الظروف دون إذن صاحبها.",
                      "يتعرض لنفس العقوبة كل من يقوم بنشر تحقيق أو تعليق أو استطلاع للرأي يتعلق بشخص تجري في حقه مسطرة قضائية بصفته متهماً أو ضحية دون موافقته.",
                      "تجري المتابعة في الحالتين بناء على شكاية من المعني بالأمر.",
                      "يعاقب عن الأفعال المشار إليها إذا ارتكبت قبل إدانة الشخص المعني بحكم مكتسب لقوة الشيء المقضي به."
                    ]
                  },
                  {
                    "number": "304",
                    "paragraphs": [
                      "يتحقق الرئيس في كل قضية من هوية المتهم، وينادي على الشهود، ويتأكد من حضور الضحية أو الطرف المدني والمسؤول عن الحقوق المدنية والخبراء والترجمان.",
                      "يأمر بانسحاب الشهود والخبراء.",
                      "يشرع آنذاك في دراسة الدعوى، وتشمل البحث والمناقشات.",
                      "يمكن، وفق النظام التقني المعتمد، تسجيل ما راج بكل جلسة.",
                      "تفرغ التسجيلات في محاضر قانونية تكون لها نفس حجية المحاضر المحررة يدوياً.",
                      "يمكن تذييلها بالتوقيع الإلكتروني أو الرقمي للرئيس وكاتب الضبط، ويمكن للأطراف الحصول على نسخ ورقية أو إلكترونية."
                    ]
                  },
                  {
                    "number": "305",
                    "paragraphs": [
                      "يشمل بحث القضية استنطاق المتهم إن كان حاضراً والاستماع إلى الضحية والشهود والخبراء وتقديم أدوات الاقتناع عند الاقتضاء.",
                      "يحرر كاتب الضبط محضراً يلخص فيه أهم ما جاء في الأجوبة والتصريحات ويضمنه منطوق المقررات ويوقعه الرئيس وكاتب الضبط.",
                      "يمكن للنيابة العامة والأطراف أو دفاعهم طلب تلاوة المحضر أو تضمين ما أغفل.",
                      "يجب أن يتضمن المحضر جميع مجريات الجلسة بدقة وأن يتاح فوراً للأطراف بجميع الوسائل المتاحة.",
                      "تفترض سلامة الإجراءات القانونية ما لم يثبت خلاف ذلك بالمحضر أو المقرر.",
                      "إذا رفض المعتقل الحضور تطبق الفقرة الثالثة من المادة 423 من هذا القانون."
                    ]
                  },
                  {
                    "number": "306",
                    "paragraphs": [
                      "تجري المناقشات بعد انتهاء البحث حسب الترتيب التالي: طلبات الطرف المدني، ثم ملتمسات النيابة العامة، ثم دفاع المتهم والمسؤول عن الحقوق المدنية عند الاقتضاء، ويكون المتهم آخر من يتكلم.",
                      "يعلن الرئيس بعد ذلك انتهاء المناقشات."
                    ]
                  },
                  {
                    "number": "307",
                    "paragraphs": [
                      "إذا تعذر إنهاء البحث أو المناقشات في جلسة واحدة، قررت المحكمة مواصلتها في تاريخ تحدده فوراً.",
                      "إذا دعت الضرورة إلى تأجيل غير محدد، وجب استدعاء الأطراف من جديد.",
                      "تحرص المحكمة في جميع الأحوال على أن تتم المحاكمة داخل أجل معقول."
                    ]
                  }
                ]
              },
              {
                "name": "الفرع الرابع",
                "title": "الاستدعاء وحضور المتهمين",
                "articles": [
                  {
                    "number": "308",
                    "paragraphs": [
                      "يسلم الاستدعاء بالحضور للمتهم والضحية والمسؤول المدني والطرف المدني طبق الشروط المنصوص عليها في قانون المسطرة المدنية.",
                      "يتضمن الاستدعاء، تحت طائلة البطلان، بيان اليوم والساعة ومحل انعقاد الجلسة ونوع الجريمة وتاريخ ومحل ارتكابها والمواد القانونية المطبقة بشأنها."
                    ]
                  },
                  {
                    "number": "309",
                    "paragraphs": [
                      "يتعرض للإبطال الاستدعاء والحكم إذا لم يفصل بين تاريخ تبليغ الاستدعاء واليوم المحدد للحضور بالجلسة أجل ثمانية أيام على الأقل.",
                      "إذا كان المتهم أو أحد الأطراف الآخرين يقيمون خارج المملكة، فلا يمكن أن يقل الأجل المذكور عن شهرين إذا كانوا يسكنون بباقي دول المغرب العربي أو بدولة من دول أوربا.",
                      "لا يمكن أن يقل الأجل عن ثلاثة أشهر إذا كانوا يسكنون بدولة غير الدول المنصوص عليها في الفقرة السابقة."
                    ]
                  },
                  {
                    "number": "310",
                    "paragraphs": [
                      "يتعين تقديم كل استدلال ببطلان الاستدعاء قبل إثارة أي دفع أو دفاع في جوهر الدعوى وإلا سقط الحق في تقديمه.",
                      "غير أنه إذا حضر المتهم في الجلسة بنفسه أو بواسطة محاميه فله إثارة بطلان الاستدعاء، ويمكنه أن يطلب من المحكمة إصلاح ما يكون قد شاب الاستدعاء من أخطاء أو استيفاء أي نقص فيه.",
                      "في هذه الحالة يتعين على المحكمة منحه أجلاً لتهيئة دفاعه قبل البدء في مناقشة القضية."
                    ]
                  },
                  {
                    "number": "311",
                    "paragraphs": [
                      "يحضر المتهمون شخصياً ما لم تعفهم المحكمة من الحضور طبقاً للفقرة الثانية من المادة 314 بعده."
                    ]
                  },
                  {
                    "number": "312",
                    "paragraphs": [
                      "يتعين على كل متهم أن يحضر في الجلسة باستثناء الحالات المنصوص عليها في المادة 311 أعلاه والبند 1 من الفقرة الأولى من المادة 314 أدناه.",
                      "إذا تخلف المتهم عن الحضور طبقت بشأنه مقتضيات المادة 314 والمواد من 391 إلى 395 أدناه أو المسطرة الغيابية في القضايا الجنائية.",
                      "يمكن في القضايا الجنحية إحضار المتهم المعتقل للجلسة بدون سابق استدعاء وإصدار حكم حضوري في حقه.",
                      "إذا كان المتهم في وضعية صحية يتعذر عليه فيها حضور الجلسة أو امتنع عن الحضور، ووجدت أسباب خطيرة لا يمكن معها تأجيل الحكم، تكلف المحكمة بمقتضى مقرر خاص ومعلل أحد أعضائها بمساعدة كاتب الضبط لاستنطاق المتهم في المكان الذي يوجد به.",
                      "تحدد المحكمة عند الاقتضاء الأسئلة التي يقترحها القضاة والنيابة العامة والأطراف.",
                      "يتم الاستنطاق بحضور محامي المتهم عند الاقتضاء.",
                      "تستأنف المناقشات بعد تحديد جلسة يستدعى لها المتهم أو يشعر بها من طرف القاضي الذي قام باستنطاقه، ويشار إلى هذا الإشعار بمحضر الاستنطاق.",
                      "إذا لم يحضر المتهم للجلسة المذكورة يكون المقرر الصادر في حقه بمثابة حضوري.",
                      "يحرر كاتب الضبط محضر الاستنطاق ويتلوه بالجلسة بأمر من الرئيس ويكون محتواه محل مناقشة علنية.",
                      "إذا رفض المتهم الحاضر بمقر المحكمة الحضور أمامها دون مبرر تطبق أحكام الفقرة الخامسة من المادة 423 من هذا القانون."
                    ]
                  },
                  {
                    "number": "313",
                    "paragraphs": [
                      "إذا كان المتهم حاضراً في الجلسة عند المناداة على القضية فلا يمكنه بعد ذلك أن يعتبر غائباً ولو في حالة انسحابه من الجلسة أو امتناعه عن الدفاع عن نفسه."
                    ]
                  },
                  {
                    "number": "314",
                    "paragraphs": [
                      "إذا لم يحضر الشخص المستدعى قانونياً في اليوم والساعة المحددين في الاستدعاء حوكم غيابياً ما عدا في الحالات المنصوص عليها قانوناً.",
                      "تطبق مقتضيات هذه المادة على الطرف المدني وعلى المسؤول عن الحقوق المدنية.",
                      "يمكن للمحكمة إذا تعدد الأشخاص المتابعون وتعذر استدعاء أحدهم أن تقرر فصل الملف ومواصلة محاكمة باقي المتهمين بكيفية مستقلة.",
                      "لا يحول تخلف المتهم عن الحضور أو غيابه عن الجلسة من حقه في الدفاع والاستماع لمرافعة محاميه من طرف المحكمة."
                    ]
                  },
                  {
                    "number": "315",
                    "paragraphs": [
                      "يمكن لكل متهم أو ممثله القانوني أن يستعين بمحام في سائر مراحل المسطرة.",
                      "تسري مقتضيات المادة 421 بعده في شأن الاتصال بالمحامي والاطلاع على الملف والحصول على نسخ من وثائق الملف."
                    ]
                  },
                  {
                    "number": "316",
                    "paragraphs": [
                      "تكون مؤازرة المحامي إلزامية في الجنايات أمام غرفة الجنايات.",
                      "تكون مؤازرة المحامي إلزامية في القضايا الجنحية إذا كان المتهم حدثاً يقل عمره عن ثمانية عشر عاماً أو أبكم أو أعمى أو مصاباً بعاهة تخل بحقه في الدفاع.",
                      "تكون المؤازرة إلزامية إذا كان المتهم معرضاً للحكم عليه بالإبعاد.",
                      "تكون المؤازرة إلزامية في الحالة المنصوص عليها في الفقرة الرابعة من المادة 312 أعلاه."
                    ]
                  },
                  {
                    "number": "317",
                    "paragraphs": [
                      "إذا لم يتم اختيار أي محام أو تعيينه أو إذا تخلف المحامي المختار أو المعين عن حضور المناقشات أو رفض القيام بمهمته أو وضع حداً لها، فإن رئيس الجلسة يعين فوراً محامياً آخر في الأحوال التي تكون فيها مؤازرته إلزامية."
                    ]
                  },
                  {
                    "number": "317-1",
                    "paragraphs": [
                      "يجب على المحكمة أن تعين للضحية الذي يرغب في تقديم مطالبه المدنية، متى كان حدثاً أو في وضعية إعاقة، محامياً ينوب عنه للدفاع عن مصالحه في إطار المساعدة القضائية.",
                      "تستفيد هذه الفئة من خدمات المساعدة الاجتماعية بالمحكمة في كل مراحل المسطرة القضائية."
                    ]
                  },
                  {
                    "number": "318",
                    "paragraphs": [
                      "يأمر الرئيس بإحضار المتهم.",
                      "إذا كان هذا الأخير يتكلم لغة أو لهجة أو لساناً يصعب فهمه على القضاة أو على الأطراف أو الشهود، أو إذا اقتضت الضرورة ترجمة مستند أدلي به للمناقشة، عين الرئيس تلقائياً ترجماناً، وإلا ترتب عن الإخلال بذلك البطلان، وتطبق على الترجمان مقتضيات المادة 120 أعلاه.",
                      "تعين المحكمة للضحية أو المطالب بالحق المدني، إذا كان يتكلم لغة أو لهجة أو لساناً يصعب فهمه، ترجماناً أو شخصاً يتولى الترجمة بعد أدائه اليمين القانونية.",
                      "يمكن للمتهم أو النيابة العامة أو الضحية أو الطرف المدني أو المسؤول عن الحقوق المدنية أن يجرحوا الترجمان وقت تعيينه مع بيان موجب التجريح، وتبت المحكمة في هذا الطلب بمقرر غير قابل لأي طعن.",
                      "إذا كان المتهم أصم أو أبكم، تعين تغيير سير المناقشات على نحو يمكنه من تتبعها بصورة مجدية، وتراعى في ذلك أحكام المادة 121 أعلاه."
                    ]
                  },
                  {
                    "number": "319",
                    "paragraphs": [
                      "يستجوب الرئيس المتهم عن هويته ويخبره بالتهمة الموجهة إليه."
                    ]
                  },
                  {
                    "number": "320",
                    "paragraphs": [
                      "يأمر الرئيس بالمناداة على الشهود عند الاقتضاء، ويدعوهم لمغادرة القاعة، ثم يستنطق المتهم في جوهر القضية."
                    ]
                  },
                  {
                    "number": "321",
                    "paragraphs": [
                      "يمكن للرئيس أن يأمر بتلاوة محاضر المعاينة ومحاضر التفتيش أو الحجز وتقارير الخبراء، وكذا جميع الوثائق المفيدة لإظهار الحقيقة.",
                      "للرئيس أيضاً عند استنطاق المتهم أن يأمر بتلاوة الاستنطاقات التي أجريت أثناء التحقيق ولو تعلق الأمر بجرائم مرتبطة بالجريمة موضوع المحاكمة.",
                      "إذا حدث نزاع عارض، بتت فيه المحكمة."
                    ]
                  },
                  {
                    "number": "322",
                    "paragraphs": [
                      "يمكن للنيابة العامة وللأطراف أو لمحاميهم أن يلقوا أسئلة على المتهم بواسطة الرئيس أو بإذن منه، وكذا الشأن بالنسبة للقضاة في هيئات القضاء الجماعي.",
                      "إذا امتنع الرئيس من إلقاء سؤال وطرأ بشأنه نزاع عارض، بتت فيه المحكمة."
                    ]
                  },
                  {
                    "number": "323",
                    "paragraphs": [
                      "يجب تحت طائلة السقوط أن تقدم قبل كل دفاع في جوهر الدعوى ودفعة واحدة طلبات الإحالة بسبب عدم الاختصاص، ما لم تكن بسبب نوع الجريمة، وأنواع الدفع المترتبة إما عن بطلان الاستدعاء أو بطلان المسطرة المجراة سابقاً، وكذا المسائل المتعين فصلها أولياً.",
                      "يتعين على المحكمة البت في هذه الطلبات فوراً، ولها بصفة استثنائية تأجيل النظر فيها بقرار معلل إلى حين البت في الجوهر.",
                      "تواصل المحكمة المناقشات، ويبقى حق الطعن محفوظاً ليستعمل في آن واحد مع الطعن في الحكم الذي يصدر في جوهر الدعوى."
                    ]
                  },
                  {
                    "number": "324",
                    "paragraphs": [
                      "إذا أثير البطلان في غير الأحوال المشار إليها في المادة 227 أعلاه، يمكن للمحكمة المحالة إليها القضية، بعد الاستماع إلى النيابة العامة والأطراف، أن تصدر حكماً بإبطال الوثائق التي تعتبرها مشوبة بالبطلان.",
                      "يجب أن تقدم طلبات الإبطال المثارة من الأطراف دفعة واحدة قبل استنطاق المتهم في موضوع الدعوى، وذلك تحت طائلة سقوط الحق في تقديمها.",
                      "يمكن للأطراف أن يتنازلوا عن التمسك بالدفع بالبطلان إذا لم يكن مقرراً إلا لمصلحتهم فقط، ويجب أن يكون هذا التنازل صريحاً، ولا يقبل تنازل المتهم إلا بحضور محاميه أو بعد استدعائه بصفة قانونية.",
                      "إذا اقتصرت المحكمة على إبطال بعض الإجراءات فقط، فيجب أن تصرح بسحبها من المناقشات وتأمر بحفظها في كتابة الضبط، وتطبق عندئذ مقتضيات المادة 213 أعلاه.",
                      "إذا أدى بطلان الإجراء إلى بطلان الإجراءات اللاحقة كلاً أو بعضاً، فإن المحكمة تأمر بإجراء تحقيق تكميلي إذا ارتأت أنه بالإمكان تدارك البطلان، وفي حالة العكس تحيل القضية إلى النيابة العامة وتبت، عند الاقتضاء، في شأن الاعتقال الاحتياطي أو المراقبة القضائية."
                    ]
                  }
                ]
              },
              {
                "name": "الفرع الخامس",
                "title": "الاستماع إلى الشهود والخبراء",
                "articles": [
                  {
                    "number": "325",
                    "paragraphs": [
                      "يتعين على كل شخص استدعي بصفته شاهداً أن يحضر ويؤدي اليمين، عند الاقتضاء، ثم يؤدي شهادته.",
                      "يستدعى الشاهد تلقائياً من طرف المحكمة أو بناء على طلب النيابة العامة أو الطرف المدني أو المتهم أو المسؤول عن الحقوق المدنية أو الضحية، إما برسالة مضمونة مع إشعار بالاستلام، أو باستدعاء يبلغه موظف مكلف بالتبليغ أو مفوض قضائي، أو بالطريقة الإدارية أو أي وسيلة اتصال تترك أثرا كتابيا.",
                      "ينص في الاستدعاء على أن القانون يعاقب على عدم الحضور كما يعاقب على شهادة الزور."
                    ]
                  },
                  {
                    "number": "326",
                    "paragraphs": [
                      "لا يمكن استدعاء أعضاء الحكومة بصفة شهود إلا بإذن من مجلس الحكومة على إثر تقرير يقدمه وزير العدل بناء على المعطيات المرفوعة إليه من قبل الرئيس الأول لمحكمة الاستئناف المختصة.",
                      "إذا منح هذا الإذن، فتتلقى الشهادة وفقاً للإجراءات العادية.",
                      "إذا لم يطلب الحضور أو لم يؤذن فيه، فإن الشهادة تتلقى كتابة بمنزل الشاهد من طرف الرئيس الأول لمحكمة الاستئناف أو قاض ينتدبه إذا كان الشاهد مقيماً خارج دائرة نفوذ المحكمة.",
                      "يستعين الرئيس الأول أو القاضي المعين من قبله بكاتب للضبط.",
                      "توجه المحكمة المحالة إليها القضية إلى الرئيس الأول أو القاضي المنتدب ملخص الوقائع والطلبات والأسئلة المطلوب أداء الشهادة فيها.",
                      "تسلم الشهادة فوراً إلى كتابة ضبط المحكمة التي تم تلقي الشهادة بدائرة نفوذها، أو ترسل مغلقة ومختوماً عليها إلى كتابة ضبط المحكمة التي طلبت أداء الشهادة، وتبلغ فوراً إلى النيابة العامة والأطراف المعنيين.",
                      "تتلى الشهادة بالجلسة العلنية وتعرض على المناقشة، وإلا ترتب عن ذلك البطلان."
                    ]
                  },
                  {
                    "number": "327",
                    "paragraphs": [
                      "تطلب الشهادة التي يؤديها كتابة ممثل دولة أجنبية من المعني بالأمر بواسطة الوزارة المكلفة بالشؤون الخارجية.",
                      "إذا قبل الطلب، يتلقى الشهادة الرئيس الأول لمحكمة الاستئناف أو القاضي الذي يعينه لهذه الغاية.",
                      "تتم الإجراءات وفقاً للمقتضيات المنصوص عليها في المادة 326 أعلاه."
                    ]
                  },
                  {
                    "number": "328",
                    "paragraphs": [
                      "يأمر الرئيس الشهود بالانسحاب إلى القاعة المعدة لهم، ولا يغادرونها إلا لأداء شهادتهم.",
                      "يتخذ الرئيس، عند الاقتضاء، جميع التدابير لمنع الشهود من التحدث بشأن القضية سواء فيما بينهم أو بينهم وبين المتهم."
                    ]
                  },
                  {
                    "number": "329",
                    "paragraphs": [
                      "بعد انسحاب الشهود، يتولى الرئيس استنطاق المتهمين حسب الترتيب الذي يراه ملائماً دون أن يكشف عن رأيه الخاص.",
                      "لا يمكن للقضاة المستشارين ولا للنيابة العامة ولا للطرف المدني ولا لمحامي المتهم أن يلقوا أسئلة على المتهم إلا بعد استنطاقه من الرئيس وتلقى الأسئلة بواسطته أو بعد الحصول على إذنه."
                    ]
                  },
                  {
                    "number": "329-1",
                    "paragraphs": [
                      "يمكن للمحكمة في إطار حماية الشهود أن تأمر، بمقتضى مقرر معلل، بالانتقال إلى المكان الذي يوجد فيه الشاهد والاستماع إليه.",
                      "تطبق حينئذ مقتضيات الفقرات 4 و5 و6 و7 من المادة 312 أعلاه."
                    ]
                  },
                  {
                    "number": "330",
                    "paragraphs": [
                      "يستمع إلى الشهود فرادى بعد استنطاق المتهم.",
                      "يستفسر الرئيس كل شاهد عن اسمه العائلي واسمه الشخصي وسنه وحالته ومهنته ومحل إقامته، وعند الاقتضاء عن قبيلته وفخذته الأصلية، وعن ما إذا كانت تربطه بالمتهم أو الطرف المدني قرابة أو مصاهرة ودرجتهما أو علاقة عمل أو أية علاقة أخرى أو عداوة أو خصومة.",
                      "يسأله كذلك عما إذا كان محروماً من أهلية أداء الشهادة."
                    ]
                  },
                  {
                    "number": "331",
                    "paragraphs": [
                      "يؤدي الشاهد قبل الإدلاء بشهادته اليمين المنصوص عليها في المادة 123 أعلاه، ويترتب عن الإخلال بذلك بطلان الحكم أو القرار.",
                      "يمكن أن تتلى عليه قبل أداء اليمين المقتضيات القانونية القاضية بالمعاقبة على شهادة الزور."
                    ]
                  },
                  {
                    "number": "332",
                    "paragraphs": [
                      "يستمع إلى الأحداث الذين يقل سنهم عن ثمانية عشر سنة دون أداء اليمين، وكذا المحكوم عليهم بعقوبة جنائية والمحرومين من الإدلاء بالشهادة أمام العدالة.",
                      "يعفى من اليمين أصول المتهم وفروعه وزوجه، وتعتبر تصريحاتهم مجرد معلومات.",
                      "غير أن أداء اليمين من شخص معفى منها أو لا أهلية له أو محروم من أداء الشهادة لا يعد سبباً للبطلان ما لم تعترض النيابة العامة أو أحد الأطراف."
                    ]
                  },
                  {
                    "number": "333",
                    "paragraphs": [
                      "لا يتعين على الشاهد الذي يستمع إليه عدة مرات أثناء نفس المناقشات تجديد يمينه، غير أن الرئيس يذكره عند الاقتضاء باليمين التي سبق له أن أداها."
                    ]
                  },
                  {
                    "number": "334",
                    "paragraphs": [
                      "لا يمكن سماع شهادة محامي المتهم حول ما علمه بهذه الصفة.",
                      "يمكن الاستماع إلى الأشخاص المقيدين بالسر المهني وفق الشروط وفي حدود ما يقرره القانون."
                    ]
                  },
                  {
                    "number": "335",
                    "paragraphs": [
                      "إذا كان الشاهد يتكلم لغة أو لهجة أو لساناً يصعب فهمه، طبقت في شأنه مقتضيات المادة 120 من هذا القانون.",
                      "إذا كان الشاهد أصم أو أبكم، تطبق في حقه مقتضيات المادة 121 من هذا القانون."
                    ]
                  },
                  {
                    "number": "336",
                    "paragraphs": [
                      "يؤدي الشهود شهادتهم حسب الترتيب المعد من الطرف الذي طلب شهادتهم.",
                      "يستمع أولاً إلى الشهود المطلوبة شهادتهم من طرف طالبي المتابعة، غير أنه يمكن للرئيس أن يقرر خلاف ذلك."
                    ]
                  },
                  {
                    "number": "337",
                    "paragraphs": [
                      "يؤدي الشاهد شهادته شفهياً، ويمكنه بصفة استثنائية أن يستعين بمذكرات بإذن من رئيس الهيئة.",
                      "بعد أداء كل شهادة، يسأل الرئيس المتهم والضحية عما إذا كان لديهما ما يصرحان به رداً على ما أدلي به.",
                      "يطرح الرئيس على الشاهد الأسئلة التي يراها ضرورية، وعند الاقتضاء الأسئلة المقترحة من القضاة المستشارين والنيابة العامة ثم الأطراف أو يؤذن لهم بطرحها مباشرة."
                    ]
                  },
                  {
                    "number": "338",
                    "paragraphs": [
                      "ينص كاتب الضبط في محضر الجلسة على هوية الشهود وعلى اليمين التي أديت، ويترتب عن الإخلال بذلك بطلان الحكم أو القرار.",
                      "يلخص علاوة على ذلك أهم ما جاء في شهادتهم."
                    ]
                  },
                  {
                    "number": "339",
                    "paragraphs": [
                      "إذا لم يحضر شاهد استدعي بصفة قانونية وظهر أن تصريحه لا يستغنى عنه، يمكن للمحكمة بناء على ملتمس من النيابة العامة أو تلقائياً أن تأمر بإحضاره حالاً باستعمال القوة العمومية أو أن تؤجل القضية إلى جلسة مقبلة.",
                      "في حالة التأجيل يتحمل الشاهد المتخلف جميع المصاريف الجديدة ما لم يبرر تخلفه بعذر مقبول، ويجبر على الأداء مع تحديد مدة الإكراه البدني بناء على ملتمس النيابة العامة.",
                      "تحكم المحكمة بالغرامة المنصوص عليها في المادة 128 أعلاه على الشاهد الذي يتخلف أو يرفض أداء اليمين أو الإدلاء بتصريحه.",
                      "يمكن للشاهد المحكوم عليه من أجل عدم الحضور أن يتعرض على القرار داخل خمسة أيام من يوم تبليغه شخصياً أو في موطنه، وتبت المحكمة في هذا التعرض."
                    ]
                  },
                  {
                    "number": "340",
                    "paragraphs": [
                      "يأمر الرئيس، إما تلقائيا أو بطلب من النيابة العامة أو أحد الأطراف، كاتب الضبط بوضع محضر يسجل فيه ما قد يرد من زيادة أو تبديل أو اختلاف عند المقارنة بين شهادة الشاهد وتصريحاته السابقة.",
                      "يضاف هذا المحضر إلى محضر المناقشات."
                    ]
                  },
                  {
                    "number": "341",
                    "paragraphs": [
                      "يجب على كل شاهد أن يبقى في القاعة بعد أداء شهادته إلى أن تنتهي المناقشات، ما لم يقرر الرئيس خلاف ذلك."
                    ]
                  },
                  {
                    "number": "342",
                    "paragraphs": [
                      "يمكن للرئيس، إما تلقائيا أو بطلب من النيابة العامة أو الأطراف، أن يأمر بانسحاب الشهود الذين يعينهم، وأن يرجع إلى القاعة أحدهم أو البعض منهم.",
                      "يمكنه أن يستمع إليهم من جديد إما على حدة أو بحضور الآخرين، وله أن يجري مواجهة فيما بينهم أو أن يستغني عن ذلك."
                    ]
                  },
                  {
                    "number": "343",
                    "paragraphs": [
                      "يمكن للرئيس قبل الاستماع إلى الشاهد أو أثناء ذلك أو بعده، أن يأمر بإخراج أحد المتهمين أو البعض منهم أو الضحية ليستمع إليهم لاحقا على التوالي حول إحدى خصوصيات القضية.",
                      "لا يواصل بحث القضية إلا بعد أن يخبر كل متهم أو ضحية بما راج في غيبته."
                    ]
                  },
                  {
                    "number": "344",
                    "paragraphs": [
                      "يقوم الرئيس أثناء أداء الشهادات أو عقبها بعرض جميع أدوات الاقتناع على المتهم ويسأله عن مدى تعرفه عليها.",
                      "يعرضها كذلك، عند الاقتضاء، على الشهود أو الخبراء."
                    ]
                  },
                  {
                    "number": "345",
                    "paragraphs": [
                      "يؤدي الخبراء غير المحلفين اليمين التالية أمام المحكمة: «أقسم بالله العظيم على أن أقدم مساعدتي للعدالة وفق ما يقتضيه الشرف والضمير».",
                      "يستمع إلى الخبراء بالجلسة ويعرضون نتائج العمليات التقنية التي قاموا بها، ويمكنهم أثناء الاستماع إليهم الاطلاع على تقريرهم وملحقاته.",
                      "يمكن للرئيس، إما تلقائيا أو بطلب من النيابة العامة أو من الأطراف أو محاميهم، أن يطرح على الخبراء كل الأسئلة التي تدخل في نطاق المهمة المعهود بها إليهم، أو أن يأذن لهم بطرحها مباشرة.",
                      "يحضر الخبراء المناقشات بعد الاستماع إليهم، ما لم يعفهم الرئيس من ذلك وما لم تعترض النيابة العامة أو الأطراف."
                    ]
                  },
                  {
                    "number": "346",
                    "paragraphs": [
                      "إذا عارض شخص استمع إليه أثناء جلسة الحكم بصفته شاهدا أو على سبيل الاستئناس ما ورد بمستنتجات أحد الخبراء، أو تقدم ببيانات تقنية جديدة، فإن الرئيس يطلب من الخبير ومن النيابة العامة والأطراف، عند الاقتضاء، تقديم ملاحظاتهم.",
                      "تصرح المحكمة بقرار معلل إما بصرف النظر عن المنازعة ومواصلة المناقشات، وإما بتأجيل القضية إلى تاريخ لاحق.",
                      "في حالة التأجيل، يمكن للمحكمة أن تقرر كل تدبير تراه مفيدا بالنسبة لإجراء الخبرة."
                    ]
                  },
                  {
                    "number": "347",
                    "paragraphs": [
                      "يتحمل المتهمون مصاريف استدعاء الشهود المستمع إليهم بطلب منهم، ومبالغ التعويضات المؤداة لهؤلاء الشهود.",
                      "غير أنه يمكن للنيابة العامة أن تستدعي بطلب منها الشهود الذين يعينهم المتهم المعوز، إذا ارتأت أن تصريحاتهم مفيدة لإظهار الحقيقة."
                    ]
                  },
                  {
                    "number": "347-1",
                    "paragraphs": [
                      "إذا كانت هناك أسباب جدية تؤكدها دلائل على أن حضور الشاهد للإدلاء بشهادته أو مواجهته مع المتهم من شأنه أن يعرض حياته أو سلامته الجسدية أو مصالحه الأساسية، أو حياة أفراد أسرته أو أقاربه أو سلامتهم الجسدية أو مصالحهم الأساسية للخطر، جاز للمحكمة بناء على ملتمس النيابة العامة أن تأذن بتلقي شهادته بعد إخفاء هويته بشكل يحول دون التعرف عليه.",
                      "يمكنها كذلك الإذن باستعمال الوسائل التقنية لتغيير الصوت أو الاستماع إليه عن طريق تقنية الاتصال عن بعد."
                    ]
                  },
                  {
                    "number": "347-2",
                    "paragraphs": [
                      "تطبق أمام هيئة الحكم مقتضيات القسم الثاني المكرر من الكتاب الأول من هذا القانون المتعلقة بحماية الضحايا والشهود والخبراء والمبلغين."
                    ]
                  },
                  {
                    "number": "347-3",
                    "paragraphs": [
                      "يمكن الاستماع إلى ضابط الشرطة القضائية المسؤول عن عملية الاختراق بصفته شاهدا حول هذه العملية.",
                      "لا يمكن الاستماع إلى الضابط أو العون منفذ عملية الاختراق إلا في حالة موافقته، إذا كانت شهادته هي الوسيلة الوحيدة لإثبات الحقيقة، وتتقيد المحكمة في ذلك بمقتضيات المادتين 347-1 و347-2 أعلاه.",
                      "لا يمكن أن تتناول المناقشة أو الأسئلة المطروحة وقائع من شأنها الكشف، بشكل مباشر أو غير مباشر، عن الهوية الحقيقية للضابط أو العون منفذ عملية الاختراق."
                    ]
                  }
                ]
              },
              {
                "name": "الفرع السادس",
                "title": "المطالبة بالحق المدني وآثارها",
                "articles": [
                  {
                    "number": "348",
                    "paragraphs": [
                      "لكل شخص يدعي أنه تضرر من جريمة أن يتقدم بصفته طرفا مدنيا أمام هيئة الحكم، ما لم يكن قد سبق له أن انتصب طرفاً مدنياً أمام قاضي التحقيق وفق الشروط المنصوص عليها في المادة 92 وما بعدها إلى غاية المادة 96 أعلاه."
                    ]
                  },
                  {
                    "number": "349",
                    "paragraphs": [
                      "يجب أن يستدعى أمام هيئة الحكم الطرف المدني الذي سبق أن تقدم بطلبه إلى هيئة التحقيق.",
                      "ويشترط لصحة تقديم طلب التعويض أمام هيئة الحكم، أن يودع الطرف المدني لزوماً قبل الجلسة بكتابة الضبط أو أثناءها بين يدي الرئيس مذكرة مرفقة بصورة لوصل أداء الرسم القضائي الجزافي، وأن يحدد مطالبه الأساسية ومبلغ التعويض المطلوب."
                    ]
                  },
                  {
                    "number": "350",
                    "paragraphs": [
                      "يمكن للشخص المتضرر الذي لم يتدخل أمام هيئة التحقيق أن يتقدم بصفته طرفاً مدنياً أمام هيئة الحكم، إما حسب الشكل المنصوص عليه في المادة 349 أعلاه، وإما بتصريح شفهي يسجله كاتب الضبط بالجلسة، وينذر لأداء الرسم القضائي الجزافي.",
                      "إذا أقام الطرف المدني دعواه عن طريق إيداع مذكرة، تعين أن تتضمن هذه المذكرة اسمه العائلي والشخصي، ومهنته، وعنوانه، ورقم بطاقة هويته، ورقم هاتفه عند الاقتضاء، وكذا الاسم العائلي والشخصي للمتهم ومهنته وعنوانه عند الاقتضاء.",
                      "يجب أن تبين المذكرة الجريمة المترتب عنها الضرر ووقائعها، وتاريخ ومكان وقوعها، ومبلغ التعويض المطلوب، والأسباب المبررة للطلب، وأن تحتوي على تعيين موطن مختار في المكان الذي يوجد فيه مقر المحكمة، ما لم يكن الطالب مقيماً بدائرة نفوذها.",
                      "في حالة عدم تعيين الموطن المختار، لا يمكن للطرف المدني أن يحتج بعدم تبليغه الإجراءات التي كان يتعين تبليغها له وفق نصوص القانون.",
                      "لا يمكن للمتضرر تحريك الدعوى العمومية مباشرة أمام غرفة الجنايات."
                    ]
                  },
                  {
                    "number": "351",
                    "paragraphs": [
                      "إذا أقيمت الدعوى العمومية ضد موظف عمومي أو عون تابع للسلطة أو القوة العمومية، وتبين احتمال قيام مسؤولية الدولة عن أعمال تابعها، يتعين على المحكمة إشعار الوكيل القضائي للمملكة وفق الشكل المنصوص عليه في قانون المسطرة المدنية أو بأي وسيلة اتصال تترك أثراً كتابياً.",
                      "يتعين على رئيس الهيئة المحالة عليها أفعال ارتكبت في حق قاصر من طرف ممثله القانوني أن يعين له وكيلاً خصوصياً لتقديم المطالب المدنية لفائدته.",
                      "إذا كانت الدعوى المدنية قد أقيمت ضد موظف بالجماعات الترابية أو عضو من أعضاء مجالسها أو هيئاتها، وتبين احتمال قيام مسؤولية الجماعة الترابية عن أعمال تابعها، يتعين إشعار الوكيل القضائي للجماعات الترابية وفق الشكل المنصوص عليه في الفقرة الأولى أعلاه."
                    ]
                  },
                  {
                    "number": "352",
                    "paragraphs": [
                      "لا يجوز للأشخاص الذين ليست لهم أهلية ممارسة حقوقهم المدنية أن يقيموا الدعوى المدنية إلا بإذن من ممثلهم القانوني أو بمساعدته."
                    ]
                  },
                  {
                    "number": "353",
                    "paragraphs": [
                      "إذا كان الشخص الذي يدعي الضرر غير مؤهل لتقديم الطلب بنفسه بسبب مرض عقلي أو بسبب قصوره، ولم يكن له ممثل قانوني، فللمحكمة أن تعين له لهذا الغرض وكيلاً خصوصياً بناء على ملتمس من النيابة العامة.",
                      "يمكن لرئيس الهيئة المحالة عليها أفعال ارتكبت في حق قاصر من طرف ممثله القانوني أن يعين له وكيلاً خصوصياً لتقديم المطالب المدنية لفائدته."
                    ]
                  },
                  {
                    "number": "354",
                    "paragraphs": [
                      "يمكن إقامة الدعوى المدنية في سائر مراحل المسطرة إلى غاية اختتام المناقشات.",
                      "غير أن الشخص الذي استمع إليه بالجلسة بصفته شاهداً بعد أدائه اليمين، لا يمكنه بعد ذلك أن يتقدم بصفته طرفاً مدنياً."
                    ]
                  },
                  {
                    "number": "355",
                    "paragraphs": [
                      "إذا تنازل الطرف المدني قبل صدور الحكم، فإنه يلزم بالصوائر المؤداة بعد تنازله."
                    ]
                  },
                  {
                    "number": "356",
                    "paragraphs": [
                      "لا يحول تنازل الطرف المدني عن طلبه دون إقامته الدعوى المدنية بعد ذلك أمام المحكمة المدنية المختصة."
                    ]
                  }
                ]
              },
              {
                "name": "الفرع السابع",
                "title": "إثارة الضوضاء في الجلسة والإخلال بنظامها",
                "articles": [
                  {
                    "number": "357",
                    "paragraphs": [
                      "إذا عبر شخص أو عدة أشخاص من الحاضرين علانية عن مشاعرهم، أو أحدثوا اضطرابا أو حرضوا على الضوضاء بوسيلة ما بقاعة الجلسة أو بأي محل آخر يباشر فيه علنيا تحقيق قضائي، أمر رئيس الهيئة بطردهم، وذلك بقطع النظر عن المتابعات التي يتعرضون إليها عملا بمقتضيات المواد 359 إلى 361 من هذا القانون.",
                      "ينص في المحضر على الحادث وعلى أمر الرئيس.",
                      "لرئيس الهيئة أن يحيل فورا مرتكب الفعل بواسطة القوة العمومية وكذا المستندات إلى النيابة العامة المختصة."
                    ]
                  },
                  {
                    "number": "358",
                    "paragraphs": [
                      "إذا كان المتهم هو نفسه الذي أحدث الاضطراب، أمر رئيس المحكمة بطرده من الجلسة، وتتابع المناقشات في غيبته. وفي جميع الأحوال، يمكن لرئيس الجلسة أن يأمر بإرجاع المتهم المطرود من جديد إلى الجلسة.",
                      "إذا كان المتهم معتقلا نقل إلى المؤسسة السجنية، ويتعين على كاتب الضبط، عند الاقتضاء، أن ينتقل عقب الجلسة إلى هذه المؤسسة ويتلو عليه محضر المناقشات وملتمسات النيابة العامة وكذا الأحكام أو القرارات التمهيدية الصادرة منذ طرده.",
                      "ينقل المتهم من جديد إلى الجلسة عند انتهاء المناقشات، حيث يصدر الحكم أو القرار بحضوره.",
                      "إذا كان المتهم غير معتقل، فيحتفظ به تحت حراسة القوة العمومية رهن إشارة المحكمة إلى غاية انتهاء المناقشات، ثم ينقل بعدئذ إلى الجلسة حيث يصدر الحكم أو القرار بحضوره.",
                      "تكون الأحكام أو القرارات الصادرة ضمن الشروط المقررة في هذه المادة حضورية."
                    ]
                  },
                  {
                    "number": "359",
                    "paragraphs": [
                      "إذا ارتكبت أثناء الجلسة جريمة لها وصف مخالفة، يأمر رئيس المحكمة بتحرير محضر في شأنها ويستجوب مرتكبها ويستمع للشهود.",
                      "تطبق الهيئة القضائية حالا العقوبات المقررة في القانون بناء على ملتمسات النيابة العامة.",
                      "لا يمكن الطعن في هذا الحكم بأية وسيلة من وسائل الطعن."
                    ]
                  },
                  {
                    "number": "360",
                    "paragraphs": [
                      "إذا كان للجريمة المرتكبة وصف جنحة، تطبق عليها نفس الإجراءات المقررة في المادة 361 الآتية بعدها."
                    ]
                  },
                  {
                    "number": "361",
                    "paragraphs": [
                      "إذا كان للجريمة المرتكبة وصف جناية، أمرت الهيئة القضائية بتحرير محضر بالوقائع، وأحالت فورا مرتكب الفعل بواسطة القوة العمومية والمستندات إلى النيابة العامة المختصة."
                    ]
                  }
                ]
              }
            ]
          },
          {
            "name": "الباب الثاني",
            "title": "الأحكام والقرارات والأوامر وآثارها",
            "articles": [
              {
                "number": "362",
                "paragraphs": [
                  "إذا كانت القضية غير جاهزة للحكم، أمرت المحكمة بتأجيلها لمتابعة دراستها بجلسة أخرى يحدد تاريخها، ولا يجوز تأجيل النظر في القضية دون مبرر جدي مقبول.",
                  "يمكن للمحكمة أن تأمر بإجراء تحقيق تكميلي، وفي هذه الحالة تعين أحد أعضائها للقيام بالتحقيق وفقاً لمقتضيات القسم الثالث من الكتاب الأول من هذا القانون.",
                  "يبت في شأن الإفراج المؤقت وفي شأن الوضع تحت المراقبة القضائية ضمن الشروط المنصوص عليها في المادة 178 أعلاه."
                ]
              },
              {
                "number": "363",
                "paragraphs": [
                  "تصدر مقررات الهيئات الجماعية بأغلبية أعضاء الهيئة.",
                  "إذا تعذر إصدار الحكم في الحال، يتعين جعل القضية في المداولة لمدة لا تتجاوز خمسة عشر يوما، وفي هذه الحالة يحدد الرئيس تاريخ النطق بالحكم ويعلم به الأطراف ويصدر حكمه في الموعد المحدد."
                ]
              },
              {
                "number": "364",
                "paragraphs": [
                  "تكون الأحكام والقرارات والأوامر الصادرة عن هيئات الحكم محررة ومعللة بأسباب.",
                  "يجب أن تكون الأحكام محررة قبل النطق بها، وفي حالة تعذر ذلك فإن الحكم يجب أن يكون محررا داخل أجل لا يزيد عن ثمانية أيام من تاريخ النطق به.",
                  "يتلى منطوق كل حكم أو قرار أو أمر في جلسة علنية، ما لم تنص على خلاف ذلك مقتضيات خاصة.",
                  "يقصد بمصطلح مقرر في مفهوم هذا القانون كل حكم أو قرار أو أمر صادر عن هيئة قضائية.",
                  "يمنع حضور النيابة العامة أثناء مداولات المحكمة."
                ]
              },
              {
                "number": "365",
                "paragraphs": [
                  "يجب أن يستهل كل حكم أو قرار أو أمر بالصيغة الآتية: المملكة المغربية - باسم جلالة الملك وطبقا للقانون.",
                  "يجب أن يحتوي الحكم أو القرار أو الأمر على البيانات المنصوص عليها قانونا، والمتعلقة بالهيئة القضائية، وتاريخ الصدور، وأطراف الدعوى، ووقائع المتابعة، وحضور الأطراف، والأسباب الواقعية والقانونية، ومنطوق المقرر، والمصاريف، وأسماء القضاة وممثل النيابة العامة وكاتب الضبط وتوقيعاتهم.",
                  "يمكن أن تذيل الأحكام والقرارات والأوامر بالتوقيع الإلكتروني أو الرقمي لكل من رئيس الهيئة وكاتب الضبط."
                ]
              },
              {
                "number": "366",
                "paragraphs": [
                  "يبين في منطوق كل حكم أو قرار أو أمر ما إذا صدر في جلسة علنية، وهل هو ابتدائي أم نهائي، حضوري أم بمثابة حضوري أم غيابي.",
                  "في حالة الحكم في جوهر الدعوى، يقضي منطوق الحكم بالإدانة أو الإعفاء أو البراءة أو سقوط الدعوى العمومية، ويبت فيما يرجع لتحمل المصاريف.",
                  "تبت المحكمة عند الاقتضاء في رد الأشياء والأموال والممتلكات الموضوعة تحت يد العدالة، وفي إجراء عقل العقار إذا تعلق الأمر بجرائم تمس بحق الملكية العقارية.",
                  "إذا صدر الحكم بالإدانة، ينص فيه على الجريمة والمواد القانونية المطبقة والعقوبة والعقوبات الإضافية والتدابير الوقائية والحقوق المدنية."
                ]
              },
              {
                "number": "367",
                "paragraphs": [
                  "كل حكم أو قرار أو أمر صدر بإدانة المتهم أو بالحكم على المسؤول عن الحقوق المدنية، يجب أن يقضي عليهما بأداء المصاريف للخزينة العامة.",
                  "يمكن أن يقضي الحكم الصادر بإعفاء المتهم بتحميله المصاريف كليا أو جزئيا أو تحميلها للمسؤول عن الحقوق المدنية.",
                  "لا يمكن أن يقضي الحكم الصادر ببراءة المتهم بتحميله المصاريف إلا في الحالات المنصوص عليها في قانون خاص.",
                  "يتحمل مصاريف الدعوى الطرف المدني الذي خسرها، مع إمكانية إعفائه إذا كان حسن النية.",
                  "تبت المحكمة في الإكراه البدني عند الاقتضاء."
                ]
              },
              {
                "number": "368",
                "paragraphs": [
                  "إذا لم يفصل المقرر بالإدانة في جميع الجرائم موضوع المتابعة أو وقع تغيير في وصفها، تعفي هيئة الحكم المتهم من جزء المصاريف غير المرتبطة مباشرة بالجريمة المحكوم بها.",
                  "تحدد الهيئة مبلغ المصاريف المعفى منها، وتتحملها الخزينة العامة أو الطرف المدني حسب الأحوال."
                ]
              },
              {
                "number": "369",
                "paragraphs": [
                  "يطلق فوراً سراح المتهم المحكوم ببراءته أو بإعفائه أو بعقوبة حبسية موقوفة التنفيذ، ما لم يكن معتقلا لسبب آخر، وترفع عنه تدابير المراقبة القضائية رغم كل طعن.",
                  "كل متهم حكم ببراءته أو بإعفائه لا يمكن أن يتابع من أجل نفس الوقائع ولو بوصف قانوني آخر."
                ]
              },
              {
                "number": "370",
                "paragraphs": [
                  "تبطل الأحكام أو القرارات أو الأوامر إذا تخلفت الصيغة القانونية، أو لم تكن الهيئة مشكلة قانونا، أو لم تكن معللة، أو أغفل منطوقها البيانات الإلزامية، أو لم تصدر في جلسة علنية، أو لم تحمل التاريخ والتوقيعات القانونية."
                ]
              },
              {
                "number": "371",
                "paragraphs": [
                  "يوقع الرئيس وكاتب الضبط أصل المقرر القضائي داخل أجل أقصاه ثمانية أيام من تاريخ صدوره.",
                  "في حالة تعذر التوقيع، تطبق الإجراءات التعويضية المنصوص عليها قانونا حسب نوع الهيئة القضائية.",
                  "يعاقب كاتب الضبط الذي يسلم نسخة من مقرر قبل توقيع أصله بالغرامة المنصوص عليها قانونا ولا يعتد بتلك النسخة."
                ]
              },
              {
                "number": "372",
                "paragraphs": [
                  "في الجنح المنصوص عليها في المادة 1-41، يمكن للمحكمة وقف سير الدعوى العمومية في حالة تنازل المتضرر عن شكايته قبل صدور حكم نهائي.",
                  "يمكن للمحكمة تعيين وسيط لإجراء الصلح، وتأمر بالإفراج عن المتهم المعتقل وبوضع حد للمراقبة القضائية.",
                  "يمكن مواصلة النظر في الدعوى العمومية بطلب من النيابة العامة إذا ظهرت عناصر جديدة، ما لم تكن الدعوى قد سقطت."
                ]
              }
            ]
          }
        ]
      },
      {
        "name": "القسم الرابع",
        "title": "القواعد الخاصة بمختلف درجات المحاكم",
        "chapters": [
          {
            "name": "الباب الأول",
            "title": "المحاكم المختصة في قضايا الجنح والمخالفات",
            "articles": [
              {
                "number": "373",
                "paragraphs": [
                  "تختص المحكمة الابتدائية بالنظر في المخالفات والجنح طبقا للمادة 252 والمواد 255 إلى 260 من هذا القانون، وذلك مع مراعاة مقتضيات المادة 251."
                ]
              },
              {
                "number": "374",
                "paragraphs": [
                  "تعقد المحكمة جلساتها بقاض منفرد بحضور ممثل النيابة العامة وكاتب الضبط، غير أنه إذا تعلق الأمر بقضايا تقرر فيها متابعة شخص في حالة اعتقال ولو توبع معه أشخاص في حالة سراح، تعقد المحكمة جلساتها وهي مكونة من رئيس وقاضيين بحضور ممثل النيابة العامة وكاتب الضبط.",
                  "تبقى الهيئة الجماعية مختصة بالبت في القضية في حالة منح المحكمة السراح المؤقت للشخص المتابع.",
                  "يترتب البطلان عن الإخلال بهذه المقتضيات. وفي جميع الأحوال لا يترتب البطلان عن بت هيئة القضاء الجماعي في قضية من اختصاص قاض منفرد."
                ]
              }
            ],
            "sections": [
              {
                "name": "الفرع الأول",
                "title": "السند التنفيذي والأمر القضائي في المخالفات",
                "articles": [
                  {
                    "number": "375",
                    "paragraphs": [
                      "يجوز للنيابة العامة، في سائر الأحوال التي ترتكب فيها مخالفة يعاقب عليها القانون بغرامة مالية فقط ويكون ارتكابها مثبتا في محضر أو تقرير ولا يظهر فيها متضرر أو ضحية، أن تقترح على المخالف بمقتضى سند قابل للتنفيذ أداء غرامة جزافية تبلغ نصف الحد الأقصى للغرامة المنصوص عليها قانونا."
                    ]
                  },
                  {
                    "number": "376",
                    "paragraphs": [
                      "يجب أن يحمل السند القابل للتنفيذ الصادر عن النيابة العامة في المخالفات تاريخ صدوره وإمضاء قاضي النيابة العامة وأن يتضمن:",
                      "الاسم الشخصي والاسم العائلي والمهنة ومحل السكنى وإن أمكن رقم بطاقة الهوية ونوعها لمرتكب المخالفة وللمسؤول عن الحقوق المدنية إن اقتضى الحال؛",
                      "بيان المخالفة ومحل وتاريخ ارتكابها ووسائل إثباتها؛",
                      "النصوص المطبقة في القضية؛",
                      "بيان مبلغ الغرامة مع الإشارة إلى أدائها بصندوق كتابة الضبط بأية محكمة ابتدائية."
                    ]
                  },
                  {
                    "number": "377",
                    "paragraphs": [
                      "يبلغ السند القابل للتنفيذ الصادر عن النيابة العامة في المخالفة إلى مرتكبها، وعند الاقتضاء، إلى المسؤول عن الحقوق المدنية برسالة مضمونة مع الإشعار بالاستلام أو بأية وسيلة أخرى من وسائل التبليغ المنصوص عليها في الفقرة الثانية من المادة 325 أعلاه.",
                      "تتضمن رسالة التبليغ إشعار المعني بالأمر بأن يؤدي مبلغ الغرامة، وإلا فإن القضية ستحال على جلسة يحدد تاريخها في السند القابل للتنفيذ ويعتبر الإشعار بمثابة استدعاء لهذه الجلسة.",
                      "يمكن لمرتكب المخالفة، وعند الاقتضاء، للمسؤول عن الحقوق المدنية، أن يعبرا عن عدم رغبتهما في الأداء داخل أجل عشرة أيام من التوصل، وذلك بمجرد تصريح يضمن في نفس الرسالة التي يعاد إرسالها في هذه الحالة إلى وكيل الملك بواسطة البريد المضمون مع إشعار بالاستلام."
                    ]
                  },
                  {
                    "number": "378",
                    "paragraphs": [
                      "يبتدئ الأجل المذكور المحدد في عشرة أيام من يوم التبليغ أو من يوم رفض التوصل به."
                    ]
                  },
                  {
                    "number": "379",
                    "paragraphs": [
                      "يمكن للمعني بالأمر بمجرد علمه أو تبليغه بالسند القابل للتنفيذ أن يسدد ما بذمته بعد الإدلاء به بصندوق كتابة الضبط بأية محكمة ابتدائية.",
                      "تقوم هذه الأخيرة بإشعار النيابة العامة مصدرة السند القابل للتنفيذ داخل أجل أسبوع من تاريخ الأداء."
                    ]
                  },
                  {
                    "number": "380",
                    "paragraphs": [
                      "في حالة عدم التعبير عن الرغبة في الأداء داخل الأجل المحدد في المادة 378 أعلاه، يصبح السند القابل للتنفيذ نهائياً.",
                      "يسلم كاتب الضبط ملخصاً منه للجهة المكلفة بتنفيذ الغرامات."
                    ]
                  },
                  {
                    "number": "381",
                    "paragraphs": [
                      "في حالة التعبير عن رفض السند التنفيذي وفقا للمادتين 377 و378 أعلاه، يحيل وكيل الملك القضية على المحكمة التي تبت فيها وفق القواعد العامة.",
                      "إذا قررت المحكمة الإدانة، فلا يمكن أن تقل الغرامة المحكوم بها عن ثلثي الحد الأقصى للغرامة المقرر قانوناً للمخالفة."
                    ]
                  },
                  {
                    "number": "382",
                    "paragraphs": [
                      "يكون الأمر القضائي الصادر في الحالة المذكورة في المادة السابقة غير قابل للتعرض ولا للاستئناف.",
                      "لا يمكن الطعن فيه بالنقض إلا وفق الشروط المنصوص عليها في المادة 415.",
                      "يعتبر الأمر الصادر وفقاً للمادة السابقة بعد أن يصبح مكتسباً لقوة الشيء المقضي به بمثابة حكم بالعقوبة ويدخل في تحديد العود إلى الجريمة."
                    ]
                  }
                ]
              },
              {
                "name": "الفرع الثاني",
                "title": "الأمر القضائي في الجنح",
                "articles": [
                  {
                    "number": "383",
                    "paragraphs": [
                      "يمكن للقاضي في الجنح التي يعاقب عليها القانون بغرامة فقط ويكون ارتكابها مثبتا في محضر أو تقرير ولا يظهر فيها متضرر أو ضحية، أن يصدر استنادا على ملتمس كتابي من النيابة العامة أمرا يتضمن المعاقبة بغرامة لا تتجاوز نصف الحد الأقصى المقرر قانونا، وذلك بصرف النظر عن العقوبات الإضافية والمصاريف ورد ما يلزم رده.",
                      "يكون هذا الأمر قابلا للتعرض أمام نفس المحكمة داخل أجل عشرة أيام من تبليغه وفقا لمقتضيات المادة 308 أعلاه.",
                      "في حالة تعرض المتهم، يصبح الأمر الصادر غيابيا كأن لم يكن وتبت المحكمة وفق القواعد العامة.",
                      "لا يكون التعرض مقبولا إلا بعد إيداع مبلغ مالي يساوي الحد الأقصى للغرامة المنصوص عليها في القانون.",
                      "غير أنه في حالة الإدانة يجب ألا تقل الغرامة المحكوم بها عن ثلاثة أرباع الحد الأقصى للغرامة المقررة قانونا للجنحة.",
                      "يتم استخلاص مبلغ الغرامة ومصاريف الدعوى من مبلغ الوديعة المشار إليها في الفقرة الرابعة أعلاه، ويجري التنفيذ على أموال المحكوم عليه بالنسبة للجزء المتبقي وذلك بمجرد ما يصبح الحكم قابلا للتنفيذ."
                    ]
                  }
                ]
              },
              {
                "name": "الفرع الثاني مكرر",
                "title": "السند الإداري التصالحي في المخالفات والجنح",
                "articles": [
                  {
                    "number": "1-383",
                    "paragraphs": [
                      "إذا تعلق الأمر بمخالفات أو جنح يعاقب عليها القانون بغرامة مالية فقط، ويكون ارتكابها مثبتا في محضر ولا يظهر فيها متضرر أو ضحية من الأغيار، فإنه يجوز لإدارة التابع لها محرر المحضر أن تصدر سندا إداريا تصالحيا تقترح فيه على المخالف أداء غرامة لا تتجاوز نصف الحد الأقصى للغرامة المقررة قانونا للجريمة.",
                      "يمكن للعون محرر المحضر بناء على إذن من إدارته أن يقترح السند الإداري التصالحي على المخالف، ويضمن هذا الإشعار في المحضر، كما يمكنه أن يسلم السند فورا للمخالف بمجرد ختم المحضر والتوقيع عليه.",
                      "يجب أن يتضمن السند التنفيذي الصادر عن الإدارة البيانات المنصوص عليها في البنود 1 و2 و3 من المادة 376 أعلاه ومبلغ الغرامة المقترح، مع الإشارة إلى حق المخالف في الرفض وإلى إمكانية المنازعة وإلى العقوبة المقررة وفقا للمادة 3-383 أدناه.",
                      "يبلغ السند إلى المخالف مباشرة من قبل العون محرر المحضر أو بإحدى وسائل التبليغ المنصوص عليها في المادة 377 أعلاه.",
                      "يتعين على المخالف أن يؤدي مبلغ الغرامة التصالحية داخل أجل شهر من تاريخ تبليغه.",
                      "يتم استخلاص مبلغ الغرامة التصالحية المقررة في السند التنفيذي من قبل كتاب الضبط بالمحاكم أو محصلي الخزينة العامة للمملكة أو باقي الجهات المكلفة بالتحصيل.",
                      "يدلي المخالف بنسخة من السند الإداري التصالحي إلى الجهة المكلفة بالاستخلاص، وتقوم هذه الأخيرة بإشعار الإدارة مصدرة السند بوقوع الأداء.",
                      "ينتج عن أداء قيمة الغرامة التصالحية وضع حد لأي متابعة، وتتولى الإدارة حفظ محضر المخالفة.",
                      "وفي حالة عدم أداء الغرامة التصالحية بعد مرور شهر من تاريخ التبليغ، تحيل الإدارة مصدرة السند إلى وكيل الملك المحضر الأصلي وما يفيد تبليغه إلى المخالف.",
                      "تؤدي مباشرة إجراءات السند التنفيذي الإداري إلى إيقاف سريان مدة تقادم الدعوى العمومية."
                    ]
                  },
                  {
                    "number": "1-384",
                    "paragraphs": [
                      "يمكن عند الاقتضاء لوكيل الملك أو من ينوب عنه الانتقال إلى مقر الشرطة القضائية ومعاينة المشتبه فيه والاطلاع على المحضر المنجز واتخاذ الإجراء القانوني المناسب بشأنه مع تسليم الاستدعاء إلى المتهم والضحية والشهود عند الاقتضاء للحضور إلى الجلسة التي يتم تعيينها.",
                      "كما يمكن تطبيق مقتضيات الفقرة الأولى أعلاه بواسطة تقنيات الاتصال عن بعد أو بأي وسيلة إلكترونية أخرى، وفي هذه الحالة يكلف وكيل الملك ضابط الشرطة القضائية بتسليم الاستدعاء للمتهم وللضحية والشهود عند الاقتضاء.",
                      "يحرر الاستدعاء ويسلم وفقا لمقتضيات المادة 308 من هذا القانون مع مراعاة الأجل المنصوص عليه في الفقرة الأولى من المادة 309 أعلاه.",
                      "تراعى في جميع الأحوال الحقوق المخولة للدفاع."
                    ]
                  },
                  {
                    "number": "385",
                    "paragraphs": [
                      "يقدم المتهم إلى الجلسة في الحالة المنصوص عليها في المادة 74 من هذا القانون بدون سابق استدعاء، وفي كل الأحوال داخل أجل ثلاثة أيام، وتشعره المحكمة بأن له الحق في طلب أجل قصد تهيئ دفاعه واختيار محام.",
                      "ينص في الحكم على هذا الإشعار وعلى جواب المتهم.",
                      "إذا استعمل المتهم الحق المخول له كما ذكر، منحته المحكمة لهذا الغرض أجلا لا يقل عن ثلاثة أيام، وتبت في طلب الإفراج المؤقت أو رفع المراقبة القضائية في حالة تقديمه.",
                      "يترتب البطلان عن مخالفة المقتضيات السابقة.",
                      "يمكن استدعاء الشهود شفهيا بواسطة أي ضابط من ضباط الشرطة القضائية أو عون من أعوان القوة العمومية أو بواسطة عون قضائي أو أحد أعوان المحكمة، ويتعين على الشهود الحضور وإلا طبقت في حقهم مقتضيات المادة 128 أعلاه."
                    ]
                  },
                  {
                    "number": "386",
                    "paragraphs": [
                      "يجري البحث في كل قضية حسب الكيفيات المنصوص عليها في المواد 287 أعلاه وما بعدها."
                    ]
                  },
                  {
                    "number": "387",
                    "paragraphs": [
                      "إذا تم التصريح بإدانة المتهم بارتكابه جنحة أو مخالفة، فإن المحكمة تحكم عليه بالعقوبة، وعند الاقتضاء، بالعقوبات الإضافية والتدابير الوقائية.",
                      "تبت المحكمة عند الاقتضاء في المطالب المتعلقة برد ما يجب رده وبالتعويض عن الضرر، مع مراعاة مقتضيات المادة 366 أعلاه."
                    ]
                  },
                  {
                    "number": "388",
                    "paragraphs": [
                      "يحرر كاتب الضبط عند انصرام أجل الاستئناف ملخصا للحكم الصادر بعقوبة سالبة للحرية يوجه للنيابة العامة التي تسهر على تنفيذه."
                    ]
                  },
                  {
                    "number": "389",
                    "paragraphs": [
                      "إذا تبين أن المتهم لم يرتكب الفعل أو أن الفعل لا يكون مخالفة للتشريع الجنائي، فإن المحكمة تصدر حكما بالبراءة، وتصرح بعدم اختصاصها للبت في الدعوى المدنية، وتبت عند الاقتضاء في رد ما يمكن رده.",
                      "تطبق مقتضيات المادة 98 من هذا القانون إذا أقام الطرف المدني الدعوى العمومية مباشرة أمام هيئة الحكم.",
                      "إذا تبين للمحكمة أن المتهم كان وقت ارتكابه الأفعال مصابا بخلل في قواه العقلية أو أن الخلل حصل له أثناء المحاكمة، فإنها تطبق حسب الأحوال مقتضيات الفصول 76 و78 و79 من القانون الجنائي.",
                      "إذا كان المتهم يستفيد من عذر يعفي من العقوبة، فإن المحكمة تقرر إعفاءه، لكنها تبقى مختصة للبت في الدعوى المدنية.",
                      "عندما تصرح المحكمة بسقوط الدعوى العمومية بناء على أحد أسباب السقوط المنصوص عليها في المادة الرابعة من هذا القانون، فإنها تبقى مختصة طبقا للمادة 12 للبت في الدعوى المدنية، مع مراعاة مقتضيات المادة 14 من هذا القانون."
                    ]
                  },
                  {
                    "number": "390",
                    "paragraphs": [
                      "إذا لم يكن للفعل وصف جنحة أو مخالفة تدخل ضمن اختصاص المحكمة، فإنها تصرح بعدم اختصاصها وتحيل الطرف الذي أقام الدعوى العمومية على من له حق النظر.",
                      "يسري نفس الحكم إذا تعلق الأمر بجناية، وفي هذه الحالة تصدر المحكمة عند الاقتضاء أمرا بالإيداع في السجن أو بإلقاء القبض إذا كان المتهم غير معتقل.",
                      "يستمر اعتقال المتهم الموجود في حالة اعتقال، كما تستمر تدابير المراقبة القضائية والإجراءات التحفظية الصادرة من قبل بما فيها الأمر الصادر بعقل العقار إذا تعلق الأمر بجريمة تمس بحق الملكية العقارية.",
                      "تحيل النيابة العامة القضية على الجهة المختصة عند الاقتضاء."
                    ]
                  },
                  {
                    "number": "391",
                    "paragraphs": [
                      "يبلغ منطوق الحكم الصادر غيابيا إلى علم الطرف المتغيب طبقا للكيفيات المنصوص عليها في قانون المسطرة المدنية، وينص في التبليغ على أن أجل التعرض هو عشرة أيام."
                    ]
                  },
                  {
                    "number": "392",
                    "paragraphs": [
                      "يمكن للمحكمة بناء على ملتمس من النيابة العامة إذا كانت العقوبة المحكوم بها تعادل سنة حبسا أو تفوقها، أن تصدر مقررا قضائيا خاصا معللا تأمر فيه بإيداع المتهم في السجن أو بإلقاء القبض عليه.",
                      "يبقى المقرر القضائي المذكور نافذ المفعول رغم كل طعن خلافا لمقتضيات المادتين 398 و532 من هذا القانون.",
                      "تسهر النيابة العامة على تنفيذ المقرر المذكور، وعند الاقتضاء إصدار أوامر دولية بالبحث وإلقاء القبض إذا تبين أن المتهم يوجد خارج التراب الوطني.",
                      "في حالة صدور حكم تمهيدي بإجراء بحث أو خبرة، يمكن للمحكمة التي قبلت مبدأ المسؤولية أن تمنح الطرف المدني تعويضا مسبقا يخصم من التعويض النهائي ويكون قابلا للتنفيذ رغم كل تعرض أو استئناف.",
                      "عندما تبت المحكمة في الجوهر وتحدد مبلغ التعويض الكلي، يمكنها أن تأمر بالتنفيذ المعجل لجزء من التعويضات يتناسب مع الحاجيات الفورية للطرف المدني بشرط تعليل ذلك تعليلا خاصا.",
                      "يمكن طلب إيقاف تنفيذ مقتضيات التعويض أمام غرفة الجنح الاستئنافية التي تبت في غرفة المشورة."
                    ]
                  }
                ]
              },
              {
                "name": "الفرع الرابع",
                "title": "التعرض",
                "articles": [
                  {
                    "number": "393",
                    "paragraphs": [
                      "يجوز التعرض على الحكم الغيابي بتصريح يقدمه المحكوم عليه أو دفاعه لكتابة الضبط في ظرف العشرة أيام التي تلي التبليغ.",
                      "لا يقبل تعرض المحكوم عليه بعقوبة قبل تبليغه الحكم الصادر في حقه طبقا لما هو منصوص عليه في المادة 391 أعلاه، ويتعين الإدلاء بما يفيد التبليغ عند التصريح بالتعرض ما لم يتنازل عن حقه في التبليغ ويسلم في الحين استدعاء جديد وفقا للفقرة الثالثة من المادة 394 الآتية بعده.",
                      "إذا رفض كاتب الضبط تلقي التصريح، يمكن رفع النزاع إلى رئيس المحكمة وتسري في هذه الحالة مقتضيات الفقرات 2 و3 و4 من المادة 401 بعده.",
                      "غير أنه فيما يتعلق بالدعوى العمومية، إذا لم يتم التبليغ إلى المتهم شخصيا ولم يتبين من أية وثيقة من وثائق التنفيذ أن هذا الأخير علم بالحكم الزجري الصادر في حقه، فإن تعرضه على هذا الحكم يبقى مقبولا إلى غاية انتهاء آجال تقادم العقوبة.",
                      "تبت في التعرض المحكمة التي أصدرت الحكم الغيابي.",
                      "إذا لم يمارس المتهم حقه في التعرض وكان الحكم الغيابي قابلا للاستئناف، فإنه يحق له الاستئناف داخل أجل عشرين يوما تبتدئ من تاريخ التبليغ، ويحتفظ في هذه الحالة بأحقيته في ممارسة حقوقه المنصوص عليها في المادة 323 من هذا القانون، ويعتبر استئنافه بمثابة تنازل عن حقه في التعرض."
                    ]
                  },
                  {
                    "number": "394",
                    "paragraphs": [
                      "يترتب عن التعرض المقدم من طرف المتهم بطلان الحكم الصادر عليه غيابيا في مقتضياته الصادرة بالإدانة.",
                      "لا يصح التعرض المقدم من الطرف المدني أو من الشخص المسؤول عن الحقوق المدنية إلا فيما يتعلق بحقوقهما المدنية.",
                      "في حالة التعرض يسلم استدعاء جديد للطرف المتعرض في الحين، ويستدعى باقي الأطراف لحضور الجلسة.",
                      "يلغى التعرض إن لم يحضر المتعرض في التاريخ المحدد في هذا الاستدعاء الجديد.",
                      "لا يقبل التعرض على الحكم الصادر بناء على تعرض سابق."
                    ]
                  },
                  {
                    "number": "395",
                    "paragraphs": [
                      "يمكن أن يحكم في سائر الأحوال على الطرف المتعرض بتحمله مصاريف تبليغ الحكم الغيابي والتعرض."
                    ]
                  }
                ]
              },
              {
                "name": "الفرع الخامس",
                "title": "الاستئناف",
                "articles": [
                  {
                    "number": "396",
                    "paragraphs": [
                      "لا يمكن الطعن بالاستئناف في الأحكام الصادرة في المخالفات، ما لم ينص القانون على خلاف ذلك، غير أنه يمكن الطعن فيها بالنقض طبقا للشروط المنصوص عليها في المادة 415 أدناه."
                    ]
                  },
                  {
                    "number": "397",
                    "paragraphs": [
                      "يمكن الطعن بالاستئناف في الأحكام الصادرة في الجنح كيفما كان منطوقها من المتهم والمسؤول عن الحقوق المدنية والطرف المدني ووكيل الملك والوكيل العام للملك لدى محكمة الاستئناف، أو إحدى الإدارات عندما يسمح لها القانون بصفة خاصة بإقامة الدعوى العمومية.",
                      "تراعى مقتضيات المادتين 409 و410 بعده."
                    ]
                  },
                  {
                    "number": "398",
                    "paragraphs": [
                      "يوقف تنفيذ الحكم أثناء سريان آجال الاستئناف وأثناء جريان المسطرة في مرحلة الاستئناف، وتراعى مقتضيات المادة 382 أعلاه.",
                      "لا يحول أجل الاستئناف المخول للوكيل العام للملك لدى محكمة الاستئناف طبقا للمادة 402 بعده دون تنفيذ العقوبة."
                    ]
                  },
                  {
                    "number": "399",
                    "paragraphs": [
                      "يعرض الاستئناف على نظر غرفة الجنح الاستئنافية التي تتكون تحت طائلة البطلان من رئيس ومن مستشارين اثنين بحضور ممثل النيابة العامة وبمساعدة كاتب الضبط.",
                      "يقدم الاستئناف بتصريح إلى كتابة الضبط بالمحكمة التي أصدرت الحكم أو إلى كتابة الضبط بمحكمة الاستئناف.",
                      "إذا كان المحكوم عليه معتقلا، فإن التصريح بالاستئناف المقدم لكتابة الضبط بالمؤسسة السجنية يعد صحيحا ويتلقى حالا ويضمن بالسجل الخاص المنصوص عليه في المادة 223.",
                      "يتعين على رئيس المؤسسة السجنية أن يبعث نسخة من هذا التصريح داخل أجل لا يتجاوز أربعاً وعشرين ساعة لكتابة ضبط المحكمة المصدرة للحكم، وإلا تعرض لعقوبات تأديبية بغض النظر عما قد يتعرض له من متابعات جنائية."
                    ]
                  },
                  {
                    "number": "400",
                    "paragraphs": [
                      "يحدد أجل الاستئناف في عشرة أيام تبتدئ من تاريخ النطق بالحكم، إذا صدر بعد مناقشات حضورية في الجلسة بحضور الطرف أو من يمثله أو إذا وقع إشعار أحدهما بيوم النطق به.",
                      "يسري هذا الأجل من يوم التبليغ للشخص نفسه أو في موطنه إذا لم يكن الطرف حاضرا أو ممثلا بالجلسة التي صدر فيها الحكم بعد مناقشات حضورية ولم يسبق إشعاره شخصيا هو أو من يمثله بيوم النطق به.",
                      "يسري نفس الأجل إذا كان الحكم بمثابة حضوري طبقا لمقتضيات المادة 314 أعلاه.",
                      "يسري الأجل كذلك إذا صدر الحكم غيابيا على شخص استدعي قانونيا في اليوم والساعة المحددين في الاستدعاء ولم يحضر.",
                      "إذا استأنف أحد الأطراف داخل الأجل المحدد، فلغيره من الأطراف ممن لهم حق الاستئناف، باستثناء الوكيل العام للملك، أجل إضافي مدته خمسة أيام لتقديم استئنافهم."
                    ]
                  },
                  {
                    "number": "401",
                    "paragraphs": [
                      "لا يقبل استئناف الأحكام التمهيدية أو الصادرة في نزاع عارض أو دفوع إلا بعد صدور الحكم في جوهر الدعوى وفي نفس الوقت الذي يطلب فيه استئناف هذا الحكم.",
                      "يسري نفس الحكم على الأحكام الصادرة في مسألة الاختصاص، ما لم يكن الأمر متعلقا بعدم الاختصاص النوعي وكان الدفع به قد أثير قبل كل دفاع في الجوهر.",
                      "في حالة النزاع بشأن نوع الحكم، يحق للطرف الذي يرفض كاتب الضبط طلبه أن يلتمس، داخل أربع وعشرين ساعة، من رئيس المحكمة بواسطة مذكرة، الأمر بتسجيل التصريح بالاستئناف.",
                      "يتعين على كاتب الضبط الامتثال لأمر الرئيس، ويعتبر تاريخ تقديم الطلب في حالة الموافقة عليه تاريخاً للتصريح بالاستئناف.",
                      "لا يمكن أن يكون أمر الرئيس موضوعا لأي طعن.",
                      "لا يمكن الاحتجاج بالتنفيذ الطوعي للأحكام المنصوص عليها في الفقرة الأولى كوسيلة لعدم قبول الاستئناف."
                    ]
                  },
                  {
                    "number": "402",
                    "paragraphs": [
                      "للوكيل العام للملك حق تقديم الاستئناف خلال أجل ستين يوما تبتدئ من يوم النطق بالحكم.",
                      "يبلغ هذا الاستئناف للمتهم، وعند الاقتضاء، للمسؤول عن الحقوق المدنية.",
                      "يكون هذا التبليغ صحيحا إذا أخبر به المتهم الحاضر بالجلسة، أو إذا صرح الوكيل العام للملك بالاستئناف داخل الأجل القانوني بمناسبة عرض القضية بالجلسة بناء على استئناف المتهم أو أي طرف آخر."
                    ]
                  },
                  {
                    "number": "403",
                    "paragraphs": [
                      "يمكن للمستأنفين، باستثناء النيابة العامة، أن يتنازلوا عن استئنافهم، ويجب أن يكون هذا التنازل صريحا.",
                      "يبقى هذا التنازل عديم الأثر ويمكن التراجع عنه ما دامت المحكمة لم تعط إشهاداً به."
                    ]
                  },
                  {
                    "number": "404",
                    "paragraphs": [
                      "يتعين الإفراج أو رفع المراقبة القضائية عمن يأتي ذكرهم بالرغم عن تقديم الاستئناف، ما لم يكونوا معتقلين لسبب آخر.",
                      "المتهم بمجرد صدور الحكم ببراءته أو بإعفائه أو الحكم بحبسه مع إيقاف التنفيذ أو بالغرامة أو بسقوط الدعوى العمومية.",
                      "المتهم المحكوم عليه بعقوبة سالبة للحرية بمجرد ما يقضي المدة المحكوم بها عليه."
                    ]
                  },
                  {
                    "number": "405",
                    "paragraphs": [
                      "ينقل المتهم المعتقل بأمر من وكيل الملك إلى المؤسسة السجنية القريبة من محكمة الاستئناف داخل أجل لا يتجاوز ثمانية أيام ابتداء من يوم التصريح بالاستئناف."
                    ]
                  },
                  {
                    "number": "406",
                    "paragraphs": [
                      "إذا ألغي الحكم بسبب خرق الإجراءات الشكلية التي يقررها القانون، أو بسبب الإغفال، ولم يقع تدارك الأمر تلافيا للبطلان، فإن هيئة الاستئناف تتصدى للقضية وتبت في جوهرها.",
                      "تتصدى كذلك في حالة إلغاء حكم صرحت بمقتضاه محكمة الدرجة الأولى خطأ باختصاصها أو بعدم اختصاصها."
                    ]
                  },
                  {
                    "number": "407",
                    "paragraphs": [
                      "تطبق أمام غرفة الجنح الاستئنافية القواعد المقررة في الباب الأول من القسم الثالث من الكتاب الثاني حول سير الجلسة، مع مراعاة المقتضيات الخاصة.",
                      "بعد الانتهاء من استجواب المتهم حول هويته، يتلو الرئيس أو أحد القضاة المستشارين تقريره حول الوقائع إذا طلب ذلك أحد الأطراف.",
                      "يستنطق المتهم في جوهر القضية.",
                      "يستمع إلى الشهود إذا أمرت الغرفة استثنائيا بالاستماع إليهم.",
                      "يتناول الكلمة خلال المناقشات الطرف المستأنف ثم الطرف المستأنف عليه، ويحدد الرئيس ترتيب المداخلات عند تعدد الأطراف.",
                      "إذا كان الاستئناف متعلقا بالحقوق المدنية فقط، فإن النيابة العامة تقدم مستنتجاتها.",
                      "يجب في جميع الأحوال أن تعطى الكلمة الأخيرة للمتهم."
                    ]
                  },
                  {
                    "number": "408",
                    "paragraphs": [
                      "إذا ارتأت غرفة الجنح الاستئنافية أن الطعن بالاستئناف لا يرتكز على أساس بالرغم من صحته شكلا، فإنها تؤيد الحكم المطعون فيه.",
                      "تحكم الغرفة على المستأنف بالمصاريف ما لم يكن المستأنف هو النيابة العامة أو إدارة عمومية في حالة إقامتها للدعوى العمومية."
                    ]
                  },
                  {
                    "number": "409",
                    "paragraphs": [
                      "في حالة تقديم الاستئناف من النيابة العامة أو من إدارة يخول لها القانون إقامة الدعوى العمومية، يجوز لغرفة الجنح الاستئنافية أن تؤيد الحكم المستأنف أو تعدله أو تلغيه إما لفائدة المتهم أو ضده.",
                      "إذا قدم الاستئناف من المتهم وحده، فلا يمكن لمحكمة الاستئناف إلا تأييد الحكم أو تعديله أو إلغائه لفائدة المستأنف."
                    ]
                  },
                  {
                    "number": "410",
                    "paragraphs": [
                      "يقصر استئناف الطرف المدني أو المسؤول عن الحقوق المدنية نظر غرفة الجنح الاستئنافية على المصالح المدنية، ويتيح للمحكمة تقدير حقيقة الوقائع المتسببة في الضرر المدعى به.",
                      "لا يخول هذا الاستئناف للمحكمة إلا تأييد الحكم أو تعديله أو إلغاءه لفائدة المستأنف.",
                      "لا يكون للحكم الصادر بعد هذا الاستئناف أي تأثير على الدعوى العمومية إذا كان الحكم الصادر بناء على متابعة النيابة العامة قد اكتسب قوة الشيء المقضي به.",
                      "إذا كان الطرف المدني هو الذي أقام الدعوى العمومية عن طريق الاستدعاء المباشر، فإن استئنافه يترتب عنه نظر غرفة الجنح الاستئنافية في الدعويين العمومية والمدنية، ويخول هذا الاستئناف للمحكمة تأييد الحكم أو تعديله أو إلغاءه."
                    ]
                  },
                  {
                    "number": "411",
                    "paragraphs": [
                      "إذا كان الفعل لا ينسب إلى المتهم أو لا يشكل أي مخالفة للتشريع الجنائي، فإن غرفة الجنح الاستئنافية تبت في الدعوى طبقا للمادة 389.",
                      "تأمر المحكمة عند الاقتضاء بإرجاع ما قد يكون حكم به للطرف المدني من تعويضات مدنية إذا نص الحكم الابتدائي على التنفيذ المعجل للتعويضات."
                    ]
                  },
                  {
                    "number": "412",
                    "paragraphs": [
                      "إذا ثبت أن الفعل لا يتصف إلا بصفة مخالفة، فإن المحكمة التي تنظر على وجه الاستئناف تلغي الحكم الابتدائي.",
                      "تبت المحكمة في الدعوى طبقا لمقتضيات المادة 387 مع مراعاة مقتضيات الفقرة الأخيرة من المادة 396."
                    ]
                  },
                  {
                    "number": "413",
                    "paragraphs": [
                      "إذا تبين أن للفعل وصف جناية، فإن غرفة الجنح الاستئنافية تصرح بعدم اختصاصها، وتجري المسطرة المقررة في المادة 390."
                    ]
                  },
                  {
                    "number": "414",
                    "paragraphs": [
                      "تطبق أمام غرفة الجنح الاستئنافية مقتضيات المواد 314 و386 و387 و388 و389 الفقرات 3 و4 و5 و390 الفقرة الثانية و391 و392 الفقرة الأولى و393 و394 و395 من هذا القانون."
                    ]
                  },
                  {
                    "number": "415",
                    "paragraphs": [
                      "يمكن للنيابة العامة وللأطراف الطعن بالنقض في الأحكام غير القابلة للاستئناف أو في القرارات النهائية الصادرة عن محكمة الاستئناف.",
                      "يرفع طلب النقض حسب الكيفيات وضمن الآجال المنصوص عليها في المادة 518 وما بعدها من هذا القانون.",
                      "خلافا لمقتضيات المادة 532، وفي الحالة المشار إليها في الفقرة الأولى من المادة 382، فإن هذا الطعن لا يوقف تنفيذ الغرامة.",
                      "يتعين على المحكوم عليه الذي يطلب النقض أن يثبت أداء الغرامة المحكوم بها عليه وقت تقديم طلبه.",
                      "يرد لطالب النقض مبلغ الغرامة في حالة نقض الحكم.",
                      "لا يمكن تطبيق الإكراه البدني قبل أن يصبح الحكم مكتسباً لقوة الشيء المقضي به."
                    ]
                  }
                ]
              }
            ]
          },
          {
            "name": "الباب الثاني",
            "title": "الهيئة المختصة في قضايا الجنايات",
            "articles": [],
            "sections": [
              {
                "name": "الفرع الأول",
                "title": "اختصاص الهيئة وتأليفها",
                "articles": [
                  {
                    "number": "416",
                    "paragraphs": [
                      "تختص غرفة الجنايات بمحكمة الاستئناف بالنظر، تطبيقا للمادة 254 أعلاه، في الجنايات والجرائم التي لا يمكن فصلها عنها أو المرتبطة بها وفقا لمقتضيات المواد من 255 إلى 257 من هذا القانون."
                    ]
                  },
                  {
                    "number": "417",
                    "paragraphs": [
                      "تتألف غرفة الجنايات من رئيس من بين رؤساء الغرف ومستشارين اثنين تعينهم الجمعية العامة لمحكمة الاستئناف لكل سنة قضائية، كما تعين الجمعية العامة للمحكمة من بين أعضائها رئيسا نائبا ومستشارين إضافيين.",
                      "يمكن لغرفة الجنايات في القضايا التي تستوجب مناقشات طويلة أن تضم إليها، بالإضافة إلى أعضائها المذكورين، مستشارا أو أكثر يعينه الرئيس الأول لمحكمة الاستئناف.",
                      "لا يمكن تحت طائلة البطلان أن يكون بين أعضائها أحد القضاة الذين قاموا بأي إجراء من إجراءات المتابعة أو التحقيق في القضية أو شاركوا في البت فيها.",
                      "تعقد غرفة الجنايات جلساتها بحضور النيابة العامة وبمساعدة كاتب الضبط، وذلك تحت طائلة البطلان."
                    ]
                  },
                  {
                    "number": "418",
                    "paragraphs": [
                      "تبت غرفة الجنايات ابتدائيا، ولا يمكن لها أن تصرح بعدم الاختصاص ما عدا في القضايا التي يرجع النظر فيها إلى محكمة متخصصة."
                    ]
                  }
                ]
              },
              {
                "name": "الفرع الثاني",
                "title": "رفع القضية إلى غرفة الجنايات",
                "articles": [
                  {
                    "number": "419",
                    "paragraphs": [
                      "تحال القضية على غرفة الجنايات على النحو التالي:",
                      "1- بقرار الإحالة الصادر عن قاضي التحقيق؛",
                      "2- بإحالة من الوكيل العام للملك طبقا للمادتين 73 و 1-73 من هذا القانون؛",
                      "3- بإحالة من الغرفة الجنحية عند إلغاء قرار قاضي التحقيق بعدم المتابعة."
                    ]
                  },
                  {
                    "number": "420",
                    "paragraphs": [
                      "يستدعى في كافة الأحوال المتهم، والمسؤول عن الحقوق المدنية والطرف المدني إن وجدوا، طبقاً لما هو منصوص عليه في المادتين 308 و309 أعلاه.",
                      "يتضمن الاستدعاء، تحت طائلة البطلان، ملخصاً للوقائع والتكييف القانوني لها والمواد القانونية التي تعاقب عليها.",
                      "يخفض الأجل المنصوص عليه في المادة 309 أعلاه إلى خمسة أيام إذا تعلق الأمر بإحالة من الوكيل العام للملك."
                    ]
                  },
                  {
                    "number": "421",
                    "paragraphs": [
                      "يحق لمحامي المتهم أن يتصل بموكله بكل حرية.",
                      "يمكنه أن يطلع على جميع محتويات الملف والحصول على نسخ منه على نفقته، ورقياً أو على دعامة إلكترونية.",
                      "يحق للطرف المدني والمسؤول عن الحقوق المدنية أو محاميهما الاطلاع على الملف والحصول على نسخة منه على نفقتهما، ورقياً أو على دعامة إلكترونية."
                    ]
                  },
                  {
                    "number": "1-421",
                    "paragraphs": [
                      "بمجرد إحالة القضية على غرفة الجنايات، يعين رئيس الهيئة من بين أعضائها مستشاراً مكلفاً بتجهيز القضية.",
                      "يتخذ المستشار المعين الإجراءات اللازمة لجعل القضية جاهزة للحكم، دون المساس بما يمكن لهيئة المحكمة أن تأمر به من إجراءات وفق ما ينص عليه هذا القانون.",
                      "يتولى المستشار المكلف بتجهيز القضية على الخصوص اتخاذ ما يلي: التحقق من هوية الأطراف، تلقي الدفوع والطلبات الكتابية، تعيين المحامي في إطار المساعدة القضائية في حالة عدم اختياره من طرف المتهم، التأكد من التوصل بالاستدعاءات ومراقبة الإجراءات، تتبع إنجاز الخبرات المأمور بها، تلقي طلبات الإفراج المؤقت أو رفع تدابير المراقبة القضائية أو طلب تغييرها.",
                      "تعقد غرف الجنايات جلسة للبت في الدفوع والطلبات المقدمة داخل أجل لا يتعدى عشرة أيام، ويمكن لها عند الاقتضاء تكليف المستشار المكلف بتجهيز القضية باستكمال إجراءات تجهيز القضية.",
                      "إذا تم تجهيز القضية، فإن المستشار المعين يحدد تاريخ الجلسة التي تدرج فيها القضية ويستدعى لها الأطراف."
                    ]
                  }
                ]
              },
              {
                "name": "الفرع الثالث",
                "title": "الجلسة وصدور الحكم",
                "articles": [
                  {
                    "number": "422",
                    "paragraphs": [
                      "يدير الرئيس المناقشات ويسهر على النظام وعلى احترام المقتضيات المتعلقة بسير الجلسات المنصوص عليها في هذا القانون.",
                      "يخول الرئيس سلطة تقديرية يمكنه بمقتضاها، وتبعا لما تمليه عليه قواعد الشرف والضمير، أن يتخذ جميع المقررات ويأمر بجميع التدابير التي يراها مفيدة للكشف عن الحقيقة، ما لم يمنعها القانون."
                    ]
                  },
                  {
                    "number": "423",
                    "paragraphs": [
                      "يعلن الرئيس عن افتتاح الجلسة ويأمر بإدخال المتهم.",
                      "يمثل المتهم بالجلسة حرا ومرافقا فقط بحراس لمنعه من الفرار. غير أنه إذا كان المتهم يشكل خطرا على نفسه أو على الغير، فإنه يجوز لرئيس الهيئة أن يأمر باتخاذ الإجراءات الكفيلة بدرء الخطر المحتمل.",
                      "إذا كانت قاعة الجلسات مجهزة بقفص اتهام يكفي لدرء الخطر المحتمل، فإنه يمكن لرئيس الهيئة أن يأمر بوضع المتهم داخله في احترام تام لكرامته.",
                      "وفي جميع الأحوال يتعين تمكين المتهم من الاستماع وتتبع أطوار المحاكمة.",
                      "إذا رفض المتهم الموجود بمقر المحكمة الحضور أو تعذر عليه ذلك، يوجه إليه الرئيس إنذارا بواسطة عون من القوة العمومية يسخره الوكيل العام للملك، فإن لم يمتثل المتهم للإنذار جاز للرئيس في الحالة الأولى أن يأمر بإحضاره للجلسة بواسطة القوة العمومية.",
                      "وفي جميع الحالات، يمكن للرئيس أن يأمر بمواصلة المناقشات في غيبة المتهم، وإذا كان معتقلا تعين على كاتب الضبط أن يتلو عليه محضر المناقشات وملتمسات النيابة العامة والأحكام والقرارات التمهيدية الصادرة في غيبته.",
                      "وينقل المتهم من جديد إلى الجلسة عند انتهاء المناقشات حيث يصدر القرار بحضوره، وإذا تعذر حضوره تعين على كاتب الضبط أن يتلو عليه منطوق القرار.",
                      "يطلب الرئيس من المتهم الإدلاء باسمه العائلي والشخصي وبسنه ومهنته ومحل سكناه ومكان ولادته وسوابقه.",
                      "يتأكد الرئيس من حضور محامي المتهم، وفي حالة تغيبه يعين تلقائيا محاميا آخر في إطار المساعدة القضائية.",
                      "يتأكد أيضا من حضور الترجمان في الحالة التي يكون من اللازم الاستعانة به."
                    ]
                  },
                  {
                    "number": "424",
                    "paragraphs": [
                      "يمكن لرئيس غرفة الجنايات أن يستدعي خلال المناقشات، ولو بأمر بالإحضار، كل شخص للاستماع إليه أو أن يطلب الإدلاء بكل دليل جديد ظهر له من عرض القضية في الجلسة أنه مفيد لإظهار الحقيقة.",
                      "غير أنه إذا عارضت النيابة العامة أو دفاع المتهم أو الطرف المدني أو المسؤول عن الحقوق المدنية في أن يؤدي الشهود، المستدعون على الصفة المشار إليها، اليمين، فإن تصريحات هؤلاء لا تتلقى إلا كمجرد معلومات."
                    ]
                  },
                  {
                    "number": "425",
                    "paragraphs": [
                      "إذا ظهر من المناقشات وجود قرائن زور خطيرة في شهادة ما، فلغرفة الجنايات إما تلقائيا أو بطلب من النيابة العامة أو الأطراف أن تأمر بوضع الشاهد تحت الحراسة.",
                      "يتعين على الرئيس، قبل الإعلان عن اختتام المناقشات، سواء توبعت مناقشة القضية الرئيسية أو ظهر من الضروري تأجيلها لجلسة مقبلة نظرا لأهمية الشهادة المظنون زورها، أن يحث للمرة الأخيرة الشاهد على قول الحقيقة وينبهه بعد ذلك إلى أن تصريحاته ستعتبر من الآن نهائية، مع ما يمكن أن يطبق عليها من العقوبات المقررة لشهادة الزور.",
                      "تأمر غرفة الجنايات، عند الاقتضاء، بإحالة المعني بالأمر والمستندات فوراً بواسطة القوة العمومية إلى النيابة العامة المختصة."
                    ]
                  },
                  {
                    "number": "426",
                    "paragraphs": [
                      "إذا طرأ نزاع عارض خلال الجلسة، بتت فيه غرفة الجنايات حالا.",
                      "غير أنه إذا لاحظت غرفة الجنايات أن النزاع العارض يطعن في سلطة الرئيس التقديرية، فإنها تصرح بعدم اختصاصها بشأنه.",
                      "لا يمكن الطعن في أي قرار من القرارات التي تصدرها غرفة الجنايات بشأن نزاع عارض إلا مع الطعن في الجوهر."
                    ]
                  },
                  {
                    "number": "427",
                    "paragraphs": [
                      "عند انتهاء بحث القضية تستمع المحكمة إلى الطرف المدني أو محاميه ثم تقدم النيابة العامة ملتمساتها.",
                      "يعرض المتهم أو محاميه وسائل الدفاع.",
                      "يسمح بالتعقيب للطرف المدني وللنيابة العامة وتكون الكلمة الأخيرة دائما للمتهم أو محاميه، ويعلن الرئيس عن انتهاء المناقشات."
                    ]
                  },
                  {
                    "number": "428",
                    "paragraphs": [
                      "يأمر الرئيس بإخراج المتهم من قاعة الجلسة ويعلن عن توقيفها.",
                      "يدعو القضاة المستشارين لمرافقته إلى قاعة المداولات.",
                      "إذا استعان الرئيس بمستشارين إضافيين نظرا لطول المناقشات وتبين له أن مشاركتهم في المداولة غير ضرورية، فإنه يدعوهم إلى الانسحاب من الهيئة مع البقاء ببناية المحكمة طيلة مدة المداولات."
                    ]
                  },
                  {
                    "number": "429",
                    "paragraphs": [
                      "لا يجوز لأعضاء غرفة الجنايات أن يغادروا قاعة المداولات إلا للرجوع إلى قاعة الجلسات لإصدار قرارهم في جلسة علنية.",
                      "ولا يمكن لأحد أن يدخل تلك القاعة خلال المداولات لأي سبب كان بدون إذن من الرئيس، وكل من خالف هذا المنع يمكن أن يطرد بأمر من الرئيس.",
                      "إذا تعذرت مشاركة أحد أعضاء المحكمة في المداولات، ولم يكن قد وقع تعيين أعضاء إضافيين، فيجب تأخير القضية إلى جلسة مقبلة وتعاد المناقشات بكاملها.",
                      "في حالة ما إذا وقع تعيين أعضاء إضافيين، يدعى أقدمهم بحسب الترتيب ليحل محل العضو الأصلي الذي حدث له مانع، ثم تعاد المداولات بكاملها.",
                      "يجب تحرير محضر يضمن فيه هذا الحادث من طرف كاتب الضبط الذي يدعى لهذه الغاية."
                    ]
                  },
                  {
                    "number": "1-429",
                    "paragraphs": [
                      "إذا تعذر إصدار القرار في الحال، فيمكن لغرفة الجنايات جعل القضية في المداولة لمدة لا تتجاوز خمسة عشر يوما.",
                      "في هذه الحالة يحدد رئيس غرفة الجنايات تاريخ النطق بالقرار ويعلم به الأطراف، ويصدر القرار في الموعد المحدد لذلك، ويتعين أن يكون محررا."
                    ]
                  },
                  {
                    "number": "430",
                    "paragraphs": [
                      "يتداول أعضاء غرفة الجنايات في شأن إدانة المتهم وفي العقوبة، معتبرين على الأخص الظروف المشددة وحالات الأعذار القانونية إن وجدت.",
                      "يجب على الرئيس أن يدعو الهيئة كلما قررت إدانة المتهم إلى البت في وجود ظروف مخففة أو عدم وجودها.",
                      "تنظر غرفة الجنايات، عند الاقتضاء، في منح المحكوم عليه إيقاف تنفيذ العقوبة وفي تطبيق العقوبات الإضافية أو اتخاذ تدابير وقائية.",
                      "يتخذ القرار في جميع الأحوال بالأغلبية، ويقع التصويت على التوالي بخصوص كل نقطة على حدة.",
                      "غير أنه لا يمكن النطق بعقوبة الإعدام إلا بإجماع القضاة الذين تتألف منهم هيئة الحكم، ويشار إلى الإجماع في منطوق الحكم.",
                      "يحرر رئيس الجلسة محضرا للمداولة يشار فيه إلى إجماع القضاة، ويتم توقيع المحضر في هذه الحالة من قبل جميع أعضاء الهيئة ويضم إلى وثائق الملف."
                    ]
                  },
                  {
                    "number": "431",
                    "paragraphs": [
                      "يمكن لغرفة الجنايات في حالة الحكم بعقوبة جنائية سالبة للحرية، أن تأمر بإلقاء القبض حالاً على المحكوم عليه الذي حضر حرا إلى الجلسة.",
                      "ينفذ الأمر الصادر ضده رغم كل طعن."
                    ]
                  },
                  {
                    "number": "432",
                    "paragraphs": [
                      "لا ترتبط غرفة الجنايات بتكييف الجريمة المحال عليها، ويجب عليها أن تكيف قانونيا الأفعال التي تحال إليها، وأن تطبق عليها النصوص الجنائية المتلائمة مع نتيجة بحث القضية بالجلسة.",
                      "غير أنه إذا تبين من البحث وجود ظرف أو عدة ظروف مشددة لم تضمن في القرار بالإحالة، فلا يجوز لغرفة الجنايات أن تأخذ بها إلا بعد الاستماع لمطالب النيابة العامة وتصريحات المتهم وإيضاحات الدفاع."
                    ]
                  },
                  {
                    "number": "433",
                    "paragraphs": [
                      "إذا تبين لغرفة الجنايات أثناء المناقشات وجود أدلة ضد المتهم بسبب أفعال أخرى، وطلبت النيابة العامة الإشهاد بالاحتفاظ بحقها في المتابعة، يأمر الرئيس بتقديم المتهم الحاضر بالجلسة الذي صدر لفائدته حكم بالبراءة أو الإعفاء بواسطة القوة العمومية إلى ممثل النيابة العامة."
                    ]
                  },
                  {
                    "number": "434",
                    "paragraphs": [
                      "إذا تبين من المناقشات أن الفعل الجرمي لا ينسب إلى المتهم، أو أن الفعل المنسوب إليه لا يعاقب عليه القانون الجنائي، أو لم يعد يعاقب عليه، فإن غرفة الجنايات تحكم بالبراءة.",
                      "إذا استفاد المتهم من عذر معف، فإن غرفة الجنايات تحكم بالإعفاء.",
                      "يطلق فوراً سراح المتهم الذي صدر في حقه قرار بالبراءة أو الإعفاء أو سقوط الدعوى العمومية أو إيقاف تنفيذ العقوبة السالبة للحرية أو بالغرامة فقط، ما لم يكن معتقلا من أجل سبب آخر، أو ترفع تدابير المراقبة القضائية عنه."
                    ]
                  },
                  {
                    "number": "435",
                    "paragraphs": [
                      "إذا تبين لغرفة الجنايات، من خلال المناقشات، أن المتهم كان وقت ارتكابه الأفعال مصابا بخلل في قواه العقلية أو أن الخلل حصل له أثناء المحاكمة، فإنها تطبق حسب الأحوال مقتضيات الفصلين 76 و78 أو الفصل 79 من القانون الجنائي."
                    ]
                  },
                  {
                    "number": "436",
                    "paragraphs": [
                      "إذا قدم الطرف المدني مطالبه المدنية، فإن غرفة الجنايات تبت بموجب نفس القرار الصادر عنها بإدانة المتهم في قبول الطلب وفي منح التعويض عن الضرر إن اقتضى الحال.",
                      "تبقى غرفة الجنايات مختصة بالبت طبقا للفقرة السابقة في حالة سقوط الدعوى العمومية أو في حالة صدور حكم بالإعفاء تطبيقا للفصلين 76 و145 من القانون الجنائي.",
                      "تصرح الغرفة بعدم اختصاصها في حال إصدارها قرارا ببراءة المتهم."
                    ]
                  },
                  {
                    "number": "437",
                    "paragraphs": [
                      "يجوز للمتهم الذي صدر في شأنه حكم بالبراءة أن يرفع ضد الطرف المدني دعوى حسب الإجراءات العادية يطلب فيها التعويض عن الضرر."
                    ]
                  },
                  {
                    "number": "438",
                    "paragraphs": [
                      "يجوز لغرفة الجنايات أن تأمر ولو تلقائيا برد الأشياء الموضوعة تحت يد العدالة ما لم تكن خطيرة أو محل مصادرة أو لازمة لسير الدعوى.",
                      "غير أنه إذا صدر حكم بالإدانة، فلا يقع رد الأشياء إلا بعد أن يثبت مالكها أن المحكوم عليه لم يتقدم بطلب النقض أو فاته أجل الطعن به أو أنه قد طلبه وبتت فيه محكمة النقض بقرار مكتسب لقوة الشيء المقضي به.",
                      "إذا تم الطعن بالنقض، فيمكن لغرفة الجنايات أن تأمر برد الأشياء مع التزام المالك أو الحائز بإعادة تقديم الأشياء الصالحة كأدوات اقتناع.",
                      "يمكن للغرفة أن تأمر في كل وقت بإتلاف الأشياء الفاسدة أو ببيع الأشياء التي يخشى فسادها أو تلفها أو تعذر الاحتفاظ بها، ولا يسترد في هذه الحالة إلا الثمن المحصل عليه من بيعها."
                    ]
                  },
                  {
                    "number": "439",
                    "paragraphs": [
                      "مع مراعاة مقتضيات المادة 1-429، تعود هيئة غرفة الجنايات بعد انتهاء المداولات إلى قاعة الجلسات بحضور النيابة العامة وبمساعدة كاتب الضبط.",
                      "يأمر الرئيس بإحضار المتهم ويتحقق من توفر شروط العلنية.",
                      "يتلو الرئيس القرار القاضي بالإدانة أو الإعفاء أو البراءة أو سقوط الدعوى العمومية أو يأمر بتأجيل القضية أو بإجراء تحقيق تكميلي، ويعلن عن اسم المستشار المعين للقيام بالتحقيق.",
                      "تأمر غرفة الجنايات، عند الاقتضاء، بالإفراج المؤقت عن المتهم أو بوضع حد لتدابير المراقبة القضائية كلاً أو بعضاً."
                    ]
                  },
                  {
                    "number": "440",
                    "paragraphs": [
                      "بعد تلاوة القرار، يشعر الرئيس المتهم أن له ابتداء من يوم صدور القرار أجلاً مدته عشرة أيام كاملة للطعن بالاستئناف."
                    ]
                  },
                  {
                    "number": "441",
                    "paragraphs": [
                      "يجب أن يتضمن قرار غرفة الجنايات المقتضيات المقررة في المادة 365 والإشارة إلى تداول الهيئة وفقاً لمقتضيات المادة 430، ويبين المتحمل للمصاريف إعمالاً للمادتين 367 و368 من هذا القانون."
                    ]
                  },
                  {
                    "number": "442",
                    "paragraphs": [
                      "يحرر كاتب الضبط في كل قضية محضرا يلخص فيه أهم ما جاء في أجوبة المتهمين وتصريحات الشهود، ويذكر فيه باختصار المسائل العارضة التي نشأت أثناء المناقشات، ويشير فيه إلى المطالب والمرافعات ووسائل الدفاع وما آلت إليه، ويضمنه منطوق المقررات الصادرة عن الهيئة.",
                      "يوقع على المحضر كل من الرئيس وكاتب الضبط.",
                      "يمكن للنيابة العامة والأطراف أو دفاعهم أن يطلبوا من الرئيس تلاوة المحضر أو جزء منه وتضمين ما وقع إغفاله.",
                      "يفترض أن الإجراءات المقررة قانونيا لسير جلسات غرفة الجنايات قد استكملت، ولا تسقط هذه القرينة إلا إذا ورد في المحضر أو القرار أو في طلب صريح ما يفيد عدم استكمالها."
                    ]
                  }
                ]
              },
              {
                "name": "الفرع الرابع",
                "title": "المسطرة الغيابية",
                "articles": [
                  {
                    "number": "443",
                    "paragraphs": [
                      "إذا تعذر القبض على المتهم بعد الإحالة أو إذا لاذ بالفرار بعد القبض عليه أو إذا كان في حالة سراح أو الإفراج المؤقت أو الوضع تحت المراقبة القضائية، ولم يستجب إلى الاستدعاء بالمثول المسلم إليه، فإن غرفة الجنايات تصدر أمرا بإجراء المسطرة الغيابية.",
                      "ينص هذا الأمر على أنه يتعين على المتهم أن يحضر داخل أجل خمسة عشر يوما، وإلا يصرح بأنه غير ممتثل للقانون، ويوقف عن مزاولة حقوقه المدنية، وتعقل أملاكه خلال مدة التحقيق الغيابي، ويمنع من رفع أية دعوى قضائية طيلة نفس المدة، ويصرح بأنه سيحاكم رغم تغيبه، وأن على كل شخص أن يدل على المكان الذي يوجد فيه.",
                      "يشير هذا الأمر، زيادة على ما تقدم، إلى هوية المتهم وأوصافه، وإلى وصف الجناية المتهم بها، وإلى الأمر بإلقاء القبض عليه.",
                      "وفي هذه الحالة يوضع حد بقوة القانون للأمر بإلقاء القبض الصادر عن قاضي التحقيق إذا كان لا يزال ساريا، وفقا لأحكام المادتين 217 و218 من هذا القانون."
                    ]
                  },
                  {
                    "number": "444",
                    "paragraphs": [
                      "يوجه الوكيل العام للملك نسخة من الأمر المنصوص عليه في المادة 443 أعلاه إلى مصالح الشرطة القضائية لتنفيذه.",
                      "ويوجهه أيضا عند الاقتضاء إلى مديرية أملاك الدولة بالدائرة التي كان يوجد فيها آخر مسكن للمتهم، وعند عدم معرفة هذا المسكن إلى هذه الإدارة بالمكان الذي تنعقد فيه المحكمة الجنائية، لتنفيذ الأمر بعقل الأملاك."
                    ]
                  },
                  {
                    "number": "445",
                    "paragraphs": [
                      "ينشر لمدة خمسة عشر يوما بالمنصة الإلكترونية المعدة لهذا الغرض الإعلان التالي:",
                      "صدر عن غرفة الجنايات لدى محكمة الاستئناف ب... أمر بإجراء المسطرة الغيابية ضد فلان (الهوية) الذي كان يوجد مسكنه الأخير ب... والمتهم ب... .",
                      "وأوصاف المتهم فلان هي ... ورقم بطاقة هويته، مع وضع صورته على المنصة عند الاقتضاء.",
                      "يتعين على فلان أن يقدم نفسه حالا إلى أية سلطة قضائية أو شرطية.",
                      "ويتحتم على كل شخص يعرف المكان الذي يوجد به المتهم أن يعلم بذلك نفس السلطات."
                    ]
                  },
                  {
                    "number": "446",
                    "paragraphs": [
                      "إذا لم يحضر المتهم شخصيا داخل خمسة عشر يوما الموالية لنشر الإعلان بالمنصة كما جاء في المادة السابقة، فإن غرفة الجنايات تباشر محاكمته.",
                      "غير أنه إذا تعذر على المتهم مطلقا أن يحضر شخصيا، فيمكن لمحاميه أو لذويه أن يعرضوا على غرفة الجنايات الأسباب المبررة لغيابه."
                    ]
                  },
                  {
                    "number": "447",
                    "paragraphs": [
                      "إذا قبلت المحكمة العذر المقدم، فإنها تأمر بإرجاء محاكمة المتهم.",
                      "كما تأمر عند الاقتضاء برفع العقل عن أملاكه لأجل تحدده."
                    ]
                  },
                  {
                    "number": "448",
                    "paragraphs": [
                      "إذا لم يقدم عذر، أو قدم ولم يقبل، يتلو كاتب الضبط بالجلسة قرار الإحالة والأمر بإجراء المسطرة الغيابية.",
                      "تستمع المحكمة بعد تلاوة ما تقدم إلى الطرف المدني إن كان طرفا في الدعوى، وإلى ملتمسات النيابة العامة، وإيضاحات الدفاع إن وجد.",
                      "في حالة إغفال أحد الإجراءات المنصوص عليها في المادتين 443 و444 أعلاه، تأمر المحكمة بإعادة الإجراء الذي تم إغفاله تحت طائلة التصريح ببطلان المسطرة الغيابية.",
                      "إذا كانت المسطرة صحيحة، تبت غرفة الجنايات في التهمة، وعند الاقتضاء في الحقوق المدنية."
                    ]
                  },
                  {
                    "number": "449",
                    "paragraphs": [
                      "إذا صدر الحكم بإدانة المتهم المتغيب، فإن أملاكه تبقى تحت العقل.",
                      "يمكن طيلة مدة العقل فرض نفقات لزوجه وأصوله وفروعه ولكل شخص تجب نفقته على المتهم المتغيب طبقا لمقتضيات مدونة الأسرة.",
                      "يعرض حساب العقل النهائي على المحكوم عليه بمقتضى المسطرة الغيابية إذا زال أثر الحكم الغيابي بحضوره أو تقادمت العقوبة.",
                      "ويعرض الحساب على ذوي حقوقه بعد موته حقيقة أو حكما.",
                      "إذا ظل المحكوم عليه غائبا إلى حين تقادم العقوبة، يخصم من حساب العقل النهائي المبلغ الضروري لأداء الغرامات والمصاريف والتعويضات المستحقة وتكاليف تسيير حساب العقل طيلة مدة تقادم العقوبة.",
                      "تتولى المحكمة المصدرة للقرار الغيابي اتخاذ الإجراءات القانونية لتنفيذ هذا المقتضى بناء على ملتمس من النيابة العامة، ويكون قرارها غير قابل لأي طعن."
                    ]
                  },
                  {
                    "number": "450",
                    "paragraphs": [
                      "ينشر بالمنصة، بطلب من النيابة العامة، ملخص القرار الصادر بناء على المسطرة الغيابية.",
                      "كما يبلغ لإدارة أملاك الدولة طبقا للمادة 444 أعلاه.",
                      "بعد القيام بهذه التدابير، يصبح التجريد من الحقوق التي ينص عليها القانون ساريا على المحكوم عليه."
                    ]
                  },
                  {
                    "number": "451",
                    "paragraphs": [
                      "لا يقبل الطعن في القرار الصادر غيابيا إلا من النيابة العامة ومن الطرف المدني فيما يتعلق بحقوقه."
                    ]
                  },
                  {
                    "number": "452",
                    "paragraphs": [
                      "لا يجوز في أي حال أن يترتب عن وجود أحد المتهمين في حالة غياب إيقاف أو تأجيل التحقيق في حق الحاضرين من المساهمين أو المشاركين معه في الجريمة.",
                      "يمكن لغرفة الجنايات بعد الحكم على الحاضرين أن تأمر برد الأشياء المودعة بكتابة الضبط بصفتها أدوات اقتناع.",
                      "كما يمكنها أن تأمر برد تلك الأشياء أو الأموال أو الممتلكات بشرط تقديمها من جديد إذا اقتضى الحال ذلك.",
                      "ويضع كاتب الضبط قبل الرد محضرا يصف فيه الأشياء أو الأموال أو الممتلكات المسلمة."
                    ]
                  },
                  {
                    "number": "453",
                    "paragraphs": [
                      "إذا سلم المحكوم عليه غيابيا نفسه للمؤسسة السجنية، أو إذا قبض عليه قبل سقوط عقوبته بالتقادم، يقع اعتقاله بموجب الأمر المنصوص عليه في المادة 443 أعلاه.",
                      "وإذا قدم المعني بالأمر نفسه إلى هيئة المحكمة مباشرة أو إلى النيابة العامة، فإن هذه الأخيرة تتولى إحالته على المحكمة التي تبت في وضعيته، إما بإيداعه في السجن، أو بمواصلة محاكمته في حالة سراح، أو باتخاذ تدابير المراقبة القضائية.",
                      "تسهر النيابة العامة على أمر الشرطة القضائية بوضع حد للأمر بإلقاء القبض.",
                      "يسري نفس الحكم إذا ألقي القبض على المتهم الهارب أو قدم نفسه ليسجن قبل صدور الأمر بإجراء المسطرة الغيابية وبعد صدور قرار الإحالة.",
                      "في الحالتين المنصوص عليهما أعلاه، يسقط بموجب القانون الحكم والإجراءات المتخذة منذ الأمر بإجراء المسطرة الغيابية.",
                      "إذا ظهر من الضروري إجراء تحقيق تكميلي، تعين أن يقوم به مستشار تعينه غرفة الجنايات ضمن الشروط المنصوص عليها في المادة 439 من هذا القانون.",
                      "إذا ادعى المتهم أن الحكم الغيابي لا يتعلق به، تتخذ الإجراءات وفق المواد 592 إلى 595 من هذا القانون.",
                      "إذا تعذر لسبب من الأسباب الاستماع إلى الشهود خلال المناقشات، تليت بالجلسة شهاداتهم المكتوبة، كما تتلى عند الاقتضاء الأجوبة المكتوبة لباقي المتهمين المتابعين بنفس الجناية، وكذا باقي المستندات التي يعتبرها الرئيس صالحة لإظهار الحقيقة."
                    ]
                  },
                  {
                    "number": "454",
                    "paragraphs": [
                      "إذا حضر المحكوم عليه غيابيا وحكم من جديد ببراءته أو بإعفائه أو بسقوط الدعوى العمومية، حكم عليه بالمصاريف المترتبة عن المحاكمة الغيابية، ما لم تعفه غرفة الجنايات من ذلك.",
                      "يمكن للغرفة كذلك أن تأمر بنشر قرارها حسب الشروط المنصوص عليها في المادة 444 أعلاه."
                    ]
                  }
                ]
              },
              {
                "name": "الفرع الخامس",
                "title": "المحاكمة من أجل الجرائم المرتبطة بالجنايات",
                "articles": [
                  {
                    "number": "455",
                    "paragraphs": [
                      "إذا لم يحضر المتهم المتابع أمام غرفة الجنايات من أجل جريمة مرتبطة بجناية بعد استدعائه بصفة صحيحة، فإنه يحاكم حسب القواعد العادية المطبقة على نوع الجريمة.",
                      "ويوصف الحكم تبعا لمقتضيات المادة 314 من هذا القانون."
                    ]
                  },
                  {
                    "number": "456",
                    "paragraphs": [
                      "تطبق أمام غرفة الجنايات، في المتابعة من أجل الاتهام بجنحة، مقتضيات المادة 392 من هذا القانون."
                    ]
                  }
                ]
              },
              {
                "name": "الفرع السادس",
                "title": " استئناف قرارات غرف الجنايات",
                "articles": [
                  {
                    "number": "457",
                    "paragraphs": [
                      "يمكن للمتهم وللنيابة العامة والمطالب بالحق المدني وللمسؤول عن الحقوق المدنية استئناف القرارات الباتة في الجوهر الصادرة عن غرف الجنايات أمام نفس المحكمة، مع مراعاة المادة 382 والفقرة الأولى من المادة 401 من هذا القانون.",
                      "يقدم الاستئناف وفق الكيفية المنصوص عليها في الفقرات الثانية والثالثة والرابعة من المادة 399 أعلاه.",
                      "تسري على آجال الطعن بالاستئناف وآثاره مقتضيات المواد 400 و401 و403 و404 و406 و408 و409 و410 و411 و412 من هذا القانون.",
                      "ويمكن أيضاً الطعن بالاستئناف في القرارات الباتة في الاعتقال الاحتياطي أو المراقبة القضائية.",
                      "تنظر في الطعن بالاستئناف غرفة الجنايات الاستئنافية لدى نفس المحكمة، وهي مكونة من هيئة أخرى مشكلة من رئيس غرفة وأربعة مستشارين لم يسبق لهم المشاركة في البت في القضية، بحضور ممثل النيابة العامة ومساعدة كاتب الضبط، تحت طائلة البطلان.",
                      "يمكن أن يضاف إلى تشكيلة الهيئة مستشار أو أكثر وفقاً لما تنص عليه الفقرة الثانية من المادة 417 من هذا القانون.",
                      "خلافاً للمقتضيات السالفة، يمكن للرئيس الأول لمحكمة الاستئناف أن يترأس شخصياً غرفة الجنايات الاستئنافية.",
                      "تبت غرفة الجنايات الاستئنافية التي تنظر في الطعن بقرار نهائي وفقاً للإجراءات المقررة في المواد 417 و418 ومن 420 إلى 442 و455 و456 من هذا القانون.",
                      "بعد تلاوة القرار، يشعر الرئيس المتهم أن له ابتداءً من يوم صدور القرار أجلاً مدته عشرة أيام للطعن بالنقض.",
                      "تطبق المسطرة الغيابية في الجنايات من قبل غرفة الجنايات الاستئنافية وفقاً لمقتضيات الفرع الرابع من الباب الثاني من القسم الرابع من الكتاب الثاني من هذا القانون.",
                      "غير أنه إذا كانت المسطرة الغيابية في الجنايات قد أجريت خلال المرحلة الابتدائية، فإن إجراءاتها تظل سارية خلال المرحلة الاستئنافية، ويكتفي رئيس غرفة الجنايات الاستئنافية بالاستماع لملتمسات النيابة العامة والمطالب بالحق المدني إن وجد.",
                      "وفي حالة عودة المتهم إلى التغيب عن جلسات المحاكمة رغم التوصل، يمكن للمحكمة أن تطبق مقتضيات العقل المشار إليها في المادة 443 من هذا القانون مع مواصلة إجراءات المحاكمة."
                    ]
                  }
                ]
              }
            ]
          }
        ]
      }
    ]
  }