{
    "name": "الكتاب الخامس",
    "title": "مساطر خاصة",
    "sections": [
      {
        "name": "القسم الأول",
        "title": "المسطرة الخاصة بدعوى تزوير الوثائق",
        "articles": [
          {
            "number": "575",
            "paragraphs": [
              "إذا ادعي الزور في وثيقة، تعين على حائزها بأية صفة كانت أن يسلمها إلى النيابة العامة بناء على طلبها أو إلى قاضي التحقيق بناء على أمر صادر عنه.",
              "تسلم له حينا نسخة منها مشهود بمطابقتها للأصل.",
              "إذا امتنع الحائز من تسليم الوثيقة المدعى فيها الزور عن طواعية، أمكن إجراء كل تفتيش أو حجز طبقا لمقتضيات المادة 101 وما يليها إلى المادة 104 من هذا القانون.",
              "إذا عثر على هذه الوثيقة، يتم فورا توقيع كل ورقة من أوراقها من السلطة التي باشرت حجزها والشخص الذي كانت في حيازته. فإن امتنع هذا الأخير عن التوقيع أو عجز عن ذلك، نص على ذلك في محضر الحجز."
            ]
          },
          {
            "number": "576",
            "paragraphs": [
              "تودع الوثيقة المدعى فيها الزور بمجرد تسليمها أو حجزها بكتابة الضبط، ويمضي كاتب الضبط جميع صفحاتها، ويحرر محضرا مفصلا يصف فيه حالة الوثيقة المادية.",
              "يمضي صفحات الوثيقة كذلك الشخص الذي يقوم بإيداعها بكتابة الضبط، ويأخذ كاتب الضبط صورة عنها يصادق عليها بإمضائه وطابع المحكمة.",
              "علاوة على ذلك، يمضيها الشخص المشتبه فيه عند حضوره، والطرف المدني إن انتصب في الدعوى، والشهود الذين قد يستدعون لأداء شهادتهم بشأنها.",
              "إذا امتنع أحدهم عن التوقيع أو تعذر عليه القيام به، ينص على ذلك بالمحضر.",
              "يمكن لممثل النيابة العامة أو قاضي التحقيق أن ينتقل لإجراء جميع البحوث والتحريات الضرورية في أي مكان عمومي توجد به مستندات مشوبة بالزور أو أي مكان أعدت به هذه المستندات.",
              "يمكن لممثل النيابة العامة أو قاضي التحقيق، عند الضرورة، أن يفوض هذه السلطات إلى ضابط للشرطة القضائية، ويمكنه في حالة الاستعجال أن يأمر بنقل المستندات المشتبه فيها إلى كتابة الضبط."
            ]
          },
          {
            "number": "577",
            "paragraphs": [
              "لا يمكن أن تستعمل كمستندات للمقارنة إلا المحررات الرسمية العمومية وحدها، أو إن اقتضى الحال، المحررات الخصوصية التي اعترف بها الأطراف المعنيون بالأمر."
            ]
          },
          {
            "number": "578",
            "paragraphs": [
              "يتعين على كل شخص يحوز محررات عمومية أو خصوصية صالحة كمستندات للمقارنة، أن يسلمها للسلطة المنصوص عليها في المادة 575 أعلاه.",
              "إذا امتنع عن تسليمها طوعاً، أمكن إجراء كل تفتيش أو حجز طبقاً لمقتضيات المادة 101 وما يليها إلى المادة 104 من هذا القانون."
            ]
          },
          {
            "number": "579",
            "paragraphs": [
              "إذا كانت المستندات المعدة للمقارنة، والتي قدمها أمين الوثائق العمومي أو حجزت بين يديه، وثائق رسمية، تستخرج منها نسخة أو صورة يقوم رئيس المحكمة الابتدائية الموجود بدائرتها الأمين العمومي بمقارنتها مع أصلها ويؤشر على مطابقتها للأصل.",
              "تحل النسخة أو الصورة المستخرجة من الأصل محل الأصل الموجود بيد الأمين العمومي، الذي يمكنه أن يسلم منها نسخاً تنفيذية أو نظائر يشار فيها إلى المقارنة التي أجراها الرئيس وإلى تأشيره عليها.",
              "إذا كانت الوثيقة مدونة في سجل، جاز لهيئة الحكم بصفة استثنائية أن تأمر بإحضار هذا السجل وأن تستغني عن استخراج نسخة منه."
            ]
          },
          {
            "number": "580",
            "paragraphs": [
              "يحق لكل شخص حجزت عنده وثيقة معدة للمقارنة وأراد أن يعارض في تقديمها إلى المحاكم، أن يقدم طلباً بذلك إلى رئيس المحكمة المعروضة عليها القضية، ويبت الرئيس في طلبه بأمر قضائي استعجالي داخل أجل لا يتعدى ثلاثة أيام، وذلك بعد أخذ رأي النيابة العامة.",
              "يقبل القرار الصادر بموجب الفقرة الأولى أعلاه الطعن من طرف النيابة العامة أو الطرف الطالب أو دفاعه بالاستئناف داخل أجل ثلاثة أيام من تاريخ التبليغ.",
              "تبت محكمة الاستئناف في الطعن المذكور داخل أجل خمسة أيام من تاريخ إحالة الملف عليها، وذلك بموجب قرار غير قابل لأي طعن."
            ]
          },
          {
            "number": "581",
            "paragraphs": [
              "يمكن أن يطلب من المتهم أن يقدم ويرسم بيده حروفا أو علامات أو كتابة.",
              "في حالة الرفض أو الامتناع، ينص على ذلك في المحضر."
            ]
          },
          {
            "number": "582",
            "paragraphs": [
              "يجري التحقيق في التزوير المدعى به في الوثائق ويبت فيه حسب الإجراءات العادية، مع مراعاة مقتضيات المواد السابقة والمادة 564 المتعلقة بالطعن بالزور أمام محكمة النقض."
            ]
          },
          {
            "number": "583",
            "paragraphs": [
              "إذا ثبت الزور في وثيقة رسمية كلها أو بعضها، تأمر المحكمة التي بتت في دعوى الزور بحذفها أو تغييرها أو ردها إلى نصها الحقيقي، ويحرر محضر بتنفيذ هذا الحكم.",
              "ترد الوثائق المستعملة للمقارنة إلى من كان يحوزها في أجل خمسة عشر يوما على الأكثر بعد أن يصبح الحكم نهائيا."
            ]
          },
          {
            "number": "584",
            "paragraphs": [
              "إذا ادعى أحد الأطراف عرضا الزور في وثيقة وقع الإدلاء بها أثناء التحقيق أو خلال الدعوى، تعين على مدعي الزور أن يوجه للطرف الآخر إنذارا لاستفساره عما إذا كان ينوي استعمال هذه الوثيقة أم لا."
            ]
          },
          {
            "number": "585",
            "paragraphs": [
              "إذا صرح الطرف الموجه إليه الإنذار بأنه يتخلى عن استعمال الوثيقة المدعى فيها الزور، أو لم يجب بشيء داخل الثمانية أيام التي تلي الإنذار، سحبت هذه الوثيقة من الدعوى.",
              "إذا صرح الطرف الموجه إليه الإنذار بأنه ينوي استعمال الوثيقة، أجري تحقيق في دعوى الزور العارض وحكم فيها منفصلة عن الدعوى الرئيسية."
            ]
          },
          {
            "number": "581",
            "paragraphs": [
              "يمكن أن يطلب من المتهم أن يقدم ويرسم بيده حروفا أو علامات أو كتابة.",
              "في حالة الرفض أو الامتناع، ينص على ذلك في المحضر."
            ]
          },
          {
            "number": "582",
            "paragraphs": [
              "يجري التحقيق في التزوير المدعى به في الوثائق ويبت فيه حسب الإجراءات العادية، مع مراعاة مقتضيات المواد السابقة والمادة 564 المتعلقة بالطعن بالزور أمام محكمة النقض."
            ]
          },
          {
            "number": "583",
            "paragraphs": [
              "إذا ثبت الزور في وثيقة رسمية كلها أو بعضها، تأمر المحكمة التي بتت في دعوى الزور بحذفها أو تغييرها أو ردها إلى نصها الحقيقي، ويحرر محضر بتنفيذ هذا الحكم.",
              "ترد الوثائق المستعملة للمقارنة إلى من كان يحوزها في أجل خمسة عشر يوما على الأكثر بعد أن يصبح الحكم نهائيا."
            ]
          },
          {
            "number": "584",
            "paragraphs": [
              "إذا ادعى أحد الأطراف عرضا الزور في وثيقة وقع الإدلاء بها أثناء التحقيق أو خلال الدعوى، تعين على مدعي الزور أن يوجه للطرف الآخر إنذارا لاستفساره عما إذا كان ينوي استعمال هذه الوثيقة أم لا."
            ]
          },
          {
            "number": "585",
            "paragraphs": [
              "إذا صرح الطرف الموجه إليه الإنذار بأنه يتخلى عن استعمال الوثيقة المدعى فيها الزور، أو لم يجب بشيء داخل الثمانية أيام التي تلي الإنذار، سحبت هذه الوثيقة من الدعوى.",
              "إذا صرح الطرف الموجه إليه الإنذار بأنه ينوي استعمال الوثيقة، أجري تحقيق في دعوى الزور العارض وحكم فيها منفصلة عن الدعوى الرئيسية."
            ]
          },
          {
            "number": "586",
            "paragraphs": [
              "إذا زعم الطرف الذي ادعى الزور في الوثيقة أن من أدلى بها هو مرتكب الزور أو المشارك فيه، أو إذا كانت إجراءات الدعوى تسمح بمعرفة مرتكب الزور أو المشارك فيه، وكانت الدعوى العمومية لم تسقط بعد، أمكن إجراء متابعة جنائية طبقاً لمقتضيات المادة 575 وما يليها إلى المادة 583 أعلاه.",
              "إذا كان الادعاء بالزور نزاعاً عارضاً طرأ أثناء دعوى مدنية، يؤجل الحكم فيها إلى أن يبت جنائياً بشأن الزور.",
              "إذا كان الادعاء بالزور نزاعاً عارضاً طرأ أثناء دعوى جارية أمام محكمة زجرية، بتت هذه المحكمة نفسها، بعد استماعها إلى ملتمسات النيابة العامة، فيما إذا كان الأمر يقتضي تأجيل البت في الدعوى الرئيسية أم لا."
            ]
          },
          {
            "number": "587",
            "paragraphs": [
              "إذا اكتشفت محكمة أثناء البحث في نزاع، ولو كان مدنياً، علامات تكشف عن وجود زور ومن شأنها أن تسمح بمعرفة مرتكبه، تعين على رئيس المحكمة أو على ممثل النيابة العامة توجيه الوثائق إلى النيابة العامة بالمكان الذي يظهر أن الجريمة ارتكبت فيه، أو بالمكان الذي يمكن أن يلقى فيه القبض على المتهم."
            ]
          },
          {
            "number": "588",
            "paragraphs": [
              "إذا تلفت أصول مقررات قضائية أو فقدت أو ضاعت قبل تنفيذها، روعيت في شأنها المقتضيات الآتية."
            ]
          },
          {
            "number": "589",
            "paragraphs": [
              "إذا أمكن العثور على نظير أو نسخة رسمية من المقرر، فإنها تحل محل الأصل ويحتفظ بها بهذه الصفة في كتابة الضبط.",
              "يتعين لهذه الغاية على كل حائز لنظير أو نسخة رسمية، سواء كان شخصاً عمومياً أو خاصاً، أن يسلمها بأمر من رئيس المحكمة إلى كتابة الضبط، فإن امتنع عن تسليمها طوعاً، جاز أن تجرى في حقه تدابير التفتيش أو الحجز المقررة في المادة 101 وما يليها إلى المادة 104 من هذا القانون.",
              "يحق لمن كان حائزاً لنظير أو نسخة رسمية من أصل المقرر الذي تلف أو ضاع أو فقد، ولمن كان مؤتمناً عليه، أن يحصل من كتابة الضبط عند تسليم النظير أو النسخة على نظير منه أو صورة مشهود بمطابقتها للأصل معفاة من كل صائر."
            ]
          },
          {
            "number": "590",
            "paragraphs": [
              "إذا لم يعثر على أي نظير أو نسخة رسمية من المقرر، بتت المحكمة في القضية من جديد بعد أن تعاد إجراءات المسطرة إن اقتضى الحال طبقاً للمادة التالية."
            ]
          },
          {
            "number": "591",
            "paragraphs": [
              "إذا تلف ملف دعوى لم يحكم فيها نهائياً أو ضاع أو فقد، أعيد تأليفه بواسطة نظير من المحاضر المثبتة لوقوع الجريمة ومن البحث غير الرسمي ومن النسخ المنصوص عليها في المادة 85."
            ]
          }
        ]
      },
      {
        "name": "القسم الثالث",
        "title": "التحقق من الهوية",
        "articles": [
          {
            "number": "592",
            "paragraphs": [
              "إذا ادعى المتهم أمام هيئة الحكم أنه ليس الشخص المقصود بالاتهام، تعين على هذه الهيئة أن تبت في النزاع بشأن الهوية."
            ]
          },
          {
            "number": "593",
            "paragraphs": [
              "تختص المحكمة المصدرة للعقوبة وحدها بالتحقق من هوية المحكوم عليه إذا ادعى الشخص الذي يجري التنفيذ في حقه أو المقبوض عليه بعد فراره وجود خطأ في شأن هويته وأن العقوبة لا تنطبق عليه."
            ]
          },
          {
            "number": "594",
            "paragraphs": [
              "تبت المحكمة المرفوعة إليها الدعوى، تحت طائلة البطلان، بحضور الشخص الذي يزعم أنه موضوع الخطأ بعد الإنصات، عند الاقتضاء، إلى الشهود الذين استدعوا بطلب منه أو بطلب من النيابة العامة.",
              "يمكن للمحكمة أن تأمر بإجراء أي نوع من أنواع التحريات وبعرض الشخص المثير للنزاع على أي خبير، وبالأخص على المصالح المختصة المكلفة بالتحقق من الهوية."
            ]
          },
          {
            "number": "595",
            "paragraphs": [
              "تطبق كذلك مقتضيات المادتين 593 و594 أعلاه إذا تبين أن الشخص قد حكم عليه تحت اسم غير اسمه.",
              "يمكن، علاوة على ذلك، أن يتعرض هذا الشخص للعقوبات المقررة للزجر على انتحال الاسم أو انتحال الحالة المدنية."
            ]
          }
        ]
      },
      {
        "name": "القسم الرابع",
        "title": "أحكام خاصة بتمويل الإرهاب وغسل الأموال وجرائم أخرى",
        "articles": [
          {
            "number": "1-595",
            "paragraphs": [
              "يمكن للوكيل العام للملك أو لوكيل الملك، كل فيما يخصه، بمناسبة إجراء بحث قضائي، أن يطلب معلومات حول ممتلكات أو عمليات أو تحركات أموال يشتبه في أن لها علاقة بتمويل الإرهاب أو غسل الأموال أو بإحدى الجرائم الواردة في الفصل 2-574 من مجموعة القانون الجنائي، من البنوك الخاضعة لأحكام القانون رقم 103.12 المتعلق بمؤسسات الائتمان والهيئات المعتبرة في حكمها الصادر بتنفيذه الظهير الشريف رقم 1.14.193 بتاريخ فاتح ربيع الأول 1436 (24 ديسمبر 2014)، ومن البنوك الحرة التي تسري عليها أحكام القانون رقم 58.90 المتعلق بالمناطق المالية الحرة الصادر بتنفيذه الظهير الشريف رقم 1.91.131 بتاريخ 21 من شعبان 1412 (26 فبراير 1992)، ومن كل شخص أو مؤسسة أو هيئة تمسك معلومات تتعلق بأموال وممتلكات يشتبه في أن لها علاقة بالجريمة.",
              "يمكن أيضاً لقاضي التحقيق ولهيئة الحكم إذا أحيلت عليهما مسطرة لها علاقة بجريمة إرهابية أو جرائم غسل الأموال أو إحدى الجرائم المنصوص عليها في الفصل 2-574 من مجموعة القانون الجنائي طلب المعلومات المنصوص عليها في الفقرة الأولى من هذه المادة."
            ]
          },
          {
            "number": "2-595",
            "paragraphs": [
              "يمكن للسلطات القضائية المذكورة في المادة 1-595 أعلاه أن تأمر بتجميد أو حجز الأموال أو الممتلكات المشتبه في أن لها علاقة بتمويل الإرهاب أو غسل الأموال أو الجرائم المنصوص عليها في الفصل 2-574 من مجموعة القانون الجنائي.",
              "يمكن لهذه السلطات أيضاً أن تطلب مساعدة بنك المغرب لتنفيذ هذه التدابير.",
              "تبلغ السلطات المذكورة إلى بنك المغرب التدابير المتخذة وما تقرر في شأنها."
            ]
          },
          {
            "number": "3-595",
            "paragraphs": [
              "يقصد بالتجميد المنع المؤقت لنقل الممتلكات أو تبديلها أو التصرف فيها أو تحريكها أو إخضاعها للحراسة."
            ]
          },
          {
            "number": "4-595",
            "paragraphs": [
              "يجب على المؤسسات البنكية والمؤسسات والهيئات المشار إليها في المادة 1-595 أعلاه تقديم المعلومات المطلوبة منها داخل أجل أقصاه 30 يوماً من تاريخ التوصل بالطلب.",
              "لا يجوز للبنوك والمؤسسات والهيئات أن تواجه السلطات المذكورة في المادة 1-595 أعلاه أو بنك المغرب بمبدأ الحفاظ على السر المهني.",
              "لا يمكن أن يتعرض بنك المغرب أو البنوك أو المؤسسات والهيئات المشار إليها في المادة 1-595 أعلاه أو مسيروها أو المستخدمون لديها لأية متابعة على أساس الفصل 446 من القانون الجنائي، ولا أن تقام ضدهم أي دعوى للمسؤولية المدنية بسبب ممارسة الأعمال والمهام المخولة لهم في نطاق تطبيق مقتضيات هذا القسم."
            ]
          },
          {
            "number": "5-595",
            "paragraphs": [
              "يمنع استعمال المعلومات المحصل عليها لأغراض غير الأغراض المنصوص عليها في هذا القسم."
            ]
          },
          {
            "number": "6-595",
            "paragraphs": [
              "يجوز للحكومة، في إطار تطبيق الاتفاقيات الدولية في مجال مكافحة تمويل الإرهاب المنضمة إليها المملكة المغربية والمنشورة بصفة رسمية، أن تحيل، بطلب من دولة أجنبية، الطلب إلى الوكيل العام للملك لاتخاذ الإجراءات التالية:",
              "-1 البحث والتعريف فيما يتعلق بعائد إحدى جرائم تمويل الإرهاب والممتلكات التي استخدمت أو كانت معدة لاستخدامها في ارتكاب هذه الجريمة أو كل ممتلك تطابق قيمته العائد منها؛",
              "-2 تجميد الممتلكات أو حجزها؛",
              "-3 اتخاذ الإجراءات التحفظية بشأن الممتلكات المذكورة.",
              "يرفض الوكيل العام للملك الطلب إذا:",
              "- كان من شأن تنفيذه المس بسيادة الدولة أو أمنها أو مصالحها الأساسية أو النظام العام؛",
              "- صدر في شأن الأفعال المتعلق بها الطلب مقرر قضائي نهائي في التراب الوطني؛",
              "- تعلق الأمر بتنفيذ مقرر قضائي أجنبي صدر وفق شروط لا توفر ضمانات كافية لحماية حقوق الدفاع؛",
              "- كانت الأفعال المقدم على أساسها الطلب لا علاقة لها بتمويل الإرهاب."
            ]
          },
          {
            "number": "7-595",
            "paragraphs": [
              "يتوقف على ترخيص من الوكيل العام للملك، كل تنفيذ في التراب الوطني لمقرر تجميد أو حجز أو مصادرة صادر عن سلطة قضائية أجنبية وقدم في شأنه طلب من لدن السلطة المذكورة.",
              "يجب أن يتعلق قرار الترخيص بالتجميد أو بالحجز أو بالمصادرة بممتلك استخدم أو كان معداً لاستخدامه في ارتكاب الجريمة ويوجد بالتراب الوطني، أو أن يهدف إلى الإلزام بدفع مبلغ نقدي مطابق لقيمة الممتلك المذكور.",
              "يتوقف تنفيذ المقرر الأجنبي على توافر الشرطين التاليين:",
              "-1 أن يكون المقرر القضائي الأجنبي نهائياً وقابلاً للتنفيذ وفق قانون الدولة الطالبة؛",
              "-2 أن تكون الممتلكات المراد تجميدها أو حجزها أو مصادرتها عملاً بهذا المقرر قابلة للتجميد أو الحجز أو المصادرة في ظروف مماثلة حسب التشريع المغربي."
            ]
          },
          {
            "number": "8-595",
            "paragraphs": [
              "يترتب على ترخيص الوكيل العام للملك بالمصادرة، مع مراعاة حقوق الأغيار، نقل ملكية الممتلكات المصادرة إلى الدولة المغربية، ما عدا إذا تم الاتفاق على خلاف ذلك مع الدولة الطالبة أو في إطار تطبيق اتفاقية دولية مصادق عليها ومنشورة بالجريدة الرسمية أو على أساس المعاملة بالمثل.",
              "لا يترتب عن قرار الوكيل العام للملك القاضي بالترخيص بحجز الأموال أو تجميدها إلا عقل الأموال موضوع القرار ومنع التصرف فيها طيلة مدة سريان مفعول قرار الحجز أو التجميد، والذي لا يمكن أن يتجاوز في كل الأحوال ستة أشهر قابلة للتجديد مرة واحدة كحد أقصى بملتمس من الدولة الطالبة، ما لم تنص اتفاقية دولية مصادق عليها ومنشورة بالجريدة الرسمية على خلاف ذلك، ويرفع الحجز في هذه الحالة بقوة القانون."
            ]
          },
          {
            "number": "9-595",
            "paragraphs": [
              "يجب على كل الأشخاص الذين يشاركون في معالجة المعلومات المالية وفي مكافحة التحركات المرتبطة بتمويل الإرهاب، وبصفة عامة على جميع الأشخاص الذين يطلب منهم، بأي صفة من الصفات، الاطلاع على تلك المعلومات أو استغلالها، أن يتقيدوا تقيداً تاماً بكتمان السر المهني تحت طائلة العقوبة المنصوص عليها في الفصل 446 من القانون الجنائي."
            ]
          },
          {
            "number": "10-595",
            "paragraphs": [
              "يتعرض للعقوبات المنصوص عليها في الفصل 446 من مجموعة القانون الجنائي مسيرو أو مستخدمو الأبناك إذا أخبروا عمداً، بأي وسيلة كانت، الشخص المعني بالأمر أو غيره ببحث يجري بشأن تحركات أمواله بسبب الاشتباه في علاقتها بتمويل الإرهاب.",
              "يتعرض لنفس العقوبات كل من استعمل عمداً المعلومات المحصل عليها لأغراض غير الأغراض المنصوص عليها في هذا القسم."
            ]
          }
        ]
      },
      {
        "name": "القسم الخامس",
        "title": "استعمال تقنيات الاتصال عن بعد",
        "articles": [
          {
            "number": "595-11",
            "paragraphs": [
              "يمكن للنيابة العامة أو قاضي التحقيق أو المحكمة، تلقائيا أو بناء على طلب من الدفاع أو أحد الأطراف، إذا وجدت أسباب جدية وكلما اقتضت الحاجة إلى ذلك، أن تلجأ، بعد موافقة المتهم أو الشخص المراد الاستماع إليه وفقا لأحكام الفقرة الثانية أدناه، إلى مباشرة إجراءات البحث أو التحقيق أو المحاكمة عن بعد.",
              "يستفيد من إجراءات التقاضي عن بعد كل من المشتبه فيه أو المتهم أو المسؤول المدني أو الضحية أو المطالب بالحق المدني أو الشاهد أو الترجمان، وكل شخص ارتأت الهيئات القضائية فائدة في الاستماع إليه.",
              "يجب أن تضمن موافقة المتهم أو الشخص المراد الاستماع إليه عن بعد بمحضر الاستماع. ولا يمكن لمن سبق له إبداء موافقته على الاستماع إليه عن بعد التراجع عن هذه الموافقة أو الاعتراض عليها أمام الهيئة التي قررت اللجوء إلى هذه المسطرة أثناء بتها في القضية، ما لم تقرر الهيئة حضوره لضمان حسن سير إجراءات المحاكمة أو بناء على طلبه أو طلب دفاعه.",
              "يتمتع الأطراف المستمع إليهم بواسطة هذه التقنيات بالضمانات الممنوحة لهم قانونا، وتسري عليهم نفس القواعد المنظمة لحضورهم الشخصي وتترتب عنها نفس الآثار.",
              "تسهر المحكمة على ضمان جودة البت وسرية تواصل المتهم مع دفاعه، ولها أن تؤجل الجلسة حال تعذر إجراء التقاضي عن بعد لأي سبب كان."
            ]
          },
          {
            "number": "12-595",
            "paragraphs": [
              "يمكن للنيابة العامة أو قاضي التحقيق أو المحكمة اللجوء إلى مسطرة الاستماع أو الاستنطاق أو المواجهة مع الغير وفق الضوابط المقررة في المادة 11-595 أعلاه.",
              "يباشر الإجراء مع الأشخاص المعنيين بالأمر مباشرة في المكان المهيأ لهذه الغاية والمجهز بالوسائل التقنية اللازمة.",
              "إذا تعلق الأمر بشخص معتقل، فإنه يمكن للنيابة العامة أو لقاضي التحقيق أو المحكمة استنطاقه أو الاستماع إليه أو مواجهته مع الغير باستعمال تقنية الاتصال عن بعد بكيفية تضمن سرية البث.",
              "إذا كان الشخص مؤازرا بمحام، فيمكن لهذا الأخير الحضور إلى جانب القاضي في المكان الذي يجري فيه التحقيق أو الاستماع أو المواجهة، أو الحضور إلى جانب مؤازره بالمؤسسة السجنية.",
              "يحرر محضر بعملية الاستماع أو الاستنطاق أو المواجهة وفق الشكليات المنصوص عليها في هذا القانون، وتفرغ العملية في محضر توقعه الجهة القضائية التي باشرت الإجراء، ويضم إلى أصل الملف بعد تلاوته على الشخص المعني مع الإشارة إلى ذلك بالمحضر.",
              "يمكن أن تكون العمليات المنجزة موضوع تسجيل سمعي وبصري."
            ]
          },
          {
            "number": "13-595",
            "paragraphs": [
              "يمكن للنيابة العامة أو قاضي التحقيق أو المحكمة، وفق الضوابط المحددة في المادة 11-595 أعلاه، إذا تعلق الأمر بشخص يتواجد خارج دائرة نفوذها، توجيه إنابة قضائية إلى الجهة القضائية المختصة بالمحكمة التي يتواجد بها المعني بالأمر قصد الاستماع إليه أو استنطاقه أو إجراء مواجهة معه عبر تقنيات الاتصال عن بعد، يبين فيها هوية الشخص أو الأشخاص موضوع هذا الإجراء وتحدد فيها المهمة المطلوبة وتاريخ وساعة إنجازها.",
              "تستدعي الجهة القضائية المنابة الشخص أو الأشخاص في التاريخ المحدد إلى مكتب أو قاعة مجهزة بتقنيات الاتصال عن بعد.",
              "يتم الاستماع إلى الشخص أو الأشخاص أو استنطاقهم أو مواجهتهم مع الغير بحضور كاتب ضبط يكلف من الجهة القضائية المنابة.",
              "يحرر كاتب الضبط محضرا يبين فيه الإجراءات المطلوبة وتاريخ وساعة بدايتها ونهايتها، والمكان الذي أنجزت فيه، والتقنية المستعملة فيها، والأحداث التي قد تقع بمكان الاستماع، دون أن يضمن فيه محتوى الاستماع أو الاستنطاق أو المواجهة الذي تتولى تضمينه الجهة القضائية المنيبة.",
              "يوقع الشخص الذي تم الاستماع إليه على المحضر إلى جانب كاتب الضبط، أو يشار إلى رفضه التوقيع أو إلى استحالة ذلك.",
              "تحيل الجهة القضائية المنابة فورا نسخة من المحضر إلى الجهة القضائية المنيبة لإضافته إلى الملف، ويحتفظ بأصل المحضر في ملف خاص.",
              "إذا كان الشخص مؤازرا بمحام، فيمكن لهذا الأخير الحضور إلى جانب مؤازره بالمكان الذي يجري فيه تنفيذ الإنابة أو إلى جانب كاتب الضبط المكلف من الجهة القضائية المنابة.",
              "تقوم الجهة القضائية المصدرة للإنابة بتلاوة المحضر المنجز للعملية على المعني بالأمر وتشير إلى ذلك في المحضر، ويمكن أن يكون هذا الأخير موضوع تسجيل سمعي وبصري."
            ]
          },
          {
            "number": "14-595",
            "paragraphs": [
              "يمكن، في إطار تنفيذ إنابة قضائية دولية، الإذن لمحكمة أجنبية، وفق الكيفيات المنصوص عليها في المادة 715 من هذا القانون، بالاستماع إلى شخص أو أكثر، إذا كان موجودا بالمغرب ووافق صراحة على قبول هذا الطلب.",
              "يتولى القاضي المعين من قبل رئيس المحكمة الموجهة إليها الإنابة الإشراف على العملية وضبط نظامها، وعليه أن يحرر بعد التأكد من هوية الأطراف محضرا يبين فيه نوع الإجراء المنجز وسند تنفيذه وتاريخ وساعة بدايته ونهايته، والأشخاص الذين شاركوا فيه، والوقائع والأحداث التي قد تقع بالمكان الذي ينجز به الإجراء.",
              "إذا كانت المناقشات تجري بغير اللغة العربية، فيجب حضور مترجم، حتى وإن كان الشخص أو الأشخاص يحسنون اللغة التي تستعملها المحكمة الأجنبية.",
              "يمكن للقاضي الوطني المشرف على تنفيذ الإنابة تلقائيا أو بناء على طلب من ممثل النيابة العامة الذي يحضر معه أن يعترض على طرح بعض الأسئلة إذا كان من شأنها المساس بمصالح المغرب الأساسية أو بثوابته، أو تتعلق بسر من أسرار الدفاع الوطني.",
              "يمكن للقاضي الوطني الأمر بإيقاف تنفيذ الإنابة في حالة إصرار المحكمة الأجنبية على طرح السؤال المعترض عليه.",
              "يحرر محضر بالعملية، ويمكن أن تكون موضوع تسجيل سمعي وبصري."
            ]
          },
          {
            "number": "15-595",
            "paragraphs": [
              "لا يسمح للمحكمة الأجنبية بطرح الأسئلة مباشرة على الشخص أو الأشخاص المستمع إليهم بالمغرب إلا إذا كان تشريع الدولة يسمح بنفس المعاملة إذا صدر الطلب من المغرب، أو إذا قدمت التزاما بالمعاملة بالمثل.",
              "إذا لم يكن قانون الدولة يسمح بطرح الأسئلة مباشرة وتعذر تقديم التزام بالمعاملة بالمثل، فإنه يمكن طرح الأسئلة بواسطة القاضي المغربي.",
              "يتمتع الشخص أو الأشخاص المستمع إليهم بحقوق الدفاع المخولة لهم بمقتضى القانون المغربي أو القانون الأجنبي فيما لا يتعارض مع التشريع الوطني.",
              "يتم الاتفاق مسبقا على الإجراءات التقنية والمسطرة المتبعة وفق طرق الاتصال المستعملة بين الدولتين في إطار التعاون القضائي الدولي."
            ]
          },
          {
            "number": "16-595",
            "paragraphs": [
              "يمكن للقضاة المغاربة أن يباشروا الاستماع إلى الأشخاص الموجودين خارج المغرب أو استنطاقهم أو مواجهتهم مع الغير أو تلقي تصريحاتهم عن طريق تقنيات الاتصال عن بعد وفق مقتضيات المادة 714 من هذا القانون، مع مراعاة الاتفاقيات الدولية والقوانين الداخلية للدول التي يطلب القيام بالإجراء بإقليمها."
            ]
          },
          {
            "number": "17-595",
            "paragraphs": [
              "يمكن أن تذيل الأحكام والقرارات والأوامر القضائية بالتوقيع الإلكتروني أو الرقمي لكل من الرئيس وكاتب الضبط."
            ]
          }
        ]
      }
    ]
  }