{
  "name": "الكتاب الثاني",
  "title": "في تطبيق العقوبات والتدابير الوقائية على المجرم",
  "sections": [
    {
      "name": "الجزء الأول",
      "title": "في الجريمة",
      "chapters": [
        {
          "name": "الباب الأول",
          "title": "في أنواع الجرائم",
          "articles": [
            {
              "number": "110",
              "paragraphs": [
                "الجريمة هي فعل أو امتناع مخالف للقانون الجنائي ومعاقب عليه بمقتضاه."
              ]
            },
            {
              "number": "111",
              "paragraphs": [
                "الجرائم إما جنايات أو جنح تأديبية أو جنح ضبطية أو مخالفات، على التفصيل الآتي:",
                "الجريمة التي تدخل عقوبتها ضمن العقوبات المنصوص عليها في الفصل 16 تعد جناية.",
                "الجريمة التي يعاقب عليها القانون بالحبس الذي يزيد حده الأقصى عن سنتين تعد جنحة تأديبية.",
                "الجريمة التي يعاقب عليها القانون بحبس حده الأقصى سنتان أو أقل أو بغرامة تزيد عن مائتي درهم تعد جنحة ضبطية.",
                "الجريمة التي يعاقب عليها القانون بإحدى العقوبات المنصوص عليها في الفصل 18 تعد مخالفة."
              ]
            },
            {
              "number": "112",
              "paragraphs": [
                "لا يتغير نوع الجريمة إذا حكم بعقوبة متعلقة بنوع آخر من أنواع الجرائم لسبب تخفيف أو لحالة العود."
              ]
            },
            {
              "number": "113",
              "paragraphs": [
                "يتغير نوع الجريمة إذا نص القانون على عقوبة متعلقة بنوع آخر من أنواع الجرائم لسبب ظروف التشديد."
              ]
            }
          ]
        },
        {
          "name": "الباب الثاني",
          "title": "في المحاولة",
          "articles": [
            {
              "number": "114",
              "paragraphs": [
                "كل محاولة ارتكاب جناية بدئت بالشروع في تنفيذها أو بأعمال لا لبس فيها، تهدف مباشرة إلى ارتكابها، إذا لم يوقف تنفيذها أو لم يحصل الأثر، تعتبر كالجناية التامة ويعاقب مرتكبها عليها بهذه الصفة، إلا لظروف خارجة عن إرادة مرتكبها."
              ]
            },
            {
              "number": "115",
              "paragraphs": [
                "لا يعاقب على محاولة الجنحة إلا بمقتضى نص خاص في القانون."
              ]
            },
            {
              "number": "116",
              "paragraphs": ["محاولة المخالفة لا يعاقب عليها مطلقا."]
            },
            {
              "number": "117",
              "paragraphs": [
                "يعاقب على المحاولة حتى في الأحوال التي يكون الغرض فيها من الجريمة غير ممكن بسبب ظروف واقعية يجهلها الفاعل."
              ]
            }
          ]
        },
        {
          "name": "الباب الثالث",
          "title": "في تعدد الجرائم",
          "articles": [
            {
              "number": "118",
              "paragraphs": [
                "الفعل الواحد الذي يقبل أوصافا متعددة يجب أن يوصف بأشدها."
              ]
            },
            {
              "number": "119",
              "paragraphs": [
                "تعدد الجرائم هو حالة ارتكاب شخص جرائم متعددة في آن واحد أو في أوقات متوالية دون أن يفصل بينها حكم غير قابل للطعن."
              ]
            },
            {
              "number": "120",
              "paragraphs": [
                "في حالة تعدد جنايات أو جنح إذا نظرت في وقت واحد أمام محكمة واحدة، يحكم بعقوبة واحدة سالبة للحرية لا تتجاوز مدتها الحد الأقصى المقرر قانونا لمعاقبة الجريمة الأشد.",
                "أما إذا صدر بشأنها عدة أحكام سالبة للحرية بسبب تعدد المتابعات، فإن العقوبة الأشد هي التي تنفذ.",
                "غير أن العقوبات المحكوم بها، إذا كانت من نوع واحد، جاز للقاضي، بقرار معلل، أن يأمر بضمها كلها أو بعضها بشرط ألا تتجاوز الحد الأقصى المقرر في القانون للجريمة الأشد."
              ]
            },
            {
              "number": "121",
              "paragraphs": [
                "تضم العقوبات المالية سواء كانت أصلية أو مضافة إلى عقوبة سالبة للحرية، إلا إذا قرر الحكم خلاف ذلك بعبارة صريحة."
              ]
            },
            {
              "number": "122",
              "paragraphs": [
                "في حالة تعدد الجنايات أو الجنح، تضم العقوبات الإضافية وتدابير الوقاية، ما لم يقرر الحكم خلاف ذلك بنص معلل.",
                "إلا أن التدابير الوقائية التي لا تقبل بطبيعتها أن تنفذ معا في نفس الوقت يراعى في ترتيب تنفيذها مقتضيات الفصل 91."
              ]
            },
            {
              "number": "123",
              "paragraphs": ["ضم العقوبات لزومي دائما في المخالفات."]
            }
          ]
        },
        {
          "name": "الباب الرابع",
          "title": "في الأسباب المبررة التي تمحو الجريمة",
          "articles": [
            {
              "number": "124",
              "paragraphs": [
                "لا جناية ولا جنحة ولا مخالفة في الأحوال الآتية:",
                "إذا كان الفعل قد أوجبه القانون وأمرت به السلطة الشرعية؛",
                "إذا اضطر الفاعل ماديا إلى ارتكاب الجريمة، أو كان في حالة استحال عليه معها، استحالة مادية، اجتنابها، وذلك لسبب خارجي لم يستطع مقاومته؛",
                "إذا كانت الجريمة قد استلزمتها ضرورة حالة للدفاع الشرعي عن نفس الفاعل أو غيره أو عن ماله أو مال غيره، بشرط أن يكون الدفاع متناسبا مع خطورة الاعتداء."
              ]
            },
            {
              "number": "125",
              "paragraphs": [
                "تعتبر الجريمة نتيجة الضرورة الحالة للدفاع الشرعي في الحالتين الآتيتين:",
                "القتل أو الجرح أو الضرب الذي يرتكب ليلا لدفع تسلق أو كسر حاجز أو حائط أو مدخل دار أو منزل مسكون أو ملحقاتهما؛",
                "الجريمة التي ترتكب دفاعا عن نفس الفاعل أو نفس غيره ضد مرتكب السرقة أو النهب بالقوة."
              ]
            }
          ]
        }
      ]
    },
    {
      "name": "الجزء الثاني",
      "title": "في المجرم",
      "articles": [
        {
          "number": "126",
          "paragraphs": [
            "تطبق العقوبات والتدابير الوقائية المقررة في هذه المجموعة على الأشخاص الذاتيين."
          ]
        },
        {
          "number": "127",
          "paragraphs": [
            "لا يمكن أن يحكم على الأشخاص المعنوية إلا بالعقوبات المالية والعقوبات الإضافية الواردة في الأرقام 5 و6 و7 من الفصل 36، ويجوز أيضا أن يحكم عليها بالتدابير الوقائية العينية الواردة في الفصل 62."
          ]
        }
      ],
      "chapters": [
        {
          "name": "الباب الأول",
          "title": "في المساهمة في الجريمة والمشاركة فيها",
          "articles": [
            {
              "number": "128",
              "paragraphs": [
                "يعتبر مساهما في الجريمة كل من ارتكب شخصيا عملا من أعمال التنفيذ المادي لها."
              ]
            },
            {
              "number": "129",
              "paragraphs": [
                "يعتبر مشاركا في الجناية أو الجنحة من لم يساهم مباشرة في تنفيذها ولكنه أتى أحد الأفعال الآتية:",
                "أمر بارتكاب الفعل أو حرض على ارتكابه، وذلك بهبة أو وعد أو تهديد أو إساءة استغلال سلطة أو ولاية أو تحايل أو تدليس إجرامي؛",
                "قدم أسلحة أو أدوات أو أية وسيلة أخرى استعملت في ارتكاب الفعل، مع علمه بأنها ستستعمل لذلك؛",
                "ساعد أو أعان الفاعل أو الفاعلين للجريمة في الأعمال التحضيرية أو الأعمال المسهلة لارتكابها، مع علمه بذلك؛",
                "تعود على تقديم مسكن أو ملجأ أكثر من مرة للأشرار الذين يمارسون اللصوصية أو مكان للاجتماع، لواحد أو أكثر، أو العنف ضد أمن الدولة أو الأمن العام أو ضد الأشخاص أو الأموال مع علمه بسلوكهم الإجرامي.",
                "أما المشاركة في المخالفات فلا عقاب عليها مطلقا."
              ]
            },
            {
              "number": "130",
              "paragraphs": [
                "المشارك في جناية أو جنحة يعاقب بالعقوبة المقررة لهذه الجناية أو الجنحة.",
                "ولا تؤثر الظروف الشخصية التي ينتج عنها تشديد أو تخفيف أو إعفاء من العقوبة إلا بالنسبة لمن تتوفر فيه.",
                "أما الظروف العينية المتعلقة بالجريمة، والتي تغلظ العقوبة أو تخفضها، فإنها تنتج مفعولها بالنسبة لجميع المساهمين أو المشاركين في الجريمة ولو كانوا يجهلونها."
              ]
            },
            {
              "number": "131",
              "paragraphs": [
                "من حمل شخصا غير معاقب، بسبب ظروفه أو صفته الشخصية، على ارتكاب جريمة، فإنه يعاقب بعقوبة الجريمة التي ارتكبها هذا الشخص."
              ]
            }
          ]
        },
        {
          "name": "الباب الثاني",
          "title": "في المسؤولية الجنائية",
          "branches": [
            {
              "name": "الفرع الأول",
              "title": "في الأشخاص المسؤولين",
              "articles": [
                {
                  "number": "132",
                  "paragraphs": [
                    "متى يكون مسؤولا شخصيا عن:",
                    "كل شخص سليم العقل قادر على التمييز يكون مسؤولا شخصيا عن الجرائم التي يرتكبها.",
                    "الجنايات أو الجنح التي يكون مشاركا في ارتكابها.",
                    "محاولات الجنايات.",
                    "محاولات بعض الجنح ضمن الشروط المقررة في القانون للعقاب عليها.",
                    "ولا يستثنى من هذا المبدأ إلا الحالات التي ينص فيها القانون صراحة على خلاف ذلك."
                  ]
                },
                {
                  "number": "133",
                  "paragraphs": [
                    "الجنايات والجنح لا يعاقب عليها إلا إذا ارتكبت عمدا.",
                    "إلا أن الجنح التي ترتكب خطأ يعاقب عليها بصفة استثنائية في الحالات الخاصة التي ينص عليها القانون.",
                    "أما المخالفات فيعاقب عليها حتى ولو ارتكبت خطأ، فيما عدا الحالات التي يستلزم فيها القانون صراحة قصد الإضرار."
                  ]
                }
              ]
            },
            {
              "name": "الفرع الثاني",
              "title": "في العاهات العقلية",
              "articles": [
                {
                  "number": "134",
                  "paragraphs": [
                    "لا يكون مسؤولا، ويجب الحكم بإعفائه، من كان وقت ارتكابه الجريمة المنسوبة إليه، في حالة يستحيل عليه معها الإدراك أو الإرادة نتيجة خلل في قواه العقلية.",
                    "وفي الجنايات والجنح، يحكم بالإيداع القضائي في مؤسسة لعلاج الأمراض العقلية وفق الشروط المقررة في الفصل 76.",
                    "أما في مواد المخالفات، فإن الشخص الذي يحكم بإعفائه إذا كان خطرا على النظام العام يسلم إلى السلطة الإدارية."
                  ]
                },
                {
                  "number": "135",
                  "paragraphs": [
                    "تكون مسؤولية الشخص منقوصة إذا كان وقت ارتكابه الجريمة مصابا بضعف في قواه العقلية من شأنه أن ينقص إدراكه أو إرادته ويؤدي إلى تنقيص مسؤوليته جزئيا.",
                    "وفي الجنايات والجنح، تطبق على الجاني العقوبات أو التدابير الوقائية المقررة في الفصل 78.",
                    "أما في المخالفات، فتطبق العقوبات مع مراعاة حالة المهتم العقلية."
                  ]
                },
                {
                  "number": "136",
                  "paragraphs": [
                    "إذا رأى قاضي التحقيق أن المهتم تظهر عليه علامات واضحة للخلل العقلي، فإنه يجوز له، بمقتضى أمر معلل، أن يأمر بوضعه مؤقتا في مؤسسة لعلاج الأمراض العقلية من أجل ملاحظته وعلاجه إذا اقتضى الأمر، وذلك ضمن الشروط المقررة في الظهير رقم 1.58.295 الصادر في 21 شوال 1378 (30 أبريل 1959) الخاص بالوقاية والعلاج من الأمراض العقلية وحماية المصابين بها.",
                    "ويجب إخطار رئيس النيابة العمومية بمحكمة الاستئناف من طرف الطبيب المعالج بقرار إخراجه قبل تنفيذ ذلك القرار بعشرة أيام على الأقل.",
                    "ويجوز لرئيس النيابة أن يطعن في هذا القرار وفق الشروط المقررة في الفصل 28 من الظهير المشار إليه، ويترتب على الطعن وقف تنفيذ القرار.",
                    "وفي حالة استئناف المتابعة وصدور حكم على المهتم بعقوبة سالبة للحرية، فإن محكمة الموضوع يجوز لها أن تأمر بخصم المدة التي قضاها في المؤسسة من مدة تلك العقوبة."
                  ]
                },
                {
                  "number": "137",
                  "paragraphs": [
                    "السكر وحالات الانفعال أو الاندفاع العاطفي أو الناشئ عن تعاطي المواد المخدرة عمدا لا يمكن بأي حال من الأحوال أن يعدم المسؤولية أو ينقصها.",
                    "ويجوز وضع المجرم في مؤسسة علاجية طبقا لأحكام الفصلين 80 و82."
                  ]
                }
              ]
            },
            {
              "name": "الفرع الثالث",
              "title": "في مسؤولية القاصر جنائيا",
              "articles": [
                {
                  "number": "138",
                  "paragraphs": [
                    "الحدث الذي لم يبلغ سن اثنتي عشرة سنة كاملة يعتبر غير مسؤول جنائيا لانعدام تمييزه.",
                    "لا يجوز الحكم عليه إلا طبقا للمقتضيات المقررة في الكتاب الثالث من القانون المتعلق بالمسطرة الجنائية."
                  ]
                },
                {
                  "number": "139",
                  "paragraphs": [
                    "الحدث الذي أتم اثنتي عشرة سنة ولم يبلغ الثامنة عشرة يعتبر مسؤولا مسؤولية جنائية ناقصة بسبب عدم اكتمال تمييزه.",
                    "يتمتع الحدث في الحالة المذكورة في الفقرة الأولى من هذا الفصل بعذر صغر السن ولا يجوز الحكم عليه إلا طبقا للمقتضيات المقررة في الكتاب الثالث من القانون المتعلق بالمسطرة الجنائية."
                  ]
                },
                {
                  "number": "140",
                  "paragraphs": [
                    "يعتبر كامل المسؤولية الجنائية كل شخص بلغ سن الرشد بإتمام ثمان عشرة سنة ميلادية كاملة."
                  ]
                }
              ]
            }
          ]
        },
        {
          "name": "الباب الثالث",
          "title": "في تفريد العقاب",
          "chapters": [
            {
              "number": "141",
              "paragraphs": [
                "للقاضي سلطة تقديرية في تحديد العقوبة وتفريدها، في نطاق الحدين الأدنى والأقصى المقررين في القانون المعاقب على الجريمة، مراعيا في ذلك خطورة الجريمة المرتكبة من ناحية، وشخصية المجرم من ناحية أخرى."
              ]
            },
            {
              "number": "142",
              "paragraphs": [
                "يتعين على القاضي أن يطبق على المؤاخذ عقوبة مخففة أو مشددة، حسب الأحوال، كلما ثبت لديه واحد أو أكثر من الأعذار القانونية المخففة أو واحد أو أكثر من الظروف المشددة المقررة في القانون.",
                "ويتعين عليه أن يحكم بالإعفاء، عندما يقوم الدليل على أنه يوجد، لصالح المهتم، عذر مانع من العقاب مقرر في القانون.",
                "وللقاضي أن يمنح المؤاخذ ظروف التخفيف، طبق الشروط المقررة في الفصول 146 إلى 151، ما لم يوجد نص خاص في القانون يمنع ذلك."
              ]
            }
          ],
          "branches": [
            {
              "name": "الفرع الأول",
              "title": "في الأعذار القانونية",
              "articles": [
                {
                  "number": "143",
                  "paragraphs": [
                    "الأعذار هي حالات محددة في القانون على سبيل الحصر، يترتب عليها، مع ثبوت الجريمة وقيام المسؤولية، أن يتمتع المجرم إما بعدم العقاب إذا كانت أعذارا معفية، أو بتخفيض العقوبة إذا كانت أعذارا مخففة."
                  ]
                },
                {
                  "number": "144",
                  "paragraphs": [
                    "الأعذار القانونية مخصصة، لا تنطبق إلا على جريمة أو جرائم معينة، وهي مقررة في الكتاب الثالث من هذا القانون المتعلق بمختلف الجرائم."
                  ]
                },
                {
                  "number": "145",
                  "paragraphs": [
                    "يترتب على الأعذار المعفية منح المؤاخذ الإعفاء المانع من العقاب، غير أن القاضي يبقى له الحق في أن يحكم على المعفى بتدابير الوقاية الشخصية أو العينية ما عدا الإقصاء."
                  ]
                }
              ]
            },
            {
              "name": "الفرع الثاني",
              "title": "الظروف القضائية المخففة",
              "articles": [
                {
                  "number": "146",
                  "paragraphs": [
                    "إذا تبين للمحكمة الزجرية، بعد انتهاء المرافعة في القضية المطروحة عليها، أن الجزاء المقرر للجريمة في القانون قاس بالنسبة لخطورة الأفعال المرتكبة، أو بالنسبة لدرجة إجرام المهتم، فإنها تستطيع أن تمنحه ظروف التخفيف، إلا إذا وجد نص قانوني يمنع ذلك.",
                    "ومنح الظروف المخففة موكول إلى تقدير القاضي، مع التزامه بتعليل قراره في هذا الصدد بوجه خاص، وأثر تمتعه بها.",
                    "الظروف المخففة شخصية محضة، فلا تخفف العقوبة إلا فيما يخص المحكوم عليه الذي منحت له.",
                    "ومنح الظروف المخففة ينتج عنه تخفيف العقوبات المطبقة، ضمن الشروط المقررة في الفصول التالية."
                  ]
                },
                {
                  "number": "147",
                  "paragraphs": [
                    "إذا كانت العقوبة المقررة في القانون هي الإعدام، فإن محكمة الجنايات تطبق عقوبة السجن المؤبد أو السجن من عشرين إلى ثلاثين سنة.",
                    "إذا كانت العقوبة المقررة هي السجن المؤبد، فإنها تطبق عقوبة السجن من عشر إلى ثلاثين سنة.",
                    "إذا كان الحد الأدنى للعقوبة المقررة هو عشر سنوات سجنا، فإنها تطبق السجن من خمس إلى عشر سنوات، أو عقوبة الحبس من سنتين إلى خمس سنوات.",
                    "إذا كان الحد الأدنى للعقوبة المقررة هو خمس سنوات سجنا، فإنها تطبق عقوبة الحبس من سنة إلى خمس سنوات.",
                    "إذا كانت العقوبة المقررة هي السجن من خمس إلى عشر سنوات، فإنها تطبق عقوبة الحبس من سنة إلى خمس سنوات.",
                    "إذا كانت العقوبة الجنائية المقررة مصحوبة بغرامة، فإن محكمة الجنايات يجوز لها أن تخفض الغرامة إلى مائة وعشرين درهما، أو أن تحذفها.",
                    "في الحالة التي تحكم فيها محكمة الجنايات بعقوبة الحبس عوضا عن إحدى العقوبات الجنائية، فإنه يجوز لها أن تحكم علاوة على ذلك بغرامة من مائة وعشرين إلى ألف ومائتي درهم، وبالمنع من الإقامة والحرمان من الحقوق المشار إليها في الفقرتين الأولى والثانية من الفصل 26 لمدة تتراوح بين خمس وعشر سنوات."
                  ]
                },
                {
                  "number": "148",
                  "paragraphs": [
                    "إذا كانت العقوبة المقررة في القانون هي الإقامة الجبرية، فإن القاضي يحكم بالتجريد من الحقوق الوطنية أو بالحبس من ستة أشهر إلى سنتين.",
                    "إذا كانت العقوبة المقررة هي التجريد من الحقوق الوطنية، يحكم القاضي إما بعقوبة الحبس من ستة أشهر إلى سنتين أو بالحرمان من بعض الحقوق المشار إليها في الفصل 26."
                  ]
                },
                {
                  "number": "149",
                  "paragraphs": [
                    "في الجنح التأديبية، بما في ذلك حالة العود، يستطيع القاضي، في غير الأحوال التي ينص فيها القانون على خلاف ذلك، إذا كانت العقوبة المقررة هي الحبس والغرامة أو إحدى هاتين العقوبتين فقط، وثبت لديه توفر الظروف المخففة، أن ينزل بالعقوبة عن الحد الأدنى المقرر في القانون، دون أن ينقص الحبس عن شهر واحد والغرامة عن مائة وعشرين درهما."
                  ]
                },
                {
                  "number": "150",
                  "paragraphs": [
                    "في الجنح الضبطية، بما في ذلك حالة العود، يستطيع القاضي، في غير الأحوال التي ينص فيها القانون على خلاف ذلك، إذا ثبت لديه توفر الظروف المخففة، وكانت العقوبة المقررة هي الحبس والغرامة أو إحدى هاتين العقوبتين فقط، أن ينزل بالعقوبة عن الحد الأدنى المقرر في القانون دون أن ينقص الحبس عن ستة أيام والغرامة عن اثني عشر درهما.",
                    "ويجوز له أيضا أن يحكم بإحدى العقوبتين فقط، كما يجوز له أن يحكم بالغرامة عوضا عن الحبس، على ألا تقل الغرامة في أي حال عن الحد الأدنى المقرر في المخالفات.",
                    "وفي حالة الحكم بالغرامة عوضا عن الحبس إذا كانت العقوبة المقررة في القانون هي الحبس وحده، فإن الحد الأقصى لهذه الغرامة يمكن أن يصل إلى خمسة آلاف درهم."
                  ]
                },
                {
                  "number": "151",
                  "paragraphs": [
                    "في المخالفات، بما في ذلك حالة العود، يستطيع القاضي، إذا ثبت لديه توفر الظروف المخففة، أن ينزل بعقوبة الاعتقال والغرامة إلى الحد الأدنى لعقوبة المخالفات المقررة في هذا القانون.",
                    "ويجوز له أن يحكم بالغرامة عوضا عن الاعتقال، في الحالة التي يكون فيها الاعتقال مقررا في القانون."
                  ]
                }
              ]
            },
            {
              "name": "الفرع الثالث",
              "title": "في الظروف المشددة",
              "articles": [
                {
                  "number": "152",
                  "paragraphs": [
                    "تشديد العقوبة المقررة في القانون، بالنسبة لبعض الجرائم، ينتج عن ظروف متعلقة بارتكاب الجريمة أو بإجرام المهتم."
                  ]
                },
                {
                  "number": "153",
                  "paragraphs": [
                    "يحدد القانون ظروف التشديد المتعلقة بجنايات أو جنح معينة."
                  ]
                }
              ]
            },
            {
              "name": "الفرع الرابع",
              "title": "في العود",
              "articles": [
                {
                  "number": "154",
                  "paragraphs": [
                    "يعتبر في حالة عود، طبقا للشروط المقررة في الفصول التالية، من يرتكب جريمة بعد أن حكم عليه بحكم حائز لقوة الشيء المحكوم به، من أجل جريمة سابقة."
                  ]
                },
                {
                  "number": "155",
                  "paragraphs": [
                    "من سبق الحكم عليه بعقوبة جنائية، بحكم حائز لقوة الشيء المحكوم به، ثم ارتكب جناية ثانية من أي نوع كان، يعاقب حسب التفصيل الآتي:",
                    "بالإقامة الجبرية مدة لا تتجاوز عشر سنوات، إذا كانت العقوبة المقررة قانونا للجناية الثانية هي التجريد من الحقوق الوطنية.",
                    "بالسجن من خمس إلى عشر سنوات، إذا كانت العقوبة المقررة قانونا للجناية الثانية هي الإقامة الجبرية.",
                    "بالسجن من عشر إلى عشرين سنة، إذا كانت العقوبة المقررة قانونا للجناية الثانية هي السجن من خمس سنوات إلى عشر.",
                    "بالسجن من عشرين إلى ثلاثين سنة، إذا كان الحد الأقصى للعقوبة المقررة قانونا للجناية الثانية هو عشرون سنة سجنا.",
                    "بالسجن المؤبد، إذا كان الحد الأقصى للعقوبة المقررة قانونا للجناية الثانية هو ثلاثون سنة سجنا.",
                    "بالإعدام، إذا كانت الجناية الأولى قد عوقب عليها بالسجن المؤبد، وكانت العقوبة المقررة قانونا للجناية الثانية هي أيضا السجن المؤبد."
                  ]
                },
                {
                  "number": "156",
                  "paragraphs": [
                    "من سبق الحكم عليه من أجل جناية بعقوبة تزيد عن الحبس لمدة سنة، بحكم حائز لقوة الشيء المحكوم فيه، ثم ارتكب، قبل مضي خمس سنوات من تمام تنفيذ تلك العقوبة أو تقادمها، جناية أو جنحة يعاقب عليها القانون بالحبس، يجب أن يحكم عليه بالحد الأقصى لتلك العقوبة، ويجوز أن تبلغ العقوبة إلى ضعفه.",
                    "ويجوز علاوة على ذلك أن يحكم بالمنع من الإقامة من خمس سنوات إلى عشر."
                  ]
                },
                {
                  "number": "157",
                  "paragraphs": [
                    "من سبق الحكم عليه من أجل جنحة بعقوبة الحبس، بحكم حائز لقوة الشيء المحكوم فيه، ثم ارتكب جنحة مماثلة قبل مضي خمس سنوات من تمام تنفيذ تلك العقوبة أو تقادمها، يجب الحكم عليه بعقوبة الحبس الذي لا يتجاوز ضعف الحد الأقصى للعقوبة المقررة قانونا للجنحة الثانية."
                  ]
                },
                {
                  "number": "158",
                  "paragraphs": [
                    "تعد جنحا مماثلة، لتقرير حالة العود، الجرائم المجموعة في كل فقرة من الفقرات التالية:",
                    "إصدار شيك بدون رصيد والتزوير واستعمال الأوراق المزورة والتفالس بالتدليس؛",
                    "السرقة والنصب وخيانة الأمانة وخيانة التوقيع على بياض وإخفاء الأشياء المتحصلة من جناية أو جنحة؛",
                    "القتل خطأ والإصابة خطأ وجنحة الهروب عقب ارتكاب الحادث؛",
                    "هتك العرض بدون عنف والإخلال العلني بالحياء واعتياد التحريض على الفساد والمساعدة على البغاء؛",
                    "العصيان والعنف والإهانة تجاه رجال القضاء والأعضاء المحلفين أو رجال القوة العمومية؛",
                    "كل الجنح التي يرتكبها زوج في حق الزوج الآخر؛",
                    "كل الجنح المرتكبة في حق الأطفال الذين لم يتموا ثمان عشرة سنة ميلادية كاملة.",
                    "وفي الأحوال التي يحيل فيها أحد فصول هذا القانون لتحديد عقوبة جنحة على فصل آخر يعاقب على جنحة أخرى، فإن هاتين الجنحتين المماثلتين من حيث العقوبة تكونان مماثلتين لتقرير العود."
                  ]
                },
                {
                  "number": "159",
                  "paragraphs": [
                    "من سبق الحكم عليه من أجل مخالفة، ثم ارتكب نفس المخالفة خلال فترة اثني عشر شهرا من النطق بحكم الإدانة الذي صار حائزا لقوة الشيء المحكوم به، يعاقب بعقوبات العود المشددة في المخالفات طبق مقتضيات الفصل 611."
                  ]
                },
                {
                  "number": "160",
                  "paragraphs": [
                    "من سبق الحكم عليه من محكمة عسكرية، وارتكب بعد ذلك جناية أو جنحة لا يعتبر عائدا إلا إذا كان الحكم الصادر ضده من المحكمة العسكرية من أجل جناية أو جنحة تعاقب عليها القوانين الجنائية العادية."
                  ]
                }
              ]
            },
            {
              "name": "الفرع الخامس",
              "title": "في اجتماع أسباب التخفيف والتشديد",
              "articles": [
                {
                  "number": "161",
                  "paragraphs": [
                    "في حالة اجتماع أسباب التخفيف وأسباب التشديد، يراعي القاضي في تحديد العقوبة مفعول كل منها على الترتيب الآتي:",
                    "الظروف المشددة العينية المتعلقة بارتكاب الجريمة.",
                    "الظروف المشددة الشخصية المتعلقة بشخص المجرم.",
                    "الأعذار القانونية المتعلقة بارتكاب الجريمة والمخففة للعقوبة.",
                    "الأعذار القانونية المتعلقة بشخص المجرم والمخففة للعقوبة.",
                    "حالة العود.",
                    "الظروف القضائية المخففة."
                  ]
                },
                {
                  "number": "162",
                  "paragraphs": [
                    "إذا كان الجاني حدثا وقرر القاضي أن يطبق عليه عقوبة، بمقتضى الفصل 517 من المسطرة الجنائية، فإن تخفيض العقوبة أو تبديلها المقررين في ذلك الفصل يراعى في تحديدها العقوبة الواجب تطبيقها على المجرم البالغ، حسب مقتضيات الفصل السابق."
                  ]
                }
              ]
            }
          ]
        }
      ]
    }
  ]
}
