  {
  "name": "الكتاب الأول",
  "title": "في العقوبات والتدابير الوقائية",
  "sections": [
    {
      "name": "الجزء الأول",
      "title": "في العقوبات",
      "chapters": [
        {
          "name": "الباب الأول",
          "title": "في العقوبات الأصلية",
          "articles": [
            {
              "number": "13",
              "paragraphs": [
                "تطبق على البالغين ثمان عشرة سنة ميلادية كاملة العقوبات والتدابير الوقائية المنصوص عليها في هذا القانون.",
                "تطبق في حق الأحداث الجانحين القواعد الخاصة المنصوص عليها في الكتاب الثالث من القانون المتعلق بالمسطرة الجنائية."
              ]
            },
            {
              "number": "14",
              "paragraphs": [
                "تكون العقوبات إما أصلية أو بديلة أو إضافية.",
                "تكون أصلية عندما يمكن الحكم بها وحدها دون أن تضاف إلى عقوبة أخرى.",
                "وتكون بديلة عندما يمكن الحكم بها بديلا للعقوبة السالبة للحرية. وتكون إضافية عندما لا يمكن الحكم بها وحدها، وتضاف إلى عقوبة أصلية أو بديلة، أو عندما تكون ناتجة عن الحكم بعقوبة أصلية."
              ]
            },
            {
              "number": "15",
              "paragraphs": [
                "العقوبات الأصلية إما جنائية أو جنحية أو ضبطية."
              ]
            },
            {
              "number": "16",
              "paragraphs": [
                "العقوبات الجنائية الأصلية هي:",
                "1) الإعدام؛",
                "2) السجن المؤبد؛",
                "3) السجن المؤقت من خمس سنوات إلى ثلاثين سنة؛",
                "4) الإقامة الإجبارية؛",
                "5) التجريد من الحقوق الوطنية."
              ]
            },
            {
              "number": "17",
              "paragraphs": [
                "العقوبات الجنحية الأصلية هي:",
                "1) الحبس؛",
                "2) الغرامة التي تتجاوز 1.200 درهم.",
                "وأقل مدة الحبس شهر وأقصاها خمس سنوات، باستثناء حالات العود أو غيرها التي يحدد فيها القانون مددا أخرى."
              ]
            },
            {
              "number": "18",
              "paragraphs": [
                "العقوبات الضبطية الأصلية هي:",
                "1) الاعتقال لمدة تقل عن شهر؛",
                "2) الغرامة من 30 درهم إلى 1200 درهم."
              ]
            },
            {
              "number": "19-23",
              "paragraphs": [
                "الفصول من 19 إلى 23 (نسخت).",
                "غيرت الفقرة الثانية بالفصل 3.80 الصادر بتنفيذه الظهير الشريف رقم 1.81.283 بتاريخ 11 رجب 1402 (6 مايو 1982)، الجريدة الرسمية عدد 3636 بتاريخ 15 رمضان 1402 (7 يوليوز 1982) ص 835؛ وغيرت الفقرة الأولى بالمادة الفريدة من القانون رقم 25.93 الصادر بتنفيذه الظهير الشريف رقم 1.94.284 بتاريخ 15 من صفر 1415 (25 يوليو 1994)، الجريدة الرسمية عدد 4266 بتاريخ 24 صفر 1415 (3 أغسطس 1994) ص 1231.",
                "غيرت الفقرة الثانية بالفصل 3.80 الصادر بتنفيذه الظهير الشريف رقم 1.81.283؛ وغيرت بالمادة الفريدة من القانون رقم 25.93 الصادر بتنفيذه الظهير الشريف رقم 1.94.284 المشار إليها أعلاه.",
                "نسخت أحكامها بالمادة 756 من القانون رقم 22.01 المتعلق بالمسطرة الجنائية الصادر بتنفيذه الظهير الشريف رقم 1.02.255 بتاريخ 25 من رجب 1423 (3 أكتوبر 2002)، الجريدة الرسمية عدد 5078 بتاريخ 27 ذي القعدة 1423 (30 يناير 2003) ص 31."
              ] 
            },
            {
              "number": "24",
              "paragraphs": [
                "تنفذ عقوبة السجن داخل سجن مركزي مع الانفراد بالليل كلما سمح المكان بذلك ومع الشغل الإجباري فيما عدا حالة ثبوت عجز بدني.",
                "ولا يمكن مطلقا للمحكوم عليه بالسجن أن يشغل في الخارج قبل أن يقضي عشر سنوات من العقوبة إذا كان محكوما عليه بالسجن المؤبد، أو قبل أن يقضي ربع العقوبة إذا كان محكوما عليه بالسجن المؤقت."
              ]
            },
            {
              "number": "25",
              "paragraphs": [
                "الإقامة الإجبارية هي أن تحدد المحكمة مكانا للإقامة أو دائرة محدودة لا يجوز للمحكوم عليه الابتعاد عنها بدون رخصة طوال المدة التي يحددها الحكم بحيث لا تقل عن خمس سنوات متى كانت عقوبة أصلية.",
                "ويبلغ الحكم بالإقامة الإجبارية إلى الإدارة العامة للأمن الوطني التي يجب عليها أن تتولى مراقبة الإقامة المفروضة على المحكوم عليه.",
                "وفي حالة الضرورة يجوز لوزير العدل أن يسلم للمحكوم عليه رخصة مؤقتة للتنقل داخل القطر."
              ]
            },
            {
              "number": "26",
              "paragraphs": [
                "التجريد من الحقوق الوطنية يشمل:",
                "1) عزل المحكوم عليه وطرده من جميع الوظائف العمومية وكل الخدمات والأعمال العمومية.",
                "2) حرمان المحكوم عليه من أن يكون ناخبا أو منتخبا وحرمانه بصفة عامة من سائر الحقوق الوطنية والسياسية ومن حق التحلي بأي وسام.",
                "3) عدم الأهلية للقيام بمهمة عضو محلف أو خبير، وعدم الأهلية لأداء الشهادة في أي رسم من الرسوم أو الشهادة أمام القضاء إلا على سبيل الإخبار فقط.",
                "4) عدم أهلية المحكوم عليه لأن يكون وصيا أو مشرفا على غير أولاده.",
                "5) الحرمان من حق حمل السلاح ومن الخدمة في الجيش والقيام بالتعليم أو إدارة مدرسة أو العمل في مؤسسة للتعليم كأستاذ أو مدرس أو مراقب.",
                "والتجريد من الحقوق الوطنية عندما يكون عقوبة أصلية، يحكم به لزجر الجنايات السياسية ولمدة تتراوح بين سنتين وعشر سنوات ما لم تنص مقتضيات خاصة على خلاف ذلك."
              ]
            },
            {
              "number": "27",
              "paragraphs": [
                "عندما يحكم بالتجريد الوطني كعقوبة أصلية فإنه يجوز أن تضاف إليه عقوبة الحبس لمدة يحددها الحكم بحيث لا تزيد عن خمس سنوات.",
                "فإن لم يكن من الممكن الحكم بالتجريد من الحقوق الوطنية، إما لكون المتهم مغربيا سبق تجريده من هذه الحقوق، وإما لكونه أجنبيا وجب الحكم بالسجن من خمس سنوات إلى عشر."
              ]
            },
            {
              "number": "28",
              "paragraphs": [
                "تنفذ عقوبة الحبس في إحدى المؤسسات المعدة لهذا الغرض أو في جناح خاص من أحد السجون المركزية مع الشغل الإجباري في الداخل أو الخارج فيما عدا حالة ثبوت عجز بدني."
              ]
            },
            {
              "number": "29",
              "paragraphs": [
                "تنفذ عقوبة الاعتقال في السجون المدنية أو في ملحقاتها مع الشغل الإجباري في الداخل أو الخارج فيما عدا حالة ثبوت عجز بدني."
              ]
            },
            {
              "number": "30",
              "paragraphs": [
                "تبتدئ مدة العقوبة السالبة للحرية من اليوم الذي يصبح فيه المحكوم عليه معتقلا بمقتضى حكم حاز قوة الشيء المحكوم به.",
                "وفي حالة تقدم اعتقال احتياطي فإن مدته تخصم بأتمها من مدة العقوبة وتحسب من يوم أن وضع المحكوم عليه تحت الحراسة أو من يوم أن ودع رهن الاعتقال من أجل الجريمة التي أدت إلى الحكم عليه.",
                "تحسب مدة العقوبات السالبة للحرية كما يلي:",
                "- إذا كانت العقوبة المحكوم بها يوما واحدا فإن المدة هي أربع وعشرون ساعة.",
                "- إذا كانت العقوبة تقل عن شهر فإنها تحسب بالأيام. وكل يوم أربع وعشرون ساعة.",
                "- إذا كانت العقوبة المحكوم بها شهرا واحدا فإن المدة هي ثلاثون يوما.",
                "- إذا كانت العقوبة تتجاوز شهرا، فإن المدة تحسب بالشهور الميلادية من تاريخ إلى تاريخ."
              ]
            },
            {
              "number": "31",
              "paragraphs": [
                "إذا تعين تنفيذ عدة عقوبات سالبة للحرية فإن المحكوم عليه يبدأ بقضاء أشدها ما لم ينص القانون على خلاف ذلك."
              ]
            },
            {
              "number": "32",
              "paragraphs": [
                "المرأة المحكوم عليها بعقوبة سالبة للحرية إذا ثبت أنها حامل لأكثر من ستة أشهر فإنها لا تنفذ العقوبة إلا بعد وضعها بأربعين يوما فإن كانت معتقلة وقت صدور الحكم فإنها تنتفع بنظام الاعتقال الاحتياطي طوال الفترة اللازمة.",
                "ويؤخر تنفيذ العقوبات السالبة للحرية أيضا في حق النساء اللائي وضعن قبل الحكم عليهن بأقل من أربعين يوما."
              ]
            },
            {
              "number": "33",
              "paragraphs": [
                "إذا حكم على رجل وزوجته، ولو عن جرائم مختلفة، بالحبس لمدة تقل عن سنة، وكانا غير معتقلين يوم صدور الحكم، فإنهما لا ينفذان عقوبتيهما في آن واحد إن هما أثبتا أن لهما محل إقامة معينا وأن في كفالتهما وتحت رعايتهما طفلا دون الثامنة عشرة ليس في الإمكان أن يقوم بكفالته على الوجه المرضي غيرهما من الأشخاص أو المؤسسات العامة أو الخاصة، ماعدا إذا صدر من طرف الزوجين طلب يخالف ذلك.",
                "إذا كانت عقوبة الحبس الصادرة ضد كل من الزوجين تفوق سنة، وكان تحت كفالتهما وفي رعايتهما طفل تقل سنه عن ثمان عشرة سنة، أو إذا لم يمكن رعاية الطفل من طرف أفراد عائلته أو شخص عام أو خاص في ظروف ملائمة، تطبق مقتضيات القانون المتعلق بالمسطرة الجنائية الخاصة بحماية الأطفال في وضعية صعبة أو المقتضيات المتعلقة بكفالة الأطفال المهملين، إذا توفرت شروطها."
              ]
            },
            {
              "number": "34",
              "paragraphs": [
                "إذا صدر حكم بالغرامة وكان المحكوم عليه قد قضى مدة ما رهن الاعتقال الاحتياطي فإنه يجوز للمحكمة أن تقرر إعفاء المحكوم عليه من أداء تلك الغرامة كلا أو بعضا على أن تعلل قرارها بذلك تعليلا خاصا."
              ]
            },
            {
              "number": "35",
              "paragraphs": [
                "الغرامة هي إلزام المحكوم عليه بأن يؤدي لفائدة الخزينة العامة مبلغا معينا من النقود، بالعملة المتداولة قانونا في المملكة."
              ]
            }
          ]
        },
        {
          "name": "الباب الأول المكرر",
          "title": "في العقوبات البديلة",
          "branches": [
            {
              "name": "الفرع 1",
              "title": "أحكام عامة",
              "articles": [
                {
                  "number": "35-1",
                  "paragraphs": [
                    "العقوبات البديلة هي العقوبات التي يحكم بها بديلا للعقوبات السالبة للحرية في الجنح التي لا تتجاوز العقوبة المحكوم بها من أجلها خمس سنوات حبسا نافذا.",
                    "لا يحكم بالعقوبات البديلة في حالة العود.",
                    "تخول العقوبة البديلة دون تنفيذ العقوبة السالبة للحرية على المحكوم عليه، في حالة تنفيذه للالتزامات المفروضة عليه بمقتضاها، وفقا للشروط والأحكام المنصوص عليها في هذا الباب.",
                    "تسري على العقوبات البديلة المقتضيات القانونية المقررة للعقوبة الأصلية للجريمة بما فيها قواعد تفريد العقاب.",
                    "ولا يحول تنفيذ العقوبة البديلة دون تنفيذ العقوبات الإضافية والتدابير الوقائية."
                  ]
                },
                {
                  "number": "35-2",
                  "paragraphs": [
                    "تحدد العقوبات البديلة في:",
                    "1- العمل لأجل المنفعة العامة؛",
                    "2- المراقبة الإلكترونية؛",
                    "3- تقييد بعض الحقوق أو فرض تدابير رقابية أو علاجية أو تأهيلية؛",
                    "4- الغرامة اليومية."
                  ]
                },
                {
                  "number": "35-3",
                  "paragraphs": [
                    "لا يحكم بالعقوبات البديلة في الجنح المتعلقة بالجرائم التالية:",
                    "- الجرائم المتعلقة بأمن الدولة والإرهاب؛",
                    "- الاختلاس أو الغدر أو الرشوة أو استغلال النفوذ أو تبديد الأموال العمومية؛",
                    "- غسل الأموال؛",
                    "- الجرائم العسكرية؛",
                    "- الاتجار الدولي في المخدرات؛",
                    "- الاتجار في المؤثرات العقلية؛",
                    "- الاتجار في الأعضاء البشرية؛",
                    "- الاستغلال الجنسي للقاصرين أو الأشخاص في وضعية إعاقة."
                  ]
                },
                {
                  "number": "35-4",
                  "paragraphs": [
                    "إذا قررت المحكمة الحكم بالعقوبة الحبسية المشار إليها في الفقرة الأولى من الفصل 35-1 أعلاه، فإنه يمكنها أن تستبدلها بعقوبة بديلة أو أكثر إما تلقائيا أو بناء على ملتمس النيابة العامة أو طلب المحكوم عليه أو دفاعه أو النائب الشرعي للحدث أو مدير المؤسسة السجنية أو من يعنيه الأمر. وفي هذه الحالة يجب عليها:",
                    "- أن تحدد العقوبة الحبسية الأصلية؛",
                    "- أن تحدد العقوبة البديلة والالتزامات الناتجة عنها؛",
                    "- أن تشعر المحكوم عليه بأنه في حالة عدم تنفيذه للالتزامات المفروضة عليه، فإنه سيتم تنفيذ العقوبة الحبسية الأصلية المحكوم بها عليه.",
                    "يمكن للمحكمة إجراء بحث اجتماعي حول المعني بالأمر قبل النطق بالحكم، إذا اقتضى الأمر ذلك.",
                    "تراعي المحكمة عند إصدار العقوبات البديلة ما هو ضروري لتحقيق أهداف العقوبة في إعادة تأهيل المحكوم عليه وتقويم سلوكه واستجابته لإعادة الإدماج والحد من حالات العود.",
                    "يؤدي الشروع في تنفيذ العقوبة البديلة إلى وقف سريان تقادم العقوبة الحبسية الأصلية، ولا يبدأ في احتساب مدة التقادم إلا من تاريخ صدور الأمر بتنفيذ العقوبة الأصلية أو ما تبقى منها المشار إليه في البند 1 من المادة 647-3 من القانون المتعلق بالمسطرة الجنائية."
                  ]
                }
              ]
            },
            {
              "name": "الفرع 2",
              "title": "العمل لأجل المنفعة العامة",
              "articles": [
                {
                  "number": "35-5",
                  "paragraphs": [
                    "يمكن للمحكمة أن تحكم بعقوبة العمل لأجل المنفعة العامة بديلا للعقوبة السالبة للحرية إذا كان المحكوم عليه بالغا من العمر خمس عشرة سنة على الأقل في تاريخ صدور الحكم."
                  ]
                },
                {
                  "number": "35-6",
                  "paragraphs": [
                    "يكون العمل لأجل المنفعة العامة غير مؤدى عنه، وينجز لمدة تتراوح بين 40 و3600 ساعة لفائدة مصالح الدولة أو الجماعات الترابية أو مؤسسات أو هيئات حماية الحقوق والحريات والحكامة الجيدة أو المؤسسات العمومية أو المؤسسات الخيرية أو دور العبادة، أو غيرها من المؤسسات أو الجمعيات أو المنظمات غير الحكومية العاملة لفائدة الصالح العام.",
                    "تعتبر المحكمة لتحديد عدد ساعات العمل لأجل المنفعة العامة المحكوم بها، موازاة كل يوم من مدة العقوبة الحبسية المحكوم بها لثلاث ساعات من العمل، مع مراعاة الحدين الأدنى والأقصى لعدد ساعات العمل المنصوص عليها في الفقرة الأولى أعلاه.",
                    "يراعى في العمل، عند الاقتضاء، توافقه مع جنس وسن ومهنة أو حرفة المحكوم عليه، أو مع مؤهلاته وقدراته، كما يمكن أن يكون مكملا لنشاطه المهني أو الحرفي المعتاد."
                  ]
                },
                {
                  "number": "35-7",
                  "paragraphs": [
                    "يلتزم المحكوم عليه بتنفيذ عقوبة العمل لأجل المنفعة العامة داخل أجل لا يتجاوز ستة أشهر من تاريخ صدور المقرر التنفيذي المشار إليه في المادة 647-2 من القانون المتعلق بالمسطرة الجنائية. ويمكن تمديد هذا الأجل لمدة مماثلة مرة واحدة بقرار صادر عن قاضي تطبيق العقوبات، بناء على طلب مبرر من المحكوم عليه أو بطلب من دفاعه أو من له مصلحة في ذلك."
                  ]
                },
                {
                  "number": "35-8",
                  "paragraphs": [
                    "إذا قررت المحكمة الحكم على الحدث بعقوبة حبسية وفقا للمادة 482 من القانون المتعلق بالمسطرة الجنائية، فإنه يمكنها أن تستبدلها بعقوبة العمل لأجل المنفعة العامة مع مراعاة أحكام الفصل 35-5 أعلاه.",
                    "يجب على قاضي الأحداث أن يتأكد من مدى ملاءمة العمل لأجل المنفعة العامة مع القدرة الجسدية للحدث ومصلحته الفضلى ولحاجيات تكوينه وإعادة إدماجه."
                  ]
                },
                {
                  "number": "35-9",
                  "paragraphs": [
                    "تطبق على أنشطة العمل لأجل المنفعة العامة المقتضيات التشريعية والتنظيمية المتعلقة بحماية أمن وصحة العاملين.",
                    "تتحمل الدولة مسؤولية تعويض الأضرار التي يتسبب فيها المحكوم عليه والتي لها علاقة مباشرة بتنفيذ عقوبة العمل لأجل المنفعة العامة. ويحق لها الرجوع على المحكوم عليه للمطالبة بما تم أداؤه."
                  ]
                }
              ]
            },
            {
              "name": "الفرع 3",
              "title": "المراقبة الإلكترونية",
              "articles": [
                {
                  "number": "35-10",
                  "paragraphs": [
                    "يمكن للمحكمة أن تحكم بالمراقبة الإلكترونية بديلا للعقوبة السالبة للحرية.",
                    "يتم الخضوع للمراقبة الإلكترونية من خلال مراقبة حركة وتنقل المحكوم عليه إلكترونيا بواحدة أو أكثر من وسائل المراقبة الإلكترونية المعتمدة.",
                    "يحدد مكان ومدة المراقبة الإلكترونية من طرف المحكمة ويراعى في تحديدها خطورة الجريمة والظروف الشخصية والمهنية للمحكوم عليه وسلامة الضحايا، وعدم المساس بالحقوق الشخصية للأشخاص المتواجدين رفقته."
                  ]
                }
              ]
            },
            {
              "name": "الفرع 4",
              "title": "تقييد بعض الحقوق أو فرض تدابير رقابية أو علاجية أو تأهيلية",
              "articles": [
                {
                  "number": "35-11",
                  "paragraphs": [
                    "يمكن للمحكمة أن تحكم بالعقوبة المقيدة لبعض الحقوق أو فرض تدابير رقابية أو علاجية أو تأهيلية، بديلا للعقوبات السالبة للحرية.",
                    "تستهدف هذه العقوبات اختبار المحكوم عليه للتأكد من استعداده لتقويم سلوكه واستجابته لإعادة الإدماج."
                  ]
                },
                {
                  "number": "35-12",
                  "paragraphs": [
                    "العقوبات المقيدة لبعض الحقوق أو فرض تدابير رقابية أو علاجية أو تأهيلية والتي يمكن الحكم بواحدة أو أكثر منها، هي:",
                    "1- مزاولة المحكوم عليه نشاطا مهنيا محددا أو تتبعه دراسة أو تأهيلا مهنيا محددا؛",
                    "2- إقامة المحكوم عليه بمكان محدد والتزامه بعدم مغادرته، أو بعدم مغادرته في أوقات معينة، أو منعه من ارتياد أماكن معينة، أو من عدم ارتيادها في أوقات معينة؛",
                    "3- فرض رقابة يلزم بموجبها المحكوم عليه، بالتقدم في مواعيد محددة، إما إلى المؤسسة السجنية وإما إلى مقر الشرطة أو الدرك الملكي أو مكتب المساعدة الاجتماعية بالمحكمة؛",
                    "4- التعهد بعدم التعرض أو الاتصال بالأشخاص ضحايا الجريمة بأي وسيلة كانت؛",
                    "5- خضوع المحكوم عليه لعلاج نفسي أو علاج ضد الإدمان؛",
                    "6- تعويض أو إصلاح المحكوم عليه للأضرار الناتجة عن الجريمة."
                  ]
                },
                {
                  "number": "35-13",
                  "paragraphs": [
                    "يلتزم المحكوم عليه بتنفيذ العقوبات المقيدة لبعض الحقوق أو فرض تدابير رقابية أو علاجية أو تأهيلية، داخل أجل لا يتجاوز ستة أشهر من تاريخ صدور المقرر التنفيذي المشار إليه في المادة 647-2 من القانون المتعلق بالمسطرة الجنائية، ويمكن تمديد هذا الأجل لمدة مماثلة مرة واحدة، بناء على طلب المحكوم عليه أو من له مصلحة في ذلك، بقرار صادر عن قاضي تطبيق العقوبات، إذا اقتضى الأمر ذلك."
                  ]
                }
              ]
            },
            {
              "name": "الفرع 5",
              "title": "الغرامة اليومية",
              "articles": [
                {
                  "number": "35-14",
                  "paragraphs": [
                    "يمكن للمحكمة أن تحكم بعقوبة الغرامة اليومية بديلا للعقوبة الحبسية النافذة.",
                    "تتمثل الغرامة اليومية في مبلغ مالي تحدده المحكمة عن كل يوم من المدة الحبسية المحكوم بها.",
                    "يمكن الحكم بعقوبة الغرامة اليومية على الأحداث في حالة موافقة وليهم أو من يمثلهم.",
                    "لا يمكن الحكم بعقوبة الغرامة اليومية إلا بعد الإدلاء بما يفيد وجود صلح أو تنازل صادر عن الضحية أو ذويه أو قيام المحكوم عليه بتعويض أو إصلاح الأضرار الناتجة عن الجريمة."
                  ]
                },
                {
                  "number": "35-15",
                  "paragraphs": [
                    "يحدد مبلغ الغرامة اليومية بين 100 و2.000 درهم عن كل يوم من العقوبة الحبسية المحكوم بها.",
                    "تراعي المحكمة في تحديد الغرامة اليومية الإمكانيات المادية للمحكوم عليه أو ذويه وتحملاته المالية وخطورة الجريمة المرتكبة والضرر المترتب عنها.",
                    "يلتزم المحكوم عليه بأداء المبلغ المحدد له في أجل لا يتجاوز ستة أشهر من تاريخ صدور المقرر التنفيذي المشار إليه في المادة 647-2 من القانون المتعلق بالمسطرة الجنائية، ويمكن تمديد هذا الأجل لمدة مماثلة مرة واحدة بقرار صادر عن قاضي تطبيق العقوبات بناء على طلب من المحكوم عليه، أو من له مصلحة في ذلك."
                  ]
                }
              ]
            }
          ]
        },
        {
          "name": "الباب الثاني",
          "title": "في العقوبات الإضافية",
          "articles": [
            {
              "number": "36",
              "paragraphs": [
                "العقوبات الإضافية هي:",
                "1- الحجر القانوني؛",
                "2- التجريد من الحقوق الوطنية؛",
                "3- الحرمان المؤقت من ممارسة بعض الحقوق الوطنية أو المدنية أو العائلية؛",
                "4- الحرمان النهائي أو المؤقت من الحق في المعاشات التي تصرفها الدولة والمؤسسات العمومية. غير أن هذا الحرمان لا يمكن أن يطبق على الأشخاص المكلفين بالنفقة على طفل أو أكثر، مع مراعاة الأحكام الواردة في أنظمة المعاشات في هذا الشأن.",
                "5- المصادرة الجزئية للأشياء المملوكة للمحكوم عليه، بصرف النظر عن المصادرة المقررة كتدبير وقائي في الفصل 89؛",
                "6- حل الشخص المعنوي؛",
                "7- نشر الحكم الصادر بالإدانة.",
                "تمت بالمادة الثانية من القانون رقم 24.03 الصادر بتنفيذه الظهير الشريف رقم 1.03.207 بتاريخ 16 من رمضان 1424 (11 نوفمبر 2003)، ج ر عدد 5175 بتاريخ 12 ذو القعدة 1424 (5 يناير 2004) ص 121."
              ]
            },
            {
              "number": "37",
              "paragraphs": [
                "الحجر القانوني والتجريد من الحقوق الوطنية، كعقوبة تبعية، ينتجان عن العقوبات الجنائية وحدها.",
                "ويتعين تطبيقهما بحكم القانون دون حاجة إلى النطق بهما في الحكم."
              ]
            },
            {
              "number": "38",
              "paragraphs": [
                "الحجر القانوني يحرم المحكوم عليه من مباشرة حقوقه المالية طوال مدة تنفيذ العقوبة الأصلية.",
                "وله في جميع الأحوال أن يختار وكيلا ينوب عنه في مباشرة تلك الحقوق تحت إشراف الوصي القضائي المعين في أحكام الفصل التالي."
              ]
            },
            {
              "number": "39",
              "paragraphs": [
                "يعين وفقا للإجراءات المقررة في شأن المحجورين القضائيين، وصي للإشراف على إدارة أموال المحكوم عليه أثناء وجوده في حالة الحجر القانوني. فإذا كان المحكوم عليه قد اختار وكيلا لمباشرة تلك الإدارة، فإنه يكون تحت إشراف الوصي ومسؤولا أمامه. وفي غير هذه الحالة يتولى الوصي بنفسه مباشرة تلك الإدارة.",
                "ولا يجوز طوال مدة العقوبة أن يسلم للمحجور القانوني أي مبلغ من مدخولاته ما خلا المقادير الخاصة بالمعيشة في حدود ما تسمح به إدارة السجون.",
                "وعند انتهاء العقوبة، تعاد إلى المحجور أمواله، ويقدم له الوصي الحساب عما قام به مدة إدارته."
              ]
            },
            {
              "number": "40",
              "paragraphs": [
                "يجوز للمحاكم، في الحالات التي يحددها القانون، إذا حكمت بعقوبة جنحية أن تحرم المحكوم عليه، لمدة تتراوح بين سنة وعشر سنوات، من ممارسة حق أو عدة حقوق من الحقوق الوطنية أو المدنية أو العائلية المنصوص عليها في الفصل 26.",
                "أضيفت الفقرة الثانية بالمادة الثانية من القانون رقم 03.03 المتعلق بمكافحة الإرهاب، الصادر بتنفيذه الظهير الشريف رقم 1.03.140 بتاريخ 26 من ربيع الأول 1424 (28 ماي 2003)، ج ر عدد 5112 بتاريخ 27 ربيع الأول 1424 (29 ماي 2003) ص 1755.",
                "يجوز أيضا للمحاكم تطبيق مقتضيات الفقرة الأولى من هذا الفصل إذا حكمت بعقوبة جنحية من أجل جريمة إرهابية."
              ]
            },
            {
              "number": "41",
              "paragraphs": [
                "كل حكم بالإعدام أو السجن المؤبد يتبعه حتما الحرمان النهائي من الحق في المعاش الذي تصرفه الدولة، ويطبق هذا الحرمان بحكم القانون، دون حاجة للنطق به في الحكم.",
                "أما الحكم الصادر بعقوبة جنائية غير العقوبتين المنصوص عليهما في الفقرة السابقة فيجوز أن يتضمن النص على الحرمان المؤقت من الحق في المعاش طوال مدة تنفيذ العقوبة."
              ]
            },
            {
              "number": "42",
              "paragraphs": [
                "المصادرة هي تمليك الدولة جزءا من أملاك المحكوم عليه أو بعض أملاك له معينة."
              ]
            },
            {
              "number": "43",
              "paragraphs": [
                "في حالة الحكم بالمؤاخذة عن فعل يعد جناية، يجوز للقاضي أن يحكم بأن يصادر لفائدة الدولة، مع حفظ حقوق الغير، الأدوات والأشياء التي استعملت أو كانت ستستعمل في ارتكاب الجريمة أو التي تحصلت منها وكذلك المنح وغيرها من الفوائد التي كوفئ بها مرتكب الجريمة أو كانت معدة لمكافأته."
              ]
            },
            {
              "number": "44",
              "paragraphs": [
                "في حالة الحكم بالمؤاخذة عن أفعال تعد جنحا أو مخالفات لا يجوز الحكم بالمصادرة المشار إليها في الفصل السابق إلا في الأحوال التي يوجد فيها نص قانوني صريح."
              ]
            },
            {
              "number": "44-1",
              "paragraphs": [
                "يمكن للمحكمة أن تحكم بالمصادرة المنصوص عليها في الفصل 42 من هذا القانون إذا تعلق الأمر بجريمة إرهابية.",
                "يجب دائما الحكم بالمصادرة المذكورة في الفصلين 43 و44 من هذا القانون، مع حفظ حق الغير، في حالة الحكم بالمؤاخذة من أجل جريمة إرهابية."
              ]
            },
            {
              "number": "45",
              "paragraphs": [
                "المصادرة لا تمس إلا الأشياء المملوكة للمحكوم عليه. باستثناء الأحوال المنصوص عليها في هذه المجموعة.",
                "وإذا كان المال محل المصادرة مملوكا على الشياع بين المحكوم عليه والغير فإن المصادرة لا تنصب إلا على نصيب المحكوم عليه ويترتب عنها حتما القسمة أو التصفية على طريق المزايدة."
              ]
            },
            {
              "number": "46",
              "paragraphs": [
                "تفويت الأموال المصادرة يباشر من طرف إدارة الأملاك المخزنية حسب الإجراءات المقررة بخصوص بيع أملاك الدولة.",
                "أضيف بالمادة الثالثة من القانون رقم 03.03 المتعلق بمكافحة الإرهاب المشار إليه أعلاه.",
                "وتبقى الأموال المصادرة كافلة في حدود قيمتها للديون المشروعة السابقة لصدور الحكم."
              ]
            },
            {
              "number": "47",
              "paragraphs": [
                "حل الشخص المعنوي هو منعه من مواصلة النشاط الاجتماعي، ولو تحت اسم آخر وبإشراف مديرين أو مسيرين أو متصرفين آخرين ويترتب عنه تصفية أملاك الشخص المعنوي.",
                "ولا يحكم به إلا في الأحوال المنصوص عليها في القانون وبنص صريح في الحكم بالإدانة."
              ]
            },
            {
              "number": "48",
              "paragraphs": [
                "للمحكمة، في الأحوال التي يحددها القانون، أن تأمر بنشر الحكم الصادر عنها بالإدانة كلا أو بعضا، في صحيفة أو عدة صحف تعينها، أو بتعليقه في أماكن تبينها. وذلك على نفقة المحكوم عليه من غير أن تتعدى صوائر النشر ما قدرته المحكمة لذلك ولا أن تتجاوز مدة التعليق شهرا واحدا."
              ]
            }
          ]
        },
        {
          "name": "الباب الثالث",
          "title": "في أسباب انقضاء العقوبات والإعفاء منها وإيقافها",
          "articles": [
            {
              "number": "49",
              "paragraphs": [
                "تنفذ على المحكوم عليه العقوبات الصادرة ضده بتمامها، إلا إذا طرأ سبب من أسباب الانقضاء أو الإعفاء أو الإيقاف التي بيانها:",
                "1) موت المحكوم عليه؛",
                "2) العفو الشامل؛",
                "3) إلغاء القانون الجنائي المحكوم بمقتضاه؛",
                "4) العفو؛",
                "5) التقادم؛",
                "6) إيقاف تنفيذ العقوبة؛",
                "7) الإفراج الشرطي؛",
                "8) الصلح، إذا أجازه القانون بنص صريح."
              ]
            },
            {
              "number": "50",
              "paragraphs": [
                "موت المحكوم عليه لا يحول دون تنفيذ الجزاءات المالية على تركته."
              ]
            },
            {
              "number": "51",
              "paragraphs": [
                "لا يكون العفو الشامل إلا بنص تشريعي صريح.",
                "ويحدد هذا النص ما يترتب عن العفو من آثار دون المساس بحقوق الغير."
              ]
            },
            {
              "number": "52",
              "paragraphs": [
                "باستثناء الحالة المنصوص عليها في الفصل 7، بخصوص تطبيق القوانين المؤقتة فإن إلغاء قانون جنائي يحول دون تنفيذ العقوبة المحكوم بها بموجبه والتي لم يشرع بعد في تنفيذها، كما يجعل حدا للعقوبة الجاري تنفيذها."
              ]
            },
            {
              "number": "53",
              "paragraphs": [
                "العفو حق من حقوق الملك، ويباشر وفق الترتيبات التي تضمنها الظهير رقم 1.57.387 الصادر في 16 رجب 1377 موافق 6 فبراير 1958 بخصوص العفو.",
                "وإذا قدم طلب العفو عن محكوم عليه، معتقل من أجل جنحة أو مخالفة، جاز لوزير العدل، بصفة استثنائية، أن يأمر بالإفراج عنه ريثما يبت في الطلب."
              ]
            },
            {
              "number": "54",
              "paragraphs": [
                "يترتب على تقادم العقوبة تخلص المحكوم عليه من مفعول الحكم، وفق الشروط المبينة في الفصول 688 إلى 693 من المسطرة الجنائية."
              ]
            },
            {
              "number": "55",
              "paragraphs": [
                "في حالة الحكم بعقوبة الحبس أو الغرامة، في غير مواد المخالفات، إذا لم يكن قد سبق الحكم على المتهم بالحبس من أجل جناية أو جنحة عادية، يجوز للمحكمة أن تأمر بإيقاف تنفيذ تلك العقوبة، على أن تعلل ذلك."
              ]
            },
            {
              "number": "56",
              "paragraphs": [
                "يصبح الحكم بإيقاف التنفيذ كأن لم يكن، بعد مضي خمس سنوات من اليوم الذي صار فيه الحكم حائزا لقوة الشيء المحكوم به، إذا لم يرتكب المحكوم عليه، خلال تلك الفترة، جناية أو جنحة عادية حكم عليه من أجلها بالحبس أو بعقوبة أشد.",
                "وبعكس ذلك إذا ارتكب جناية أو جنحة داخل أجل الخمس سنوات المنصوص عليه في الفقرة السابقة فإن الحكم بالحبس أو بعقوبة أشد بسبب تلك الجناية أو الجنحة ولو صدر الحكم بعد انصرام الأجل المذكور يترتب عنه حتما بقوة القانون عندما يصير نهائيا إلغاء وقف تنفيذ الحكم.",
                "وتنفذ العقوبة الأولى قبل العقوبة الثانية، دون إدماج."
              ]
            },
            {
              "number": "57",
              "paragraphs": [
                "إيقاف التنفيذ لا يسري على أداء مصاريف الدعوى والتعويضات المدنية كما أنه لا يسري على العقوبات الإضافية أو فقدان الأهلية المترتب عن الحكم الزجري.",
                "غير أن العقوبات الإضافية وحالة فقدان الأهلية ينتهي مفعولهما حتما يوم يصبح الحكم كأن لم يكن، وفقا لمقتضيات الفقرة الأولى من الفصل السابق."
              ]
            },
            {
              "number": "58",
              "paragraphs": [
                "إذا كان المحكوم عليه حاضرا بالجلسة، تعين على القاضي الرئيس بمجرد النطق بالحكم بإيقاف التنفيذ، أن ينذره بأنه إذا حكم عليه مرة أخرى في الأحوال المبينة في الفصل 56 فسوف تنفذ عليه فعلا هذه العقوبة، بالإضافة إلى العقوبة التي قد يحكم بها عليه فيما بعد دون أي إدماج. كما أنه سوف يتعرض للعقوبات المشددة بموجب حالة العود."
              ]
            },
            {
              "number": "59",
              "paragraphs": [
                "الإفراج المقيد بشروط هو إطلاق سراح المحكوم عليه قبل الأوان نظرا لحسن سيرته داخل السجن، على أن يظل مستقيم السيرة في المستقبل، أما إذا ثبت عليه سوء السلوك، أو إذا أخل بالشروط التي حددها القرار بالإفراج المقيد، فإنه يعاد إلى السجن لتتميم ما تبقى من عقوبته.",
                "ويطبق الإفراج المقيد حسب الفصول 663 إلى 672 من المسطرة الجنائية."
              ]
            },
            {
              "number": "60",
              "paragraphs": [
                "ليس رد الاعتبار سببا من أسباب انقضاء العقوبة أو الإعفاء منها أو إيقافها، وإنما يمحو فيما يخص المستقبل فقط، آثار الحكم الزجري وحالات فقدان الأهلية المترتبة عن هذا الحكم، وذلك وفق مقتضيات الفصول 730 إلى 747 من المسطرة الجنائية."
              ]
            }
          ]
        }
      ]
    },
    {
      "name": "الجزء الثاني",
      "title": "في التدابير الوقائية",
      "chapters": [
        {
          "name": "الباب الأول",
          "title": "في مختلف التدابير الوقائية الشخصية والعينية",
          "articles": [
            {
              "number": "61",
              "paragraphs": [
                "التدابير الوقائية الشخصية هي:",
                "1) الإقصاء؛",
                "2) الإجبار على الإقامة بمكان معين؛",
                "3) المنع من الإقامة؛",
                "4) الإيداع القضائي داخل مؤسسة لعلاج الأمراض العقلية؛",
                "5) الوضع القضائي داخل مؤسسة للعلاج؛",
                "6) الوضع القضائي في مؤسسة فلاحية؛",
                "7) عدم الأهلية لمزاولة جميع الوظائف أو الخدمات العمومية؛",
                "8) المنع من مزاولة مهنة أو نشاط أو فن سواء كان ذلك خاضعا لترخيص إداري أم لا؛",
                "9) سقوط الحق في الولاية الشرعية على الأبناء؛",
                "10) منع المحكوم عليه من الاتصال بالضحية؛",
                "11) إخضاع المحكوم عليه لعلاج نفسي ملائم."
              ]
            },
            {
              "number": "62",
              "paragraphs": [
                "التدابير الوقائية العينية هي:",
                "1) مصادرة الأشياء التي لها علاقة بالجريمة أو الأشياء الضارة أو الخطيرة أو المحظور امتلاكها؛",
                "2) إغلاق المحل أو المؤسسة التي استغلت في ارتكاب الجريمة."
              ]
            },
            {
              "number": "63",
              "paragraphs": [
                "الإقصاء هو إيداع العائدين الذين تتوفر فيهم الشروط المبينة في الفصلين 65 و66، داخل مؤسسة للشغل ذات نظام ملائم لتقويم الانحراف الاجتماعي."
              ]
            },
            {
              "number": "64",
              "paragraphs": [
                "لا يحكم بالإقصاء إلا المحاكم العادية، دون غيرها من المحاكم الخاصة أو الاستثنائية.",
                "ويحدد الحكم مدة الإقصاء التي لا يسوغ أن تقل عن خمس سنوات، أو تزيد على عشر سنوات ابتداء من اليوم الذي ينتهي فيه تنفيذ العقوبة.",
                "وإذا ما بدت علامة صادقة تفيد أن المحكوم عليه قد استقامت حاله اجتماعيا، فإنه يجوز أن يمنح الإفراج المقيد بشروط، طبق الترتيبات المنصوص عليها في الفصل 663 وما يليه من المسطرة الجنائية."
              ]
            },
            {
              "number": "65",
              "paragraphs": [
                "يتعين إقصاء العائدين الذين صدر عليهم الحكم بالسجن مرتين في ظرف عشر سنوات دون أن يدخل في حساب هذا الأجل مدة العقوبة التي وقع تنفيذها فعلا.",
                "إلا أن المحكوم عليهم من الرجال الذين تقل سنهم عن عشرين سنة أو تتجاوز الستين، أو من النساء مطلقا، يجوز للمحكمة أن تعفيهم من الإقصاء بقرار معلل."
              ]
            },
            {
              "number": "66",
              "paragraphs": [
                "يمكن إقصاء العائدين الذين صدر عليهم، في ظرف عشر سنوات - خالصة من مدة العقوبات التي وقع تنفيذها فعلا - الأحكام التالية بصرف النظر عن ترتيب صدورها:",
                "1) ثلاثة أحكام، أحدها بالسجن والآخران بالحبس من أجل أفعال تعتبر جنايات أو بالحبس لأزيد من ستة أشهر عن السرقة أو النصب أو خيانة الأمانة أو إخفاء أشياء حصل عليها من جناية أو جنحة أو الإخلال العلني بالحياء أو تحريض قاصرين على الفساد أو استخدام الغير من أجل الفساد أو استغلال البغاء أو الإجهاض أو الاتجار في المخدرات.",
                "2) أربعة أحكام بالحبس من أجل أفعال تعتبر جنايات، أو أربعة أحكام كل منها بالحبس لأزيد من ستة أشهر عن الجنح المنصوص عليها في الرقم 1 أعلاه.",
                "3) سبعة أحكام يكون اثنان منها على الأقل من نوع الأحكام المنصوص عليها في الرقمين السابقين، والباقي بالحبس لأزيد من ثلاثة أشهر عن جناية أو جنحة."
              ]
            },
            {
              "number": "67",
              "paragraphs": [
                "كل من سبق إقصاؤه ثم ارتكب، داخل العشر سنوات الموالية ليوم الإفراج عنه، جناية أو جنحة من النوع المنصوص عليه في الرقم 1 من الفصل السابق حكم عليه من أجلها بالحبس لأزيد من سنة فإنه، بعد انتهاء هذه العقوبة، يقصى من جديد، لمدة لا يمكن أن تقل عن عشر سنوات."
              ]
            },
            {
              "number": "68",
              "paragraphs": [
                "إذا كان من شأن المتابعة لدى محكمة زجرية أن تؤدي إلى الحكم بالإقصاء، فإنه لا يجوز وفقا للفقرة الأخيرة من الفصل 76 من المسطرة الجنائية تطبيق المسطرة الخاصة بالجنحة المشاهدة.",
                "وتكون مساعدة المدافع واجبة حسب مقتضيات الفصل 311 من المسطرة الجنائية."
              ]
            },
            {
              "number": "69",
              "paragraphs": [
                "المحكمة التي تصدر العقوبة الأصلية المستوجبة لإقصاء المحكوم عليه هي التي تبت في شأن ذلك الإقصاء.",
                "ويحكم بالإقصاء في نفس الحكم الصادر بالعقوبة الأصلية، مع وجوب التنصيص الصريح على الأحكام السابقة التي تبرر هذا التدبير."
              ]
            },
            {
              "number": "70",
              "paragraphs": [
                "إذا تبين من الأحداث أن المتهم بارتكاب إحدى جرائم المس بسلامة الدولة له نشاط عادي فيه خطر على النظام الاجتماعي، جاز للمحكمة، التي تقضي عليه بالعقوبة من أجل تلك الجريمة، أن تعين له مكانا للإقامة أو دائرة محصورة لا يجوز له الابتعاد عنها بدون رخصة، طوال المدة التي يحددها الحكم على ألا تتجاوز خمس سنوات. وتبتدئ مدة الإجبار على الإقامة من يوم انتهاء العقوبة الأصلية.",
                "إذا كانت الجريمة المرتكبة جريمة إرهابية، فيجوز للمحكمة تعيين مكان الإقامة المذكور في الفقرة الأولى أعلاه. ولا يجوز الابتعاد عنه بدون رخصة طيلة المدة التي يحددها الحكم على ألا تتجاوز 10 سنوات.",
                "ويبلغ الحكم بتحديد الإقامة إلى الإدارة العامة للأمن الوطني التي يجب عليها أن تتولى مراقبة الإقامة المحددة.",
                "ويسوغ لها، إذا اقتضى الحال، أن تسلم للمحكوم عليه رخصا مؤقتة للتنقل داخل القطر."
              ]
            },
            {
              "number": "71",
              "paragraphs": [
                "المنع من الإقامة هو منع المحكوم عليه من أن يحل بأماكن معينة، ولمدة محددة إذا اعتبرت المحكمة، نظرا لطبيعة الفعل المرتكب أو لشخصية فاعله أو لظروف أخرى أن إقامة المحكوم عليه بالأماكن المشار إليها يكون خطرا على النظام العام أو على أمن الأشخاص."
              ]
            },
            {
              "number": "72",
              "paragraphs": [
                "يجوز دائما الحكم بالمنع من الإقامة في حالة إصدار عقوبة من أجل فعل يعده القانون جناية.",
                "أما في حالة إصدار عقوبة بالحبس من أجل جنحة، فلا يجوز الحكم بالمنع من الإقامة إلا إذا كان مقررا في النص الذي يعاقب على تلك الجنحة.",
                "وعلى أي حال، فإن المنع من الإقامة لا يطبق إلا إذا نص عليه صراحة في الحكم الصادر بالعقوبة الأصلية.",
                "غير أنه يجوز دائما الحكم بالمنع من الإقامة إذا صدر حكم بعقوبة حبسية من أجل جريمة إرهابية."
              ]
            },
            {
              "number": "73",
              "paragraphs": [
                "المنع من الإقامة يمكن الحكم به من خمس سنوات إلى عشرين سنة في حق المحكوم عليهم بعقوبة السجن، ومن سنتين إلى عشر سنوات في حق المحكوم عليهم بعقوبة الحبس.",
                "ولا تبدأ مدة هذا المنع ومفعوله إلا من يوم إسراح المحكوم عليه وبعد تبليغه قرار المنع."
              ]
            },
            {
              "number": "74",
              "paragraphs": [
                "يتولى المدير العام للأمن الوطني تحرير القرار بالمنع من الإقامة ويحتوي هذا القرار على قائمة الأماكن أو الدوائر التي يمنع على المحكوم عليه أن يحل بها - وتتضمن هذه القائمة الأماكن أو الدوائر الممنوعة بصفة عامة، كما تتضمن عند الاقتضاء، الأماكن أو الدوائر التي خصها بالمنع الحكم القضائي.",
                "ويكون المدير العام للأمن الوطني مختصا بالسهر على احترام الحكم بالمنع من الإقامة وله، إذا اقتضى الحال، أن يسلم للمعنيين بالأمر رخصا مؤقتة بالإقامة في الأماكن الممنوعة عليهم."
              ]
            },
            {
              "number": "75",
              "paragraphs": [
                "الإيداع القضائي داخل مؤسسة لعلاج الأمراض العقلية هو أن يوضع شخص في مؤسسة مختصة، بمقتضى قرار من محكمة الموضوع إذا كان متهما بارتكاب جناية أو جنحة أو بالمساهمة أو المشاركة فيها، ولكنه، كان وقت ارتكاب الفعل، في حالة خلل عقلي ثبت بناء على خبرة طبية، واستوجب التصريح بانعدام مسؤوليته مطلقا وإعفاءه من العقوبة التي قد يستحقها وفق القانون."
              ]
            },
            {
              "number": "76",
              "paragraphs": [
                "إذا تبين لمحكمة الموضوع، بعد إجراء خبرة طبية، أن الشخص المتابع أمامها بجناية أو جنحة، كان عديم المسؤولية تماما وقت ارتكاب الفعل بسبب اختلال عقلي، فإنه يجب عليها:",
                "1) أن تثبت أن المتهم كان، وقت الفعل، في حالة خلل عقلي يمنعه تماما من الإدراك أو الإرادة.",
                "2) أن تصرح بانعدام مسؤوليته مطلقا وتحكم بإعفائه.",
                "3) أن تأمر، في حالة استمرار الخلل العقلي، بإيداعه في مؤسسة لعلاج الأمراض العقلية.",
                "ويبقى الأمر بالاعتقال ساريا على المتهم إلى أن يودع فعلا في تلك المؤسسة."
              ]
            },
            {
              "number": "77",
              "paragraphs": [
                "الإيداع القضائي يستمر طالما استوجب ذلك الأمن العام وعلاج الشخص المأمور بإيداعه.",
                "ويبقى الشخص المودع تحت الملاحظة، ويجب فحصه كلما رأى الطبيب المعالج ضرورة ذلك، وعلى أي حال كل ستة أشهر.",
                "وإذا استقر رأي الطبيب المعالج على إنهاء الإيداع، فإنه يجب أن يخطر بذلك رئيس النيابة العامة بمحكمة الاستئناف الذي له أن يطعن في قرار الإخراج في ظرف عشرة أيام ابتداء من تسلمه ذلك الإخطار، وذلك وفق الشروط المقررة في الفصل 28 من ظهير 21 شوال 1378 الخاص بالوقاية والعلاج من الأمراض العقلية وحماية المرضى المصابين بها، وهذا الطعن يوقف مفعول الأمر بالإخراج."
              ]
            },
            {
              "number": "78",
              "paragraphs": [
                "إذا قررت محكمة الموضوع، بعد الخبرة الطبية، أن مرتكب جناية أو جنحة، رغم كونه قادرا على الدفاع عن نفسه في الدعوى، إلا أنه كان مصابا وقت الأفعال المنسوبة إليه بضعف في قواه العقلية يترتب عليه نقص مسؤوليته، فإنه يجب عليها:",
                "1) أن تثبت أن الأفعال المتابع من أجلها المتهم منسوبة إليه؛",
                "2) أن تصرح بأن مسؤوليته ناقصة بسبب ضعف في قواه العقلية وقت ارتكاب الفعل؛",
                "3) أن تصدر الحكم بالعقوبة؛",
                "4) أن تأمر، إذا اقتضى الأمر ذلك، بإدخال المحكوم عليه في مؤسسة لعلاج الأمراض العقلية، قبل تنفيذ العقوبة السالبة للحرية. ومدة بقائه في هذه المؤسسة تخصم من مدة العقوبة، وينتهي إيداعه في المؤسسة وفق الشروط المقررة في الفقرة الأخيرة من الفصل 77."
              ]
            },
            {
              "number": "79",
              "paragraphs": [
                "إذا قررت محكمة الموضوع، بعد الخبرة الطبية، أن الشخص المتابع لديها بجناية أو جنحة كامل المسؤولية أو ناقص المسؤولية بالنسبة للوقائع المنسوبة إليه، ولكن بسبب خلل في قواه العقلية طرأ عليه أو اشتد أثره بعد ارتكاب الفعل، أصبح غير قادر على الدفاع عن نفسه في الدعوى، فإنه يجب عليها:",
                "1) أن تقرر أن المتهم عاجز عن إبداء دفاعه بسبب خلل في قواه العقلية؛",
                "2) أن تأمر بوقف النظر في الدعوى؛",
                "3) أن تأمر بإدخاله في مؤسسة لعلاج الأمراض العقلية.",
                "ويبقى الأمر بالاعتقال ساريا بالنسبة للمتهم حتى يتم إيداعه فعلا.",
                "ويجب على الطبيب المعالج أن يخطر رئيس النيابة العمومية بقرار إخراجه في ظرف عشرة أيام على الأقل قبل تنفيذ الأمر بالخروج، ويبقى الأمر بالاعتقال الذي كان نافذا وقت إدخاله بالمؤسسة ساري المفعول وتستأنف المتابعة، بناء على طلب النيابة العمومية وفي حالة صدور حكم بعقوبة سالبة للحرية، فإن محكمة الموضوع يمكن لها أن تخصم المدة التي قضاها في المؤسسة من مدة تلك العقوبة."
              ]
            },
            {
              "number": "80",
              "paragraphs": [
                "الوضع القضائي في مؤسسة للعلاج هو أن يجعل تحت المراقبة بمؤسسة ملائمة - وبمقتضى حكم صادر عن قضاء الحكم - شخص ارتكب أو ساهم أو شارك في جناية أو جنحة تأديبية أو ضبطية، وكان مصابا بتسمم مزمن ترتب عن تعاطي للكحول أو المخدرات إذا ظهر أن الإجرام له صلة بذلك التسمم."
              ]
            },
            {
              "number": "81",
              "paragraphs": [
                "إذا ارتأى قضاء الحكم تطبيق مقتضيات الفصل السابق تعين عليه:",
                "1) أن يصرح بأن الفعل المتابع من أجله صادر عن المتهم؛",
                "2) أن يثبت صراحة أن إجرام مرتكب الفعل مرتبط بتسمم مزمن مترتب عن تعاطي الكحول أو المخدرات؛",
                "3) أن يحكم بالعقوبة؛",
                "4) أن يأمر، علاوة على ذلك، بالوضع القضائي داخل مؤسسة للعلاج، لمدة لا تزيد عن سنتين.",
                "ويطبق على المحكوم عليه تدبير الوضع القضائي قبل تنفيذ العقوبة، ما لم تقرر المحكمة خلاف ذلك."
              ]
            },
            {
              "number": "82",
              "paragraphs": [
                "يلغى التدبير الصادر بالوضع القضائي في مؤسسة للعلاج عندما يتبين أن الأسباب التي استوجبته قد انتفت.",
                "إذا قرر رأي الطبيب، رئيس مؤسسة للعلاج، على أن يجعل حدا لهذا التدبير فإنه يعلم بذلك رئيس النيابة العمومية بمحكمة الاستئناف الذي يمكن له، داخل العشرة أيام الموالية لتوصله بالإعلام المذكور، أن يطعن في قرار الطبيب، وفقا لمقتضيات الفصل 77."
              ]
            },
            {
              "number": "83",
              "paragraphs": [
                "الوضع القضائي في مؤسسة فلاحية هو إلزام الحكم للمحكوم عليه من أجل جناية أو من أجل أية جنحة عقابها الحبس قانونا بأن يقيم في مركز مختص يكلف فيه بأشغال فلاحية وذلك إذا ظهر أن إجرامه مرتبط بتعوده على البطالة أو تبين أنه يتعيش عادة من أعمال غير مشروعة."
              ]
            },
            {
              "number": "84",
              "paragraphs": [
                "إذا ارتأى قضاء الحكم تطبيق مقتضيات الفصل السابق تعين عليه:",
                "1) أن يصرح بأن الفعل المتابع من أجله صادر عن المتهم؛",
                "2) أن يقرر صراحة أن هذا الفعل مرتبط بما اعتاده المحكوم عليه من البطالة أو أن المحكوم عليه يتعيش عادة من أعمال غير مشروعة؛",
                "3) أن يحكم بالعقوبة؛",
                "4) أن يأمر، علاوة على ذلك، بالوضع القضائي في مؤسسة فلاحية لمدة لا تقل عن ستة أشهر ولا تتجاوز سنتين.",
                "وتبدأ الإقامة بالمؤسسة الفلاحية بمجرد انتهاء تنفيذ العقوبة."
              ]
            },
            {
              "number": "85",
              "paragraphs": [
                "يلغى التدبير الصادر بالوضع القضائي المنصوص عليه في الفصل 83 عندما يمن سلوك المحكوم عليه عن صلاح حاله.",
                "ويصدر القرار بهذا الإلغاء، بناء على اقتراح من مدير المؤسسة الفلاحية، عن المحكمة التي كانت أمرت بالوضع القضائي.",
                "عندما يكون التدبير بالوضع القضائي صادرا عن محكمة للجنايات، فإن المحكمة الجنحية التي ساهمت في تأليف المحكمة الجنائية المذكورة هي التي تكون مختصة بالحكم بالإلغاء."
              ]
            },
            {
              "number": "86",
              "paragraphs": [
                "يجب على المحكمة أن تصرح بعدم الأهلية لمزاولة جميع الوظائف والخدمات العمومية في الأحوال التي نص فيها القانون على ذلك أو إذا تعلق الأمر بجريمة إرهابية.",
                "ويجوز الحكم بهذا التدبير في غير الأحوال المشار إليها، عندما تلاحظ المحكمة وتصرح بمقتضى نص خاص بالحكم أن الجريمة المرتكبة لها علاقة مباشرة بمزاولة الوظيفة أو الخدمة وأنها تكشف عن وجود فساد في خلق مرتكبها لا يتلاءم ومزاولة الوظيفة أو الخدمة على الوجه المرضي.",
                "ويحكم بعدم الأهلية لمدة لا يمكن أن تفوق عشر سنوات، ما لم ينص القانون على خلاف ذلك.",
                "وتحسب هذه المدة من اليوم الذي ينتهي فيه تنفيذ العقوبة."
              ]
            },
            {
              "number": "87",
              "paragraphs": [
                "يتعين الحكم بالمنع من مزاولة مهنة أو نشاط أو فن في حق المحكوم عليهم من أجل جناية أو جنحة، عندما يتبين للمحكمة أن الجريمة المرتكبة لها علاقة مباشرة بمزاولة المهنة أو النشاط أو الفن وأنه توجد قرائن قوية يخشى معها أن يصبح المحكوم عليه، إن هو تمادى على مزاولة ذلك، خطرا على أمن الناس أو صحتهم أو أخلاقهم أو مدخراتهم.",
                "ويحكم بهذا المنع لمدة لا يمكن أن تفوق عشر سنوات، ما لم ينص القانون على خلاف ذلك. وتحسب هذه المدة من اليوم الذي ينتهي فيه تنفيذ العقوبة.",
                "ويسوغ أن يتضمن الحكم بالمؤاخذة الأمر بتنفيذ هذا التدبير مؤقتا، بالرغم من استعمال أية طريق من طرق الطعن، عادية كانت أو غير عادية."
              ]
            },
            {
              "number": "88",
              "paragraphs": [
                "يتعين على المحكمة أن تحكم بسقوط الولاية الشرعية على الأولاد عندما تصدر حكما من أجل جناية أو جنحة معاقب عليها قانونا بالحبس ارتكبها أحد الأصول على شخص أحد أطفاله القاصرين، إذا ثبت لديها وصرحت بمقتضى نص خاص بالحكم أن السلوك العادي للمحكوم عليه يعرض أولاده القاصرين لخطر بدني أو خلقي.",
                "وهذا السقوط يمكن أن يشمل جميع حقوق الولاية أو بعضها، كما يسوغ أن يكون مقصورا على بعض الأولاد أو على واحد فقط.",
                "ويجوز أن يتضمن الحكم بالمؤاخذة الأمر بتنفيذ هذا التدبير مؤقتا، على الرغم من استعمال أية طريق من طرق الطعن، عادية كانت أو غير عادية."
              ]
            },
            {
              "number": "88-1",
              "paragraphs": [
                "في حالة الإدانة من أجل جرائم التحرش أو الاعتداء أو الاستغلال الجنسي أو سوء المعاملة أو العنف ضد المرأة أو القاصرين، أيا كانت طبيعة الفعل أو مرتكبه، يمكن للمحكمة الحكم بما يلي:",
                "منع المحكوم عليه من الاتصال بالضحية أو الاقتراب من مكان تواجدها، أو التواصل معها بأي وسيلة، لمدة لا تتجاوز خمس سنوات ابتداء من تاريخ انتهاء العقوبة المحكوم بها عليه أو من تاريخ صدور المقرر القضائي، إذا كانت العقوبة السالبة للحرية المحكوم بها موقوفة التنفيذ أو غرامة فقط أو عقوبة بديلة.",
                "يضع الصلح المبرم بين الزوجين حدا لتنفيذ المنع من الاتصال بالضحية.",
                "خضوع المحكوم عليه، خلال المدة المشار إليها في البند (1) أعلاه أو أثناء تنفيذ العقوبة السالبة للحرية، لعلاج نفسي ملائم.",
                "يمكن أن يتضمن المقرر القضائي بالمؤاخذة الأمر بتنفيذ هذا التدبير مؤقتا، بالرغم من استعمال أي طريق من طرق الطعن.",
                "يجوز للمحكمة أن تحكم بمنع المحكوم عليه من الاتصال بالضحية أو الاقتراب من مكان تواجدها أو التواصل معها بصفة نهائية، على أن تعلل قرارها بهذا الشأن."
              ]
            },
            {
              "number": "88-2",
              "paragraphs": [
                "يعد الطبيب المعالج تقريرا عن تطور حالة المحكوم عليه بالخضوع للعلاج، كل ثلاثة أشهر على الأقل، ويوجهه إلى قاضي تطبيق العقوبات، مؤكدا من خلاله تحسن سلوكه وتفادي عودته إلى نفس الأفعال التي أدين من أجلها.",
                "إذا استقر رأي الطبيب المعالج على إنهاء هذا التدبير قبل الوقت المحدد له، فإنه يخطر قاضي تطبيق العقوبات بواسطة تقرير منفصل يبرر ذلك.",
                "يجب إشعار الضحية بنتيجة تقرير الطبيب المعالج وبقرار القاضي المكلف بتطبيق العقوبة."
              ]
            },{
              "number": "88-3",
              "paragraphs": [
                "يجوز للنيابة العامة أو لقاضي التحقيق، أو للمحكمة عند الاقتضاء أو بطلب من الضحية في حالة المتابعة من أجل الجرائم المشار إليها في الفصل 88-1 أعلاه، الأمر بمنع الشخص المتابع من الاتصال بالضحية أو الاقتراب من مكان تواجدها، أو التواصل معها بأي وسيلة، ويبقى هذا المنع ساريا إلى حين بت المحكمة في القضية."
              ]
            }, {
              "number": "89",
              "paragraphs": [
                "يؤمر بالمصادرة كتدبير وقائي بالنسبة للأدوات والأشياء المحجوزة التي يكون صنعها أو استعمالها أو حملها أو حيازتها أو بيعها جريمة، ولو كانت تلك الأدوات والأشياء على ملك الغير، وحتى ولو لم يصدر حكم بالإدانة."
              ]
            },
            {
              "number": "90",
              "paragraphs": [
                "يجوز أن يؤمر بإغلاق محل تجاري أو صناعي نهائيا أو مؤقتا، إذا كان قد استعمل لارتكاب جريمة، إما بإساءة ما بعدم مراعاة النظم الإدارية، أو استغلال الإذن أو الرخصة المحصل عليها.",
                "وينتج عن الحكم بإغلاق محل تجاري أو صناعي، أو أي مؤسسة أخرى في الأحوال التي يجيز فيها القانون ذلك، منع المحكوم عليه من مزاولة نفس المهنة أو النشاط بذلك المحل.",
                "ويشمل المنع أفراد أسرة المحكوم عليه أو غيرهم ممن كراه أو سلمه إليه.",
                "كما يسري المنع في حق الشخص المعنوي أو الهيئة التي يكون المحكوم عليه قد باع لها المحل أو كان ينوب عنها أو كان يعمل لحسابها وقت ارتكاب الجريمة.",
                "ومدة الإغلاق المؤقت لا يجوز أن تقل عن عشرة أيام ولا أن تتجاوز ستة أشهر، ما لم ينص القانون على خلاف ذلك."
              ]
            },
            {
              "number": "91",
              "paragraphs": [
                "إذا صدرت على نفس الشخص عدة تدابير وقائية غير قابلة للتنفيذ في آن واحد، فإنه يتعين على المحكمة التي أصدرت آخر تدبير أن تحدد الترتيب الذي يتبع في التنفيذ.",
                "إلا أن الإيداع القضائي في مؤسسة لمعالجة الأمراض العقلية، أو الوضع القضائي في مؤسسة للعلاج، ينفذان حتما قبل غيرهما."
              ]
            },
            {
              "number": "92",
              "paragraphs": [
                "إذا صدر على شخص، خلال تنفيذه لتدبير سالب للحرية أو مقيد لها، حكم بعقوبة سالبة للحرية، من أجل جناية أو جنحة أخرى، فإنه يوقف تنفيذ التدبير الوقائي كيفما كان، ما عدا الوضع القضائي في مؤسسة للعلاج، وتنفذ على المحكوم عليه العقوبة الجديدة."
              ]
            }
          ]
        },
        {
          "name": "الباب الثاني",
          "title": "في أسباب انقضاء تدابير الوقاية والإعفاء منها أو إيقافها",
          "articles":[
          {
            "number": "93",
            "paragraphs": [
              "مع مراعاة مقتضيات الفصلين 103 و104 فإن أسباب انقضاء تدابير الوقاية أو الإعفاء منها أو إيقافها هي:",
              "موت المحكوم عليه؛",
              "العفو الشامل؛",
              "إلغاء القانون الجنائي المحكوم بمقتضاه؛",
              "العفو؛",
              "التقادم؛",
              "الإفراج الشرطي؛",
              "إعادة الاعتبار؛",
              "الصلح، عندما ينص القانون على ذلك صراحة.",
              "على أن وقف تنفيذ العقوبة لا أثر له في تدابير الوقاية."
            ]
          },
          {
            "number": "94",
            "paragraphs": [
              "موت المحكوم عليه لا يحول دون تنفيذ تدابير الوقاية العينية."
            ]
          },
          {
            "number": "95",
            "paragraphs": [
              "القانون المتعلق بالعفو الشامل عن الجريمة أو عن العقوبة الأصلية يوقف تنفيذ التدابير الوقائية الشخصية، دون التدابير العينية، ما لم يوجد نص صريح على خلاف ذلك."
            ]
          },
          {
            "number": "96",
            "paragraphs": [
              "إلغاء القانون الجنائي يضع حدا لتنفيذ تدابير الوقاية بالشروط المنصوص عليها في الفصل 9."
            ]
          },
          {
            "number": "97",
            "paragraphs": [
              "العفو الخاص بالعقوبة الأصلية لا يسري على تدابير الوقاية، إلا إذا ورد نص صريح في قرار العفو على خلاف ذلك."
            ]
          }, 
          {
            "number": "98",
            "paragraphs": [
              "تقادم العقوبة الأصلية لا ينتج عنه تقادم تدابير الوقاية."
            ]
          },
          {
            "number": "99",
            "paragraphs": [
              "التدبير الوقائي الذي لم ينفذ يسقط بالتقادم بمضي خمسة أعوام تبدأ إما من تاريخ تمام تنفيذ العقوبة السالبة للحرية تنفيذا فعليا، أو من تاريخ تمام تقادم العقوبة، أو دفع مبلغ الغرامة.",
              "إلا أنه إذا كانت مدة التدبير الوقائي المحكوم به تزيد على خمس سنوات فإن مدة التقادم تكون مساوية لمدة التدبير المحكوم به."
            ]
          },
          {
            "number": "100",
            "paragraphs": [
              "أحكام الفصلين 98 و99 لا تطبق على المنع من الإقامة إلا طبق القواعد المنصوص عليها في الفقرة الثانية من الفصل 73 من هذا القانون، والفصل 689 من المسطرة الجنائية."
            ]
          },
          {
            "number": "101",
            "paragraphs": [
              "قرار الإفراج الشرطي يجوز أن ينص فيه على تنفيذ التدابير الوقائية."
            ]
          },
          {
            "number": "102",
            "paragraphs": [
              "رد الاعتبار للمحكوم عليه، الذي يصدر وفق الشروط المقررة في الفصول 730 إلى 747 من المسطرة الجنائية، يضع حدا لتنفيذ تدابير الوقاية."
            ]
          },
          {
            "number": "103",
            "paragraphs": [
              "أسباب انقضاء تدابير الوقاية أو الإعفاء منها أو إيقافها، فيما عدا موت المحكوم عليه، لا تطبق على الإيداع القضائي في مؤسسة لعلاج الأمراض العقلية، ولا على الوضع القضائي في مؤسسة علاجية.",
              "وينقضي هذان التدبيران وفق الشروط المحددة في الفصلين 78 و82."
            ]
          },
          {
            "number": "104",
            "paragraphs": [
              "الحرمان من الولاية على الأبناء يخضع لأحكام الانقضاء والإعفاء والإيقاف الخاصة به."
            ]
          }
        ]
        }
      ]
    },
    {
      "name": "الجزء الثالث",
      "title": " في بيان ما يمكن أن يحكم به",
      "chapters":[
        {
          "number": "105",
          "paragraphs": [
            "كل حكم بعقوبة أو تدبير وقائي، يجب أن يبت في الصوائر ومصاريف الدعوى طبق القواعد المنصوص عليها في الفصلين 347 و349 من المسطرة الجنائية.",
            "ويجب أن يبت علاوة على ذلك، إذا اقتضى الحال، في طلبات الرد والتعويضات المدنية."
          ]
        },
        {
          "number": "106",
          "paragraphs": [
            "الرد هو إعادة الأشياء أو المبالغ أو الأمتعة المنقولة الموضوعة تحت يد العدالة إلى أصحاب الحق فيها.",
            "ويمكن للمحكمة أن تأمر بالرد ولو لم يطلبه صاحب الشأن."
          ]
        },
        {
          "number": "107",
          "paragraphs": [
            "يجوز للمحكمة علاوة على ذلك، بقرار معلل، بناء على طلب المجني عليه أن تأمر برد:",
            "المبالغ المتحصلة من بيع الأشياء أو الأمتعة المنقولة التي كان له الحق في استردادها عينا؛",
            "الأشياء أو الأمتعة المنقولة المتحصل عليها بواسطة ما نتج عن الجريمة، مع احترام حقوق الغير."
          ]
        },
        {
          "number": "108",
          "paragraphs": [
            "التعويضات المدنية المحكوم بها يجب أن تحقق للمتضرر تعويضا كاملا عن الضرر الشخصي الحال المحقق الذي أصابه مباشرة من الجريمة."
          ]
        },
        {
          "number": "109",
          "paragraphs": [
            "جميع المحكوم عليهم من أجل نفس الجناية أو نفس الجنحة أو نفس المخالفة يلزمون متضامنين بالغرامات والرد والتعويضات المدنية والصوائر، إلا إذا نص الحكم على خلاف ذلك."
          ]
        }
      ]
    }
  ]
}
