{
    "name": "الكتاب الثاني",
    "title": "في تطبيق العقوبات والتدابير الوقائية على المجرم",
    "sections": [
      {
        "name": "الجزء الأول",
        "title": "في الجريمة",
        "chapters": [
          {
            "name": "الباب الأول",
            "title": "في أنواع الجرائم",
            "articles": [
              {
                "number": "110",
                "paragraphs": [
                  "الجريمة هي فعل أو امتناع مخالف للقانون الجنائي ومعاقب عليه بمقتضاه."
                ]
              },
              {
                "number": "111",
                "paragraphs": [
                  "الجرائم إما جنايات أو جنح تأديبية أو جنح ضبطية أو مخالفات، على التفصيل الآتي:",
                  "الجريمة التي تدخل عقوبتها ضمن العقوبات المنصوص عليها في الفصل 16 تعد جناية.",
                  "الجريمة التي يعاقب عليها القانون بالحبس الذي يزيد حده الأقصى عن سنتين تعد جنحة تأديبية.",
                  "الجريمة التي يعاقب عليها القانون بحبس حده الأقصى سنتان أو أقل أو بغرامة تزيد عن مائتي درهم تعد جنحة ضبطية.",
                  "الجريمة التي يعاقب عليها القانون بإحدى العقوبات المنصوص عليها في الفصل 18 تعد مخالفة."
                ]
              },
              {
                "number": "112",
                "paragraphs": [
                  "لا يتغير نوع الجريمة إذا حكم بعقوبة متعلقة بنوع آخر من أنواع الجرائم لسبب تخفيف أو لحالة العود."
                ]
              },
              {
                "number": "113",
                "paragraphs": [
                  "يتغير نوع الجريمة إذا نص القانون على عقوبة متعلقة بنوع آخر من أنواع الجرائم لسبب ظروف التشديد."
                ]
              }
            ]
          },
          {
            "name": "الباب الثاني",
            "title": "في المحاولة",
            "articles": [
              {
                "number": "114",
                "paragraphs": [
                  "كل محاولة ارتكاب جناية بدئت بالشروع في تنفيذها أو بأعمال لا لبس فيها، تهدف مباشرة إلى ارتكابها، إذا لم يوقف تنفيذها أو لم يحصل الأثر، تعتبر كالجناية التامة ويعاقب مرتكبها عليها بهذه الصفة، إلا لظروف خارجة عن إرادة مرتكبها."
                ]
              },
              {
                "number": "115",
                "paragraphs": [
                  "لا يعاقب على محاولة الجنحة إلا بمقتضى نص خاص في القانون."
                ]
              },
              {
                "number": "116",
                "paragraphs": [
                  "محاولة المخالفة لا يعاقب عليها مطلقا."
                ]
              },
              {
                "number": "117",
                "paragraphs": [
                  "يعاقب على المحاولة حتى في الأحوال التي يكون الغرض فيها من الجريمة غير ممكن بسبب ظروف واقعية يجهلها الفاعل."
                ]
              }
            ]
          },
          {
            "name": "الباب الثالث",
            "title": "في تعدد الجرائم",
            "articles": [
              {
                "number": "118",
                "paragraphs": [
                  "الفعل الواحد الذي يقبل أوصافا متعددة يجب أن يوصف بأشدها."
                ]
              },
              {
                "number": "119",
                "paragraphs": [
                  "تعدد الجرائم هو حالة ارتكاب شخص جرائم متعددة في آن واحد أو في أوقات متوالية دون أن يفصل بينها حكم غير قابل للطعن."
                ]
              },
              {
                "number": "120",
                "paragraphs": [
                  "في حالة تعدد جنايات أو جنح إذا نظرت في وقت واحد أمام محكمة واحدة، يحكم بعقوبة واحدة سالبة للحرية لا تتجاوز مدتها الحد الأقصى المقرر قانونا لمعاقبة الجريمة الأشد.",
                  "أما إذا صدر بشأنها عدة أحكام سالبة للحرية بسبب تعدد المتابعات، فإن العقوبة الأشد هي التي تنفذ.",
                  "غير أن العقوبات المحكوم بها، إذا كانت من نوع واحد، جاز للقاضي، بقرار معلل، أن يأمر بضمها كلها أو بعضها بشرط ألا تتجاوز الحد الأقصى المقرر في القانون للجريمة الأشد."
                ]
              },
              {
                "number": "121",
                "paragraphs": [
                  "تضم العقوبات المالية سواء كانت أصلية أو مضافة إلى عقوبة سالبة للحرية، إلا إذا قرر الحكم خلاف ذلك بعبارة صريحة."
                ]
              },
              {
                "number": "122",
                "paragraphs": [
                  "في حالة تعدد الجنايات أو الجنح، تضم العقوبات الإضافية وتدابير الوقاية، ما لم يقرر الحكم خلاف ذلك بنص معلل.",
                  "إلا أن التدابير الوقائية التي لا تقبل بطبيعتها أن تنفذ معا في نفس الوقت يراعى في ترتيب تنفيذها مقتضيات الفصل 91."
                ]
              },
              {
                "number": "123",
                "paragraphs": [
                  "ضم العقوبات لزومي دائما في المخالفات."
                ]
              }
            ]
          },
          {
            "name": "الباب الرابع",
            "title": "في الأسباب المبررة التي تمحو الجريمة",
            "articles": [
              {
                "number": "124",
                "paragraphs": [
                  "لا جناية ولا جنحة ولا مخالفة في الأحوال الآتية:",
                  "إذا كان الفعل قد أوجبه القانون وأمرت به السلطة الشرعية؛",
                  "إذا اضطر الفاعل ماديا إلى ارتكاب الجريمة، أو كان في حالة استحال عليه معها، استحالة مادية، اجتنابها، وذلك لسبب خارجي لم يستطع مقاومته؛",
                  "إذا كانت الجريمة قد استلزمتها ضرورة حالة للدفاع الشرعي عن نفس الفاعل أو غيره أو عن ماله أو مال غيره، بشرط أن يكون الدفاع متناسبا مع خطورة الاعتداء."
                ]
              },
              {
                "number": "125",
                "paragraphs": [
                  "تعتبر الجريمة نتيجة الضرورة الحالة للدفاع الشرعي في الحالتين الآتيتين:",
                  "القتل أو الجرح أو الضرب الذي يرتكب ليلا لدفع تسلق أو كسر حاجز أو حائط أو مدخل دار أو منزل مسكون أو ملحقاتهما؛",
                  "الجريمة التي ترتكب دفاعا عن نفس الفاعل أو نفس غيره ضد مرتكب السرقة أو النهب بالقوة."
                ]
              }
            ]
          }
          
          
          
        ]
      },
      {
        "name": "الجزء الثاني",
        "title": "في المجرم",
        "articles": [
          {
            "number": "126",
            "paragraphs": [
              "تطبق العقوبات والتدابير الوقائية المقررة في هذه المجموعة على الأشخاص الذاتيين."
            ]
          },
          {
            "number": "127",
            "paragraphs": [
              "لا يمكن أن يحكم على الأشخاص المعنوية إلا بالعقوبات المالية والعقوبات الإضافية الواردة في الأرقام 5 و6 و7 من الفصل 36، ويجوز أيضا أن يحكم عليها بالتدابير الوقائية العينية الواردة في الفصل 62."
            ]
          }
        ],
        "chapters": [
          {
            "name": "الباب الأول",
            "title": "في المساهمة في الجريمة والمشاركة فيها",
            "articles": [
              {
                "number": "128",
                "paragraphs": [
                  "يعتبر مساهما في الجريمة كل من ارتكب شخصيا عملا من أعمال التنفيذ المادي لها."
                ]
              },
              {
                "number": "129",
                "paragraphs": [
                  "يعتبر مشاركا في الجناية أو الجنحة من لم يساهم مباشرة في تنفيذها ولكنه أتى أحد الأفعال الآتية:",
                  "أمر بارتكاب الفعل أو حرض على ارتكابه، وذلك بهبة أو وعد أو تهديد أو إساءة استغلال سلطة أو ولاية أو تحايل أو تدليس إجرامي؛",
                  "قدم أسلحة أو أدوات أو أية وسيلة أخرى استعملت في ارتكاب الفعل، مع علمه بأنها ستستعمل لذلك؛",
                  "ساعد أو أعان الفاعل أو الفاعلين للجريمة في الأعمال التحضيرية أو الأعمال المسهلة لارتكابها، مع علمه بذلك؛",
                  "تعود على تقديم مسكن أو ملجأ أكثر من مرة للأشرار الذين يمارسون اللصوصية أو مكان للاجتماع، لواحد أو أكثر، أو العنف ضد أمن الدولة أو الأمن العام أو ضد الأشخاص أو الأموال مع علمه بسلوكهم الإجرامي.",
                  "أما المشاركة في المخالفات فلا عقاب عليها مطلقا."
                ]
              },
              {
                "number": "130",
                "paragraphs": [
                  "المشارك في جناية أو جنحة يعاقب بالعقوبة المقررة لهذه الجناية أو الجنحة.",
                  "ولا تؤثر الظروف الشخصية التي ينتج عنها تشديد أو تخفيف أو إعفاء من العقوبة إلا بالنسبة لمن تتوفر فيه.",
                  "أما الظروف العينية المتعلقة بالجريمة، والتي تغلظ العقوبة أو تخفضها، فإنها تنتج مفعولها بالنسبة لجميع المساهمين أو المشاركين في الجريمة ولو كانوا يجهلونها."
                ]
              },
              {
                "number": "131",
                "paragraphs": [
                  "من حمل شخصا غير معاقب، بسبب ظروفه أو صفته الشخصية، على ارتكاب جريمة، فإنه يعاقب بعقوبة الجريمة التي ارتكبها هذا الشخص."
                ]
              }
            ]
          },
          {
            "name": "الباب الثاني",
            "title": "في المسؤولية الجنائية",
            "branches": [
              {
                "name": "الفرع الأول",
                "title": "في الأشخاص المسؤولين",
                "articles": [
                  {
                    "number": "132",
                    "paragraphs": [
                      "متى يكون مسؤولا شخصيا عن:",
                      "كل شخص سليم العقل قادر على التمييز يكون مسؤولا شخصيا عن الجرائم التي يرتكبها.",
                      "الجنايات أو الجنح التي يكون مشاركا في ارتكابها.",
                      "محاولات الجنايات.",
                      "محاولات بعض الجنح ضمن الشروط المقررة في القانون للعقاب عليها.",
                      "ولا يستثنى من هذا المبدأ إلا الحالات التي ينص فيها القانون صراحة على خلاف ذلك."
                    ]
                  }
                ]
              },
              {
                "number": "133",
                "paragraphs": [
                  "الجنايات والجنح لا يعاقب عليها إلا إذا ارتكبت عمدا.",
                  "إلا أن الجنح التي ترتكب خطأ يعاقب عليها بصفة استثنائية في الحالات الخاصة التي ينص عليها القانون.",
                  "أما المخالفات فيعاقب عليها حتى ولو ارتكبت خطأ، فيما عدا الحالات التي يستلزم فيها القانون صراحة قصد الإضرار."
                ]
              }
            ]
          },
          {
            "name": "الفرع الثاني",
            "title": "في العاهات العقلية",
            "articles": [
              {
                "number": "134",
                "paragraphs": [
                  "لا يكون مسؤولا، ويجب الحكم بإعفائه، من كان وقت ارتكابه الجريمة المنسوبة إليه، في حالة يستحيل عليه معها الإدراك أو الإرادة نتيجة خلل في قواه العقلية.",
                  "وفي الجنايات والجنح، يحكم بالإيداع القضائي في مؤسسة لعلاج الأمراض العقلية وفق الشروط المقررة في الفصل 76.",
                  "أما في مواد المخالفات، فإن الشخص الذي يحكم بإعفائه إذا كان خطرا على النظام العام يسلم إلى السلطة الإدارية."
                ]
              }
            ]
          }
          
        ]
      }
      
      
    ]
  }
  