 {
  "name": "مبادئ عامة",
  "title": "الفصول 1 – 12",
  "articles": [
    {
      "number": "1",
      "paragraphs": [
        "يحدد التشريع الجنائي أفعال الإنسان التي يعدها جرائم، بسبب ما تحدثه من اضطراب اجتماعي، ويوجب زجر مرتكبيها بعقوبات أو بتدابير وقائية."
      ]
    },
    {
      "number": "2",
      "paragraphs": [
        "لا يسوغ لأحد أن يعتذر بجهل التشريع الجنائي."
      ]
    },
    {
      "number": "3",
      "paragraphs": [
        "لا يسوغ مؤاخذة أحد على فعل لا يعد جريمة بصريح القانون ولا معاقبته بعقوبات لم يقررها القانون."
      ]
    },
    {
      "number": "4",
      "paragraphs": [
        "لا يؤاخذ أحد على فعل لم يكن جريمة بمقتضى القانون الذي كان ساريا وقت ارتكابه."
      ]
    },
    {
      "number": "5",
      "paragraphs": [
        "لا يسوغ مؤاخذة أحد على فعل لم يعد يعتبر جريمة بمقتضى قانون صدر بعد ارتكابه. فإن كان قد صدر حكم بالإدانة، فإن العقوبات المحكوم بها، أصلية كانت أو إضافية، يجعل حد لتنفيذها."
      ]
    },
    {
      "number": "6",
      "paragraphs": [
        "في حالة وجود عدة قوانين سارية المفعول، بين تاريخ ارتكاب الجريمة والحكم النهائي بشأنها، يتعين تطبيق القانون الأصلح للمتهم."
      ]
    },
    {
      "number": "7",
      "paragraphs": [
        "لا تشمل مقتضيات الفصلين 5 و6 القوانين المؤقتة التي تظل، ولو بعد انتهاء العمل بها، سارية على الجرائم المرتكبة خلال مدة تطبيقها."
      ]
    },
    {
      "number": "8",
      "paragraphs": [
        "لا يجوز الحكم بأي تدبير وقائي، إلا في الأحوال وطبق الشروط المقررة في القانون.",
        "ولا يحكم إلا بالتدابير المنصوص عليها في القانون النافذ وقت صدور الحكم."
      ]
    },
    {
      "number": "9",
      "paragraphs": [
        "ينتهي تنفيذ التدبير الوقائي، إذا صدر قانون جديد يزيل صبغة الجريمة عن الفعل الذي استوجبه، أو إذا صدر قانون يلغي ذلك التدبير."
      ]
    },
    {
      "number": "10",
      "paragraphs": [
        "يسري التشريع الجنائي المغربي على كل من يوجد بإقليم المملكة من وطنيين وأجانب وعديمي الجنسية، مع مراعاة الاستثناءات المقررة في القانون العام الداخلي والقانون الدولي."
      ]
    },
    {
      "number": "11",
      "paragraphs": [
        "يدخل ضمن إقليم المملكة، السفن والطائرات المغربية أينما وجدت، فيما عدا الحالات التي تكون فيها خاضعة لتشريع أجنبي بمقتضى القانون الدولي."
      ]
    },
    {
      "number": "12",
      "paragraphs": [
        "يطبق التشريع الجنائي المغربي على الجرائم المرتكبة خارج المملكة، إذا كانت من اختصاص المحاكم الزجرية المغربية حسب الفصول 751 إلى 756 من المسطرة الجنائية."
      ]
    }
  ]
}
