{
    "name": "الكتاب السابع",
    "title": "الاختصاص المتعلق ببعض الجرائم المرتكبة خارج المملكة والتعاون الدولي في الميدان الجنائي",
    "sections": [
      {
        "name": "القسم الأول",
        "title": "أحكام عامة",
        "articles": [
          {
            "number": "704",
            "paragraphs": [
              "تختص محاكم المملكة المغربية بالنظر في كل جريمة ترتكب في الأراضي المغربية أيا كانت جنسية مرتكبيها.",
              "كل جريمة يتم داخل المغرب ارتكاب أحد الأفعال التي تشكل عنصرا من عناصر تكوينها، تعتبر كما لو ارتكبت في أراضي المملكة.",
              "يمتد اختصاص المحاكم المغربية فيما يرجع إلى البت في الفعل الرئيسي إلى سائر أفعال المشاركة أو الإخفاء، ولو في حالة ارتكابها خارج المملكة ومن طرف أجانب."
            ]
          },
          {
            "number": "705",
            "paragraphs": [
              "تختص محاكم المملكة بالنظر في الجنايات أو الجنح المرتكبة في أعالي البحار على متن سفن تحمل العلم المغربي، وذلك أيا كانت جنسية مرتكبي هذه الجرائم.",
              "تختص المحاكم المغربية أيضا بالنظر في الجنايات أو الجنح المرتكبة داخل ميناء بحري مغربي على متن سفينة تجارية أجنبية.",
              "يرجع الاختصاص إلى المحكمة الكائن بدائرتها أول ميناء مغربي ترسو به السفينة، أو المحكمة التي وقع بدائرتها إلقاء القبض على الفاعل إذا ألقي عليه القبض فيما بعد بالمغرب."
            ]
          },
          {
            "number": "706",
            "paragraphs": [
              "تختص محاكم المملكة بالنظر في الجنايات أو الجنح المرتكبة على متن طائرات مغربية، أيا كانت جنسية مرتكب الجريمة.",
              "تختص أيضا بالنظر في الجنايات أو الجنح المرتكبة على متن طائرات أجنبية، إذا كان مرتكب الجريمة أو المجني عليه من جنسية مغربية أو إذا حطت الطائرة بالمغرب بعد ارتكاب الجناية أو الجنحة.",
              "يكون الاختصاص لمحاكم المكان الذي حطت فيه الطائرة في حالة إلقاء القبض على الفاعل أثناء توقف الطائرة، ويكون الاختصاص لمحكمة مكان إلقاء القبض على الفاعل إذا ألقي عليه القبض فيما بعد بالمغرب."
            ]
          }
        ]
      },
      {
        "name": "القسم الثاني",
        "title": "الاختصاص المتعلق ببعض الجرائم المرتكبة خارج المملكة",
        "articles": [
          {
            "number": "707",
            "paragraphs": [
              "كل فعل له وصف جناية في نظر القانون المغربي ارتكب خارج المملكة المغربية من طرف مغربي، يمكن المتابعة من أجله والحكم فيه بالمغرب.",
              "غير أنه لا يمكن أن يتابع المتهم ويحاكم إلا إذا عاد إلى الأراضي المغربية، ولم يثبت أنه صدر في حقه في الخارج حكم اكتسب قوة الشيء المقضي به وأنه في حالة الحكم بإدانته، قضى العقوبة المحكوم بها عليه أو تقادمت أو حصل على عفو بشأنها."
            ]
          },
          {
            "number": "708",
            "paragraphs": [
              "كل فعل له وصف جنحة في نظر القانون المغربي ارتكب خارج المملكة المغربية من طرف مغربي، يمكن المتابعة من أجله والحكم فيه بالمغرب.",
              "لا يمكن أن يتابع المتهم أو يحاكم، إلا مع مراعاة الحالات المنصوص عليها في الفقرة الثانية من المادة 707.",
              "علاوة على ذلك، فإنه في حالة ارتكاب جنحة ضد شخص، لا يمكن إجراء المتابعة إلا بطلب من النيابة العامة بعد توصلها بشكاية من الطرف المتضرر أو بناء على إبلاغ صادر من سلطات البلد الذي ارتكبت فيه الجنحة."
            ]
          },
          {
            "number": "709",
            "paragraphs": [
              "يمكن أن تجري المتابعة أو يصدر الحكم في الحالات المنصوص عليها في المادتين 707 و708 أعلاه وفي الفقرة الثانية من المادة 711 بعده ولو لم يكتسب المتهم الجنسية المغربية إلا بعد ارتكابه الجناية أو الجنحة."
            ]
          },
          {
            "number": "710",
            "paragraphs": [
              "كل أجنبي يرتكب خارج أراضي المملكة جناية أو جنحة يعاقب عليها القانون المغربي إما بصفته فاعلا أصليا أو مساهما أو مشاركا يمكن متابعته والحكم عليه حسب مقتضيات القانون المغربي، إذا كان ضحية هذه الجناية أو الجنحة من جنسية مغربية.",
              "غير أنه لا يمكن أن يتابع المتهم أو يحاكم إذا أثبت أنه حكم عليه في الخارج من أجل هذا الفعل بحكم مكتسب قوة الشيء المقضي به، وفي حالة الحكم بإدانته، يتعين عليه أن يثبت أنه قضى العقوبة المحكوم بها أو تقادمت."
            ]
          },
          {
            "number": "711-1",
            "paragraphs": [
              "بالرغم من أي مقتضى قانوني مخالف، يتابع ويحاكم أمام المحاكم المغربية المختصة كل مغربي أو أجنبي ارتكب خارج المملكة بصفته فاعلا أصليا أو مساهما أو مشاركا، جريمة إرهابية سواء كانت تستهدف أو لا تستهدف الإضرار بالمملكة المغربية أو بمصالحها.",
              "غير أنه إذا كانت الأفعال الإرهابية لا تستهدف الإضرار بالمملكة المغربية أو بمصالحها وارتكبت خارج المملكة من قبل أجنبي بصفته فاعلا أصليا أو مساهما أو مشاركا، فإنه لا يمكن متابعته أو محاكمته إلا إذا وجد فوق التراب الوطني.",
              "لا يمكن أن تجري المتابعة أو يصدر الحكم إذا أثبت المتهم أنه حكم عليه بالخارج من أجل نفس الفعل بحكم حائز لقوة الشيء المقضي به، وأدلى في حالة إدانته بما يثبت أنه قضى العقوبة المحكوم بها عليه أو أنها تقادمت."
            ]
          },
          {
            "number": "711-2",
            "paragraphs": [
              "يمكن متابعة كل أجنبي موضوع طلب تسليم والحكم عليه من قبل المحاكم المغربية، إذا ارتكب خارج المملكة جنايات أو جنحا يعاقب عليها القانون المغربي، وتعذر تسليمه إلى الدولة الطالبة لأحد الاعتبارات المشار إليها في البندين 2 و3 من المادة 721 أدناه.",
              "تجري المتابعة بناء على شكاية رسمية من الدولة الطالبة مدعمة بوسائل الإثبات المتوفرة، أو بعد موافقتها على اعتبار ملف التسليم بمثابة شكاية رسمية."
            ]
          },
          {
            "number": "712",
            "paragraphs": [
              "في الحالات المشار إليها في هذا الكتاب، تكون المحكمة المختصة، مع مراعاة مقتضيات المادتين 705 و706 أعلاه، هي محكمة المكان الذي يقيم فيه المشتبه فيه أو محكمة آخر محل معروف لإقامته بالمغرب أو المحل الذي ضبط فيه أو محل إقامة ضحية الجريمة.",
              "في حالة عدم وجود أحد موجبات الاختصاص المشار إليها في الفقرة الأولى من هذه المادة يعود الاختصاص لمحاكم الرباط."
            ]
          }
        ]
      },
      {
        "name": "القسم الثالث",
        "title": "العلاقات القضائية مع السلطات الأجنبية",
        "chapters": [
          {
            "name": "الباب الأول",
            "title": "أحكام عامة",
            "articles": [
              {
                "number": "713",
                "paragraphs": [
                  "تكون الأولوية للاتفاقيات الدولية على القوانين الوطنية فيما يخص التعاون القضائي مع الدول الأجنبية.",
                  "لا تطبق مقتضيات هذا الباب، إلا في حالة عدم وجود اتفاقيات أو في حالة خلو تلك الاتفاقيات من الأحكام الواردة به."
                ]
              }
            ]
          },
          {
            "name": "الباب الأول مكرر",
            "title": "الاختراق وفرق البحث المشتركة",
            "articles": [
              {
                "number": "1-713",
                "paragraphs": [
                  "يمكن لضباط وأعوان الشرطة القضائية الأجانب أن يباشروا عملية اختراق داخل التراب الوطني تحت إشراف ومراقبة ضابط شرطة قضائية مغربي استنادا إلى طلب رسمي صادر عن السلطات القضائية الأجنبية المختصة لهذه الغاية.",
                  "يحيل وزير العدل طلب مباشرة عملية الاختراق إلى رئيس النيابة العامة الذي يحيله إلى الوكيل العام للملك لدى محكمة الاستئناف المختص قصد التنفيذ.",
                  "لا يمكن أن تمنح الموافقة على الطلب إلا إذا كان الضابط أو العون الأجنبي من الضباط أو الأعوان المؤهلين في بلدهم لممارسة مهام مماثلة لتلك المسندة للضباط الوطنيين المختصين.",
                  "تنفذ عملية الاختراق وفقا لمقتضيات الفرع الثاني من الباب الثالث من القسم الثاني من الكتاب الأول من هذا القانون."
                ]
              },
              {
                "number": "2-713",
                "paragraphs": [
                  "يمكن لضباط وأعوان الشرطة القضائية الأجانب وفقا للشروط المنصوص عليها في المادة 1-713 أعلاه، وبإذن من السلطات الوطنية لبلدهم، أن يشاركوا تحت إشراف ومراقبة ضابط شرطة قضائية مغربي في عمليات اختراق تنفذ فوق التراب الوطني في إطار مسطرة قضائية وطنية."
                ]
              },
              {
                "number": "3-713",
                "paragraphs": [
                  "يمكن للوكيل العام للملك لدى محكمة الاستئناف أن يأذن بعد موافقة رئيس النيابة العامة لضباط وأعوان الشرطة القضائية المغاربة بتنفيذ عمليات اختراق بالخارج وفقا للشروط المحددة في هذا الباب وفي الفرع الثاني من الباب الثالث من القسم الثاني من الكتاب الأول من هذا القانون، بموافقة السلطات الأجنبية التي تنفذ عملية الاختراق على أراضيها.",
                  "يحال الطلب إلى وزير العدل عبر رئيس النيابة العامة قصد تبليغه للسلطات الأجنبية بالطريقة الدبلوماسية، ما لم تنص اتفاقية على خلاف ذلك."
                ]
              },
              {
                "number": "4-713",
                "paragraphs": [
                  "يمكن للسلطات القضائية المختصة، في إطار اتفاقيات التعاون القضائي أو في إطار المعاملة بالمثل، تكوين فرق مشتركة للبحث سواء في إطار مسطرة قضائية وطنية تتطلب إنجاز أبحاث معقدة وإمكانيات ضخمة وتهم المملكة المغربية ودولا أخرى، أو عندما تباشر مجموعة من الدول أبحاثا في شأن جرائم تتطلب عملا منسقا ومركزا بين هذه الدول."
                ]
              },
              {
                "number": "5-713",
                "paragraphs": [
                  "يمكن لضباط الشرطة القضائية الأجانب المعينين وفقا للمادة 4-713 أعلاه من قبل دولة أجنبية لدى إحدى الفرق المشتركة للبحث، بعد موافقة السلطات المختصة في الدولة أو الدول المعنية وفي حدود المهام المرتبطة بوضعيتهم، أن يقوموا تحت إشراف السلطات القضائية المختصة ورئاسة ضباط شرطة قضائية مغاربة بتنفيذ مهامهم فوق مجموع التراب الوطني وإجراء العمليات الآتية:",
                  "معاينة جميع الجنايات والجنح والمخالفات وتحرير محاضر بشأنها وفق الشكل الذي يتطلبه قانونهم الوطني عند الضرورة؛",
                  "تلقي التصريحات المدلى بها أمامهم من قبل أي شخص بإمكانه تقديم معلومات حول الوقائع المعاينة وتحرير محاضر بشأنها وفق الشكل الذي يتطلبه قانونهم الوطني عند الضرورة؛",
                  "مساعدة ضباط الشرطة القضائية المغربية في أداء مهامهم؛",
                  "القيام بعمليات المراقبة والاختراق وفقا للشروط المحددة في هذا القانون.",
                  "يمارس ضباط الشرطة القضائية الأجانب بفرق البحث المشتركة هذه المهام في حدود العمليات التي كلفوا بالقيام بها.",
                  "لا يمكن لضابط الشرطة القضائية المغربي تفويض السلط التي يتوفر عليها بصفته هذه لأعضاء فريق البحث المشترك.",
                  "تضم نسخة من المحاضر المنجزة إلى المسطرة الجارية أمام القضاء المغربي ويتعين أن تحرر باللغة العربية أو تترجم إليها."
                ]
              },
              {
                "number": "6-713",
                "paragraphs": [
                  "يمكن للوكيل العام للملك لدى محكمة الاستئناف أن يأذن بعد موافقة رئيس النيابة العامة لضباط الشرطة القضائية المغاربة بالمشاركة بالخارج في فرق مشتركة للبحث تنفيذا لمقتضيات هذا الباب، إذا وافقت على ذلك السلطات الأجنبية التي يجري البحث في إقليمها.",
                  "يحال الطلب إلى وزير العدل بواسطة رئيس النيابة العامة قصد تبليغه للسلطات الأجنبية بالطريقة الدبلوماسية ما لم تنص اتفاقية على خلاف ذلك."
                ]
              }
            ]
          },
          {
            "name": "الباب الثاني",
            "title": "التعاون الدولي في الميدان الجنائي",
            "articles": [
              {
                "number": "714",
                "paragraphs": [
                  "يمكن للقضاة المغاربة سواء تعلق الأمر بقضاة النيابة العامة أو التحقيق أو الحكم أن يصدروا إنابات قضائية قصد تنفيذها خارج أراضي المملكة.",
                  "ويمكنهم، إذا اقتضت الضرورة ذلك، أن يطلبوا حضور عمليات إنجازها بصفتهم ملاحظين مرافقين بضباط وأعوان الشرطة القضائية ومترجمين، أو إنابة هؤلاء للحضور بدلا عنهم.",
                  "توجه الإنابات القضائية إلى رئيس النيابة العامة الذي يحيلها إلى وزير العدل قصد تبليغها بالطرق الدبلوماسية، ما لم توجد اتفاقيات تقضي بخلاف ذلك أو في حالة الاستعجال حيث يمكن توجيهها مباشرة للجهة المختصة بتنفيذها، وفي هذه الحالة، يتعين توجيه نسخة من الإنابة والوثائق في نفس الوقت إلى وزير العدل لتبليغها بالطرق الدبلوماسية."
                ]
              },
              {
                "number": "715",
                "paragraphs": [
                  "تنفذ الإنابات القضائية الدولية الواردة من الخارج بنفس الطريقة التي تنفذ بها الإنابات الصادرة داخل أراضي المملكة وطبقاً للتشريع المغربي.",
                  "يحيل وزير العدل الإنابات القضائية التي يتوصل بها من السلطات القضائية الأجنبية إلى رئيس النيابة العامة الذي يحيلها على الجهات القضائية المختصة.",
                  "يمكن لوزير العدل، بعد استطلاع رأي رئيس النيابة العامة، أن يأذن لممثلي السلطة الأجنبية بحضور تنفيذ الإنابات القضائية كملاحظين.",
                  "غير أن الإنابة القضائية لا تنفذ إذا لم تكن من اختصاص السلطات القضائية المغربية، أو إذا كان تنفيذها من شأنه المساس بسيادة المملكة المغربية أو أمنها أو نظامها العام أو مصالحها الأخرى الأساسية.",
                  "توجه الإنابات القضائية الواردة من الخارج بالطرق الدبلوماسية ويمكن – في حالة الاستعجال – أن توجه مباشرة إلى القضاة المختصين.",
                  "غير أنه في حالة توجيهها بصفة مباشرة، يتعين ألا تعلم السلطة الأجنبية الطالبة بنتيجتها إلا بعد التوصل بالنسخة المرفوعة بالوسائل الدبلوماسية.",
                  "يتم إرجاع الإنابات القضائية إلى الجهات الطالبة بالطريق الدبلوماسي."
                ]
              }
            ]
          },
          {
            "name": "الباب الثالث",
            "title": "الاعتراف ببعض الأحكام الزجرية الأجنبية",
            "articles": [
              {
                "number": "716",
                "paragraphs": [
                  "إذا تبين لمحكمة زجرية من محاكم المملكة المغربية أثناء إجراء متابعة من أجل جناية أو جنحة عادية، بعد اطلاعها على السجل العدلي لمرتكب الجريمة، أنه سبق الحكم عليه من طرف محكمة أجنبية من أجل جناية أو جنحة عادية يعاقب عليها كذلك القانون المغربي، أمكن لها أن تضمن في حكمها مقتضيات خاصة معللة تفيد تحققها من صحة الحكم الزجري الأجنبي وأن تأخذ بهذا الحكم كعنصر من عناصر العود إلى الجريمة."
                ]
              },
              {
                "number": "717",
                "paragraphs": [
                  "لا يمكن أن تنفذ بالمغرب المقتضيات المدنية الواردة في مقرر صادر عن محكمة زجرية أجنبية، ما لم تعط لها الصيغة التنفيذية بمقتضى مقرر تصدره محكمة مدنية مغربية تطبيقاً لمقتضيات قانون المسطرة المدنية."
                ]
              }
            ]
          },
          {
            "name": "الباب الرابع",
            "title": "التسليم",
            "articles": [
              {
                "number": "718",
                "paragraphs": [
                  "تخول مسطرة التسليم لدولة أجنبية، الحصول من الدولة المغربية على تسليم مشتبه فيه أو متهم أو محكوم عليه غير مغربي يوجد في أراضي المملكة ويكون موضوع بحث جنائي أو متابعة جارية باسم الدولة الطالبة أو محكوم عليه بعقوبة صادرة من إحدى محاكمها.",
                  "غير أن التسليم لا يقبل إلا إذا كانت الجريمة التي يستند إليها الطلب قد ارتكبت:",
                  "إما بأرض الدولة الطالبة من طرف أحد مواطنيها أو من شخص أجنبي؛",
                  "وإما خارج أراضيها من أحد مواطنيها؛",
                  "وإما خارج أراضيها من أجنبي غير مغربي، إذا كانت الجريمة المنسوبة إليه تدخل في عداد الجرائم التي يجيز التشريع المغربي إجراء متابعة في شأنها بالمغرب ولو ارتكبها أجنبي بالخارج."
                ]
              },
              {
                "number": "719",
                "paragraphs": [
                  "لا يمكن أن يسلم لدولة أجنبية أي شخص إذا لم يكن موضوع بحث جنائي أو متابعا أو محكوما عليه بعقوبة من أجل أفعال ينص عليها هذا القانون."
                ]
              },
              {
                "number": "720",
                "paragraphs": [
                  "يمكن الاعتداد بالأفعال الآتية سواء للمطالبة بالتسليم أو الموافقة عليه:",
                  "1- جميع الأفعال التي يعاقب عليها قانون الدولة الطالبة بعقوبات جنائية؛",
                  "2- الأفعال التي يعاقب عليها قانون الدولة الطالبة بعقوبات جنحية سالبة للحرية، إذا كان الحد الأقصى للعقوبة المقررة بمقتضى ذلك القانون لا يقل عن سنة واحدة أو إذا تعلق الأمر بشخص محكوم عليه، عندما تكون مدة العقوبة المحكوم بها عليه من إحدى محاكم الدولة الطالبة تعادل أو تفوق سنة.",
                  "لا يوافق بأي حال من الأحوال على التسليم إذا لم يكن الفعل معاقبا عليه حسب القانون المغربي بعقوبة جنائية أو جنحية.",
                  "تطبق القواعد السابقة على الأفعال المكونة لمحاولة الجريمة أو المشاركة فيها، بشرط أن يكون معاقبا عليها حسب قانون الدولة الطالبة وحسب القانون المغربي.",
                  "إذا استند طلب التسليم إلى عدة أفعال متميزة يعاقب على كل واحد منها حسب قانون الدولة الطالبة والقانون المغربي بعقوبة سالبة للحرية وكان بعض هذه الأفعال يعاقب عليها بعقوبة تقل عن سنة حبسا، فإن التسليم يقبل بالنسبة لمجموع هذه الجرائم إذا كانت العقوبة القصوى المقررة لها جميعا حسب قانون الدولة الطالبة تبلغ على الأقل سنتين حبسا.",
                  "إذا كان الشخص المطلوب تسليمه قد سبق الحكم عليه في بلد ما من أجل ارتكابه جريمة عادية بعقوبة نهائية تعادل مدتها أو تفوق سنة حبسا، فإن التسليم يقبل وفق القواعد السابقة أي بالنسبة للجنايات والجنح فقط، ولا يعتد في هذا الصدد بمدة العقوبة المقررة أو المحكوم بها من أجل الجريمة الجديدة.",
                  "تطبق المقتضيات السابقة على الجرائم التي يرتكبها عسكريون أو بحارة أو من في حكمهم، إذا كانت الجريمة المطلوب من أجلها التسليم لا تعد إخلالا بواجب عسكري وكان القانون المغربي يعاقب عليها كجريمة عادية، وذلك مع مراعاة المقتضيات المعمول بها في تسليم البحارة الموجودين في حالة فرار."
                ]
              },
              {
                "number": "721",
                "paragraphs": [
                  "لا يوافق على التسليم:",
                  "1- إذا كان الشخص المطلوب مواطنا مغربيا، ويعتد بهذه الصفة في وقت ارتكاب الجريمة المطلوب من أجلها التسليم؛",
                  "2- إذا كانت الجريمة المطلوب من أجلها التسليم تعتبر جريمة سياسية أو مرتبطة بجريمة سياسية؛",
                  "3- إذا وجدت أسباب جدية يعتقد معها أن طلب التسليم المستند إلى جريمة من الجرائم العادية لم يقدم بقصد المتابعة أو المعاقبة من أجل اعتبارات عنصرية أو دينية أو تتعلق بالجنسية أو بآراء سياسية، أو من أجل تعرضه للتعذيب أو للاختفاء القسري، أو أن وضعيته قد تتعرض من جراء إحدى هذه الاعتبارات لخطر التشديد عليه.",
                  "غير أن الاعتداء على حياة رئيس الدولة أو فرد من أفراد عائلته أو عضو من أعضاء الحكومة لا يعتبر ضمن الحالات التي تسري عليها القيود المشار إليها في البنود 1 و2 و3 من هذه المادة.",
                  "لا تعتبر أيضا ضمن هذه الحالات الأعمال التي ترتكب أثناء تمرد أو شغب يمس بالأمن العام إذا اتسمت هذه الأعمال بوحشية شنيعة، وكذا أعمال التخريب والإبادة الجماعية الممنوعة بمقتضى الاتفاقيات الدولية؛",
                  "4- إذا ارتكبت الجنايات أو الجنح بأراضي المملكة المغربية؛",
                  "5- إذا كانت الجنايات أو الجنح ولو أنها ارتكبت خارج أراضي المملكة قد تمت المتابعة من أجلها بالمغرب ووقع الحكم فيها نهائيا؛",
                  "6- إذا كانت الدعوى العمومية أو العقوبة قد سقطت بالتقادم قبل تاريخ طلب التسليم حسب التشريع المغربي أو حسب تشريع الدولة الطالبة، وبصفة عامة كلما انقضت أو سقطت الدعوى العمومية المقامة من الدولة الطالبة."
                ]
              },
              {
                "number": "722",
                "paragraphs": [
                  "لا يقبل التسليم في الجرائم المتعلقة بالضرائب على اختلاف أنواعها أو بحقوق الجمارك أو بنظام الصرف، إلا بناء على شرط صريح تتعهد الدولة الطالبة بمقتضاه ضمن طلب التسليم بأن تقبل المعاملة بالمثل في طلبات من نفس النوع."
                ]
              },
              {
                "number": "723",
                "paragraphs": [
                  "لا يقبل التسليم إلا بشرط عدم متابعة الشخص المسلم أو الحكم عليه أو اعتقاله أو إخضاعه لأي إجراء آخر مقيد لحريته الشخصية، من أجل أي فعل كيفما كان سابق لتاريخ التسليم، غير الفعل الذي سلم من أجله.",
                  "إذا وقع أثناء المسطرة الجارية من الدولة الطالبة تغيير في تكييف الفعل الجرمي، فإن الشخص المسلم لا تجري متابعته أو يصدر عليه الحكم إلا إذا كانت العناصر المكونة للجريمة بوصفها الجديد تسمح بالتسليم."
                ]
              },
              {
                "number": "724",
                "paragraphs": [
                  "إذا قدمت عدة دول طلبات للتسليم تخص نفس الشخص، فإن الغرفة الجنائية بمحكمة النقض تبت في كل طلب على حدة.",
                  "وإذا تعلقت هذه الطلبات بنفس الجريمة، فإن الأولوية في التسليم تمنح للدولة التي أضرت الجريمة بمصالحها، أو للدولة التي ارتكبت الجريمة داخل حدودها.",
                  "إذا كانت الطلبات مبنية على ارتكاب جرائم مختلفة فتؤخذ بعين الاعتبار لتقرير الأولوية جميع ظروف الحال، وبالأخص خطورة الجرائم ومحل ارتكابها وتاريخ وصول الطلبات التي تتعهد بمقتضاها إحدى الدول الطالبة بإعادة التسليم.",
                  "وتكون الأولوية في كل الأحوال للدولة التي تربطها بالمملكة المغربية اتفاقية للتسليم."
                ]
              },
              {
                "number": "725",
                "paragraphs": [
                  "إذا توبع شخص أجنبي أو صدر حكم بعقوبته بالمغرب، وكان محلا لطلب تسليم بسبب جريمة أخرى، فإن تسليمه لا يتم إلا بعد انتهاء المتابعة أو بعد تنفيذ العقوبة والإكراه البدني عند الاقتضاء بالمغرب.",
                  "غير أن هذا المقتضى لا يحول دون إمكانية مثول الشخص الأجنبي مؤقتا أمام محاكم الدولة الطالبة، بشرط التعهد صراحة بإعادته بمجرد ما يبت القضاء الأجنبي في القضية.",
                  "إذا كان الشخص الذي تم تسليمه للسلطات القضائية المغربية معتقلا بالدولة التي سلمته، فإن اعتقاله يظل مستمرا بالمغرب بناء على أمر بالإيداع يوقعه وكيل الملك أو الوكيل العام للملك لدى المحكمة المغربية المختصة بمجرد تقديمه إلى الجهة القضائية المعنية. ولا تتأثر وضعية هذا الشخص بالقرارات التي يمكن أن تتخذها الجهات القضائية المغربية بشأن القضية التي سلم إليها من أجلها.",
                  "يبقى المعني بالأمر رهن الاعتقال المؤقت إلى حين إعادة تسليمه للدولة التي سلمته مؤقتا، غير أنه يمكن الإفراج عنه بناء على طلب من سلطاتها أو بعد موافقتها. وفي هذه الحالة يصدر الوكيل العام للملك أو وكيل الملك الذي أمر بإيداعه مؤقتا أمرا بالإفراج عنه."
                ]
              },
              {
                "number": "726",
                "paragraphs": [
                  "يقدم طلب التسليم إلى السلطات المغربية كتابة وبالطريق الدبلوماسي.",
                  "يجب أن يرفق الطلب:",
                  "1- بالأصل أو بنظير إما لحكم بعقوبة قابلة للتنفيذ، وإما لأمر بإلقاء القبض أو لكل سند إجرائي آخر قابل للتنفيذ وصادر عن سلطة قضائية وفق الكيفيات المقررة في قانون الدولة الطالبة؛",
                  "2- بملخص للأفعال التي طلب من أجلها التسليم، وكذا تاريخ ومحل ارتكابها، وتكييفها القانوني، وتضاف إليه في نفس الوقت نسخة من النصوص القانونية المطبقة على الفعل الجرمي؛",
                  "3- ببيان دقيق حسب الإمكان لأوصاف الشخص المطلوب تسليمه وبجميع المعلومات الأخرى التي من شأنها التعريف بهويته أو جنسيته؛",
                  "4- بتعهد بالالتزام بمقتضيات المادة 723 أعلاه."
                ]
              },
              {
                "number": "727",
                "paragraphs": [
                  "يوجه وزير الشؤون الخارجية طلب التسليم الصادر عن السلطات الأجنبية بعد الاطلاع على مستنداته مرفقا بالملف إلى وزير العدل الذي يتأكد من صحة الطلب ويتخذ في شأنه ما يلزم قانونا.",
                  "توجه طلبات التسليم الصادرة عن السلطات القضائية المغربية إلى رئيس النيابة العامة الذي يحيلها على وزير العدل لتوجيهها إلى السلطات الأجنبية عبر الطريق الدبلوماسي، ما لم توجد اتفاقيات مصادق عليها ومنشورة بالجريدة الرسمية تقضي بخلاف ذلك، وفي حالة الاستعجال يمكن لوزير العدل توجيهها مباشرة إلى السلطات الأجنبية."
                ]
              },
              {
                "number": "728",
                "paragraphs": [
                  "إذا تبين أن المعلومات المقدمة من الدولة الطالبة غير كافية لتمكين السلطات المغربية من اتخاذ قرار، فإن هذه السلطات تطلب إفادتها بالمعلومات التكميلية الضرورية. ويمكن لها أن تحدد أجلا للحصول على تلك المعلومات."
                ]
              },
              {
                "number": "729",
                "paragraphs": [
                  "يمكن لوكيل الملك لدى المحكمة الابتدائية أو لأحد نوابه، في حالة الاستعجال، وبطلب مباشر من السلطات القضائية للدولة الطالبة، أو بناء على إشعار من مصالح المنظمة الدولية للشرطة الجنائية \"أنتربول\" أو باقي القنوات المعتمدة، أن يأمر باعتقال شخص أجنبي مؤقتا بمجرد توصله بإشعار عن طريق البريد أو بأية وسيلة من وسائل الاتصال الأكثر سرعة التي تترك أثرا كتابيا أو ماديا على وجود إحدى الوثائق المبينة في البند رقم 1 من المادة 726 أعلاه.",
                  "يجب أن يرسل في نفس الوقت وبالطريق الدبلوماسي طلب رسمي إلى وزير الشؤون الخارجية.",
                  "يتعين على وكيل الملك أن يشعر فورا رئيس النيابة العامة بإجراء الاعتقال، ويتولى هذا الأخير إشعار كل من وزير العدل والنيابة العامة لدى محكمة النقض بإجراء هذا الاعتقال.",
                  "يمكن لوكيل الملك أن يباشر مسطرة تسليم الشخص الأجنبي دون اعتقاله مؤقتا، إما تلقائيا أو بناء على طلب من المعني بالأمر أو دفاعه، مع إمكانية إخضاعه لواحد أو أكثر من تدابير المراقبة القضائية."
                ]
              },
              {
                "number": "730",
                "paragraphs": [
                  "يجري وكيل الملك لدى المحكمة الابتدائية أو أحد نوابه الذي قدم إليه الشخص خلال الأربع والعشرين ساعة من وقوع الاعتقال استجوابا لهذا الشخص حول هويته، ويخبره بمضمون السند الذي اعتقل بسببه، ثم يحرر محضرا بهذه العملية.",
                  "إذا صرح الشخص المطلوب في التسليم بتنازله عن الانتفاع بأحكام مسطرة التسليم المقررة في هذا القانون وأبدى موافقته الصريحة على تسليمه، فإنه يمكن للسلطات المغربية المختصة أن تسلمه إلى الدولة الطالبة في أقرب الآجال، كما يمكن لها أن تطلب من الدولة الطالبة الحصول على الوثائق المشار إليها في المادة 726 أعلاه.",
                  "يضمن التصريح بالموافقة على التسليم في محضر رسمي يمضيه الشخص المطلوب ودفاعه عند حضوره ويوقعه وكيل الملك.",
                  "لا يقبل الرجوع في التصريح المصادق عليه وفقا للفقرة السابقة.",
                  "يقوم المحضر الموقع عليه من طرف وكيل الملك مقام الموافقة من السلطة القضائية على طلب التسليم، وتوجه فورا هذه الوثيقة مع مستندات المسطرة إلى وزير العدل."
                ]
              },
              {
                "number": "731",
                "paragraphs": [
                  "ينقل الشخص المعتقل في أقرب وقت إلى المؤسسة السجنية الواقعة بمقر محكمة النقض.",
                  "تشعر الإدارة المكلفة بالسجون وزير العدل بأي إجراء يتخذ في حق الشخص المعتقل في مسطرة التسليم، وكذا بوضعيته داخل المؤسسة السجنية."
                ]
              },
              {
                "number": "732",
                "paragraphs": [
                  "إذا صرح الشخص المطلوب في التسليم أثناء استجوابه بتمسكه بالانتفاع بأحكام مسطرة التسليم، فإن وكيل الملك يوجه فورا الطلب والمستندات المدلى بها إلى الوكيل العام للملك لدى محكمة النقض الذي يحيلها إلى الغرفة الجنائية بنفس المحكمة.",
                  "تبت الغرفة الجنائية بمحكمة النقض في طلب التسليم بقرار معلل خلال خمسة أيام من إحالته إليها، بناء على تقرير أحد المستشارين وبعد إدلاء النيابة العامة بمستنتجاتها والاستماع إلى الشخص المعني الذي يمكن أن يكون مؤازرا بمحام.",
                  "ويمكن للغرفة الجنائية عند الاقتضاء أن تأمر بإجراء تحقيق تكميلي."
                ]
              },
              {
                "number": "733",
                "paragraphs": [
                  "يمكن الإفراج عن الشخص المعتقل مؤقتا بناء على طلب بالاعتقال المؤقت صادر عن دولة مجاورة، إذا لم يصل طلب رسمي مرفق بالمستندات المشار إليها في المادة 726 أعلاه خلال ثلاثين يوما من تاريخ هذا الاعتقال.",
                  "إذا كانت الدولة الطالبة غير مجاورة، فإن الأجل يمكن أن يمدد شهرا آخر.",
                  "يمكن الإفراج أيضا عن الشخص المطلوب بصفة صحيحة، إذا لم تصل خلال الأجل المحدد المعلومات التكميلية المطلوبة تطبيقا للمادة 728 أعلاه.",
                  "تبت محكمة النقض في شأن الإفراج بناء على طلب يقدمه الشخص المعني، ويتم البت في هذا الطلب خلال ثمانية أيام.",
                  "إذا توصلت السلطات المغربية بالمستندات المطلوبة بعد انقضاء الأجل المذكور، فإن المسطرة تعاد من جديد وتراعى فيها مقتضيات المواد 727 و730 و731 وما يليها من هذا القانون."
                ]
              },
              {
                "number": "734",
                "paragraphs": [
                  "يمكن للشخص المعني بالأمر في أية مرحلة من مراحل المسطرة أن يطلب الإفراج عنه مؤقتا طبقا للمقتضيات المنظمة للإفراج المؤقت.",
                  "تبت الغرفة الجنائية بمحكمة النقض في هذا الطلب ما لم تكن قد أبدت من قبل رأيها في طلب التسليم. ويمكنها في حالة منح الإفراج المؤقت إخضاع المعني بالأمر لتدابير المراقبة القضائية.",
                  "غير أنه يمكن البت في طلب الإفراج المؤقت ولو بعد إبداء الغرفة رأيها في طلب التسليم، إذا قدم من قبل الوكيل العام للملك لدى محكمة النقض بناء على طلب يوجهه إليه وزير العدل.",
                  "يبين في طلب الإفراج المؤقت الأسباب التي تحول دون تنفيذ قرار التسليم داخل أجل معقول في غير الأحوال المشار إليها في المادتين 737 و1-737 أدناه."
                ]
              },
              {
                "number": "735",
                "paragraphs": [
                  "إذا صرح الشخص المعني أثناء مثوله أمام الغرفة الجنائية بمحكمة النقض أنه يتخلى عن الاستفادة من تطبيق المسطرة المنصوص عليها في هذا الباب وقبل صراحة أن يسلم إلى سلطات الدولة الطالبة، فإن محكمة النقض تشهد عليه بذلك.",
                  "وتوجه نسخة من هذا القرار إلى الوكيل العام للملك لدى محكمة النقض الذي يحيلها إلى وزير العدل."
                ]
              },
              {
                "number": "736",
                "paragraphs": [
                  "تبدي الغرفة الجنائية، في حالة العكس، رأيها في طلب التسليم.",
                  "إذا اعتبرت الغرفة الجنائية أن الشروط القانونية غير مستوفاة أو أن هناك خطأ بينا، أصدرت رأيا بعدم الموافقة.",
                  "يعتبر رأيها في هذه الحالة نهائيا، ولا يمكن بعده الموافقة على التسليم.",
                  "ويفرج إثر ذلك عن الشخص الأجنبي ما لم يكن معتقلا من أجل سبب آخر.",
                  "يوجه الملف وكذا نسخة من القرار خلال ثمانية أيام من يوم النطق به إلى وزير العدل.",
                  "يقع بعد ذلك إشعار السلطات الطالبة برفض التسليم."
                ]
              },
              {
                "number": "737",
                "paragraphs": [
                  "إذا أبدت محكمة النقض رأيها بالموافقة على التسليم، يوجه الملف مع نسخ من القرار، خلال ثمانية أيام إلى وزير العدل الذي يقترح عند الاقتضاء على رئيس الحكومة إمضاء مرسوم يأذن بالتسليم.",
                  "يوجه وزير العدل المرسوم إلى وزير الشؤون الخارجية قصد تبليغه إلى الممثل الدبلوماسي للدولة الطالبة وإلى وزير الداخلية قصد تبليغه إلى الشخص المعني بالأمر ولأجل التنفيذ.",
                  "إذا لم تتخذ الدولة الطالبة خلال أجل شهر من تاريخ تبليغ المرسوم لممثلها الدبلوماسي، وفق مقتضيات الفقرة الثانية من هذه المادة، المبادرات اللازمة لاستلام الشخص بواسطة أعوانها، أو لم تعط المبررات الكافية عن أسباب تأخرها، فإنه يفرج عن الشخص المقرر تسليمه ولا تمكن المطالبة به من أجل نفس الأفعال."
                ]
              },
              {
                "number": "1-737",
                "paragraphs": [
                  "باستثناء الحالات التي يمكن فيها للغرفة الجنائية بمحكمة النقض الأمر بالإفراج عن الشخص المطلوب في التسليم، يمكن لوكيل الملك التابع لدائرة نفوذه المؤسسة السجنية المعتقل بها مؤقتا الشخص المعني بالتسليم أن يأمر بالإفراج عنه:",
                  "1- في حالة توصله بتنازل الدولة الطالبة عن طلب التسليم؛",
                  "2- في حالة إشعاره رسميا بعدم مبادرة الدولة الطالبة إلى استلام المعني بالأمر داخل الأجل الذي تحدده الاتفاقية أو القانون لذلك؛",
                  "3- في حالة إلغاء الدولة الطالبة للأمر بالبحث وإلقاء القبض على الشخص المطلوب في التسليم؛",
                  "4- في حالة إلغاء مرسوم التسليم أو في حالة إيقاف مسطرة إعداده.",
                  "يوجه وكيل الملك إشعارا إلى الوكيل العام للملك لدى محكمة النقض مرفقا بوثيقة الإلغاء أو التنازل.",
                  "يحيل الوكيل العام للملك ما توصل به من وثائق بهذا الخصوص على الغرفة الجنائية التي تدرجه بإحدى جلساتها للتصريح بتسجيل الإلغاء أو الإشهاد على التنازل."
                ]
              },
              {
                "number": "2-737",
                "paragraphs": [
                  "إذا كان الشخص الذي سيتم تسليمه في حالة سراح، فإنه يمكن إلقاء القبض عليه وإيداعه في السجن بأمر من وكيل الملك إذا كان ذلك ضروريا لتنفيذ قرار التسليم.",
                  "وتحتسب مدة الإيداع ضمن الاعتقال المؤقت."
                ]
              },
              {
                "number": "738",
                "paragraphs": [
                  "خلافا لمقتضيات المادة 723 أعلاه، يمكن متابعة الشخص المسلم أو معاقبته من أجل جريمة سابقة على التسليم غير تلك التي استند إليها طلب التسليم، إذا منحت السلطات المغربية موافقتها على ذلك تبعا للمسطرة المنصوص عليها في المادة 739 بعده.",
                  "يمكن للسلطات المغربية منح هذه الموافقة حتى في حالة ما إذا لم تكن الجريمة التي يستند إليها الطلب من بين الجرائم المحددة في المادة 720 ما لم تكن من الجرائم المنصوص عليها في المادة 721 أعلاه."
                ]
              },
              {
                "number": "739",
                "paragraphs": [
                  "يجب أن يكون الطلب المقدم بشأن تمديد مفعول التسليم بناء على المادة 738 أعلاه مرفقا بالمستندات المبررة له المنصوص عليها في المادة 726 أعلاه وكذا بمحضر يشتمل على تصريحات الشخص المسلم ويتضمن ملاحظاته أو يسجل عدم وجود أي اعتراض يتمسك به هذا الشخص بشأن طلب تمديد مفعول التسليم.",
                  "وإذا كان الشخص المطلوب لم يسلم بعد للدولة الطالبة، فإن المحضر المذكور ينجزه وكيل الملك التابعة لنفوذه المؤسسة السجنية المعتقل بها مؤقتا الشخص المعني بالتسليم.",
                  "يوجه الملف إلى محكمة النقض التي تبت في الطلب بناء على المستندات المدلى بها، مراعية بالخصوص ما أبداه الشخص المعني من اعتراضات، ويمكن أن تتمم هذه البيانات بالاستماع إلى محام يختاره الشخص أو يعين له بطلب منه.",
                  "تبت المحكمة في الطلب وفق الشروط المنصوص عليها في المادتين 736 و737 أعلاه."
                ]
              },
              {
                "number": "740",
                "paragraphs": [
                  "يعتبر الشخص المسلم خاضعا لقانون الدولة التي سلم إليها من أجل ارتكابه أية جريمة سابقة على تاريخ تسليمه ومختلفة عن الجريمة المطلوب بسببها، إذا لم يغادر خلال الثلاثين يوما الموالية لتاريخ الإفراج النهائي عنه أرض تلك الدولة رغم أنه كان متيسرا له مغادرتها، أو إذا عاد إلى تلك الدولة بعد مغادرته لها."
                ]
              },
              {
                "number": "741",
                "paragraphs": [
                  "يكون التسليم الذي تحصل عليه السلطات المغربية باطلا إذا تم إجراؤه في غير الأحوال المنصوص عليها في هذا القانون، ما عدا إذا نصت اتفاقيات دولية نافذة المفعول على مقتضيات مخالفة.",
                  "تصرح بالبطلان، ولو تلقائيا، هيئة التحقيق أو الحكم التي أحيل هذا الشخص إليها بعد تسليمه.",
                  "تختص الهيئات المذكورة كذلك بالنظر في صحة التكييف القانوني المطبق على الوقائع المطلوب من أجلها التسليم.",
                  "إذا تم التسليم من أجل تنفيذ مقرر أصبح نهائيا، فإن محكمة النقض هي التي تصرح بهذا البطلان.",
                  "لا يقبل الطلب المرفوع بشأن البطلان من الشخص المسلم إلا إذا قدمه في ظرف ثلاثة أيام من تاريخ الإنذار الموجه إليه إثر اعتقاله من قبل وكيل الملك، ويتعين في نفس الوقت إشعار الشخص المسلم بحقه في أن يختار محاميا أو أن يطلب تعيينه له."
                ]
              },
              {
                "number": "742",
                "paragraphs": [
                  "في حالة التصريح ببطلان التسليم، يفرج عن الشخص المسلم ما لم يكن مطلوبا من الدولة التي منحت تسليمه.",
                  "ولا يمكن القبض عليه من جديد سواء من أجل الأفعال التي استند إليها هذا التسليم أو من أجل أفعال سابقة إلا إذا لم يغادر الأراضي المغربية خلال الثلاثين يوما الموالية لتاريخ الإفراج عنه، ما لم يكن خروجه متعذرا لأسباب خارجة عن إرادته، أو إذا عاد إلى المغرب بعد مغادرته."
                ]
              },
              {
                "number": "743",
                "paragraphs": [
                  "إذا حصلت السلطات المغربية على تسليم شخص أجنبي وكانت حكومة دولة ثالثة تطلب منها بدورها تسليم نفس الشخص إليها لأجل ارتكابه أفعالا سابقة على هذا التسليم ومختلفة عن الأفعال التي صدر الحكم فيها بأراضي المغرب وغير مرتبطة بها، فإنه من اللازم الحصول على موافقة الدولة التي سلمت هذا الشخص.",
                  "غير أن هذا القيد لا يطبق إذا أمكن للشخص المسلم أن يغادر الأراضي المغربية خلال الأجل المحدد في المادة 740."
                ]
              },
              {
                "number": "744",
                "paragraphs": [
                  "يؤذن بمرور كل شخص غير مغربي كيفما كانت جنسيته يقع تسليمه من دولة أخرى عبر أراضي المغرب أو يتم نقله على متن سفن أو طائرات مغربية، بمجرد تقديم طلب عادي بالطريق الدبلوماسي أو عبر منظمة الأنتربول وبكل الوسائل الأخرى المعمول بها مدعم بالمستندات الضرورية التي تثبت بأن الجريمة المنسوبة إليه تدخل ضمن ما هو منصوص عليه في المادة 720 أعلاه.",
                  "يمنح هذا الإذن من طرف وزير العدل في نطاق المعاملة بالمثل أو إذا نصت عليه اتفاقية مع الدولة الطالبة.",
                  "يتم النقل تحت مراقبة أعوان مغاربة وعلى نفقة الدولة الطالبة.",
                  "في حالة نقل هذا الشخص جوا على متن طائرة أجنبية لم يكن مقررا لها أن تحط بالمغرب، فإن الدولة الطالبة تشعر الحكومة المغربية بأن الطائرة ستحلق في فضائها وتشهد بوجود المستندات المنصوص عليها في المادة 726 أعلاه.",
                  "إذا حطت الطائرة فجأة، فإن هذا التصريح تكون له آثار طلب الاعتقال المؤقت المنصوص عليه في البند رقم 1 من المادة 726 أعلاه، ويتعين على الدولة الطالبة عندئذ أن ترسل طلبا رسميا بالتسليم.",
                  "عندما يكون توقف الطائرة بالمغرب مقررا، فإن الدولة الطالبة توجه طلبا وفق مقتضيات الفقرة الخامسة من هذه المادة.",
                  "إذا توقف تسليم مطلوب إلى السلطات المغربية على طلب العبور، يمكن لوزير العدل أن يتقدم بهذا الطلب إلى السلطات الأجنبية المطلوبة."
                ]
              },
              {
                "number": "745",
                "paragraphs": [
                  "تحجز بطلب من الدولة الطالبة جميع الأشياء المتحصلة من الجريمة أو التي يمكن اعتمادها كأدوات اقتناع، والتي يعثر عليها في حيازة الشخص المطلوب تسليمه وقت إلقاء القبض عليه أو التي تكتشف فيما بعد.",
                  "تبت محكمة النقض في نفس الوقت الذي تبدي فيه رأيها بالموافقة على التسليم بشأن تسليم هذه الأشياء إلى الدولة الطالبة.",
                  "يجوز أن تسلم هذه الأشياء ولو تعذر تسليم الشخص المطلوب بسبب فراره أو وفاته.",
                  "يمكن للسلطات المغربية مع ذلك أن تحتفظ بالأشياء المحجوزة إذا رأت أن ذلك ضروري لحسن سير الإجراءات الجنائية الجارية أمام محاكمها ضد الشخص نفسه أو المساهمين معه أو المشاركين له، ويمكن لها كذلك أن تحتفظ لنفسها عند إرسال هذه الأشياء بالحق في استردادها لنفس السبب مع التعهد بإعادتها بمجرد ما يتيسر لها ذلك.",
                  "غير أنه تحفظ الحقوق المكتسبة للدولة المغربية أو للغير على هذه الأشياء."
                ]
              },
              {
                "number": "1-745",
                "paragraphs": [
                  "إذا كان تسليم متهم أو محكوم عليه من دولة أجنبية يتوقف على التزام السلطات المغربية بتقديم ضمانات أو التزامات، يتولى وزير العدل باسم المملكة المغربية تقديم الضمانات أو الالتزامات التي تعدها السلطات المغربية المعنية ويوجهها لوزير الشؤون الخارجية لإبلاغها للسلطات الأجنبية.",
                  "يجب على السلطات القضائية والعمومية تنفيذ الالتزام واحترام الضمانات المقدمة."
                ]
              },
              {
                "number": "2-745",
                "paragraphs": [
                  "إذا كانت الجريمة معاقبا عليها في الدولة المطلوب منها التسليم بعقوبة غير تلك المحددة في التشريع المغربي، فإنه يجوز لتطبيق مقتضيات التسليم تعويض العقوبة بتلك المقررة لنفس الجريمة في تشريع الدولة المذكورة."
                ]
              }
            ]
          },
          {
            "name": "الباب الخامس",
            "title": "استدعاء الشهود",
            "articles": [
              {
                "number": "746",
                "paragraphs": [
                  "إذا رأت دولة أجنبية ضرورة حضور أحد الشهود المقيمين بأرض المغرب للاستماع إليه شخصيا في قضية زجرية، فإن السلطات المغربية التي قدم إليها الطلب بالطريق الدبلوماسي تدعو الشاهد للاستجابة إلى الاستدعاء الموجه إليه.",
                  "غير أن الاستدعاء لا يتم ولا يبلغ للشخص الموجه إليه إلا بشرط عدم إمكان متابعته أو الحد من حريته من أجل أفعال أو عقوبات سابقة لحضوره."
                ]
              },
              {
                "number": "747",
                "paragraphs": [
                  "كل شخص معتقل بمؤسسة سجنية بالمغرب يطلب حضوره شخصيا من الدولة الطالبة بقصد أداء شهادة أو إجراء مواجهة، يمكن نقله مؤقتا إلى الدولة الطالبة بشرط إرجاعه خلال أجل تحدده السلطات المغربية.",
                  "يرد الطلب بالطريق الدبلوماسي.",
                  "يمكن رفض هذا النقل:",
                  "إذا لم يقبل به المعتقل؛",
                  "إذا ظهر أن حضوره في قضية زجرية جارية بالمغرب أمر ضروري؛",
                  "إذا كان نقله سيؤدي إلى تمديد فترة اعتقاله؛",
                  "إذا وجدت اعتبارات خاصة تعترض نقله إلى أراضي الدولة الطالبة.",
                  "يبقى الشخص الذي تم نقله بهذه الصفة رهن الاعتقال لدى الدولة الطالبة إلا إذا تعلق الأمر بشخص محكوم عليه بعقوبة وطلبت الدولة المغربية عند انصرام عقوبته الإفراج عنه.",
                  "تحسب المدة التي يقضيها المعني بالأمر بسجن الدولة الطالبة ضمن المدة المحكوم بها عليه بالمغرب وتخصم من العقوبة."
                ]
              }
            ]
          },
          {
            "name": "الباب السادس",
            "title": "الشكاية الرسمية",
            "articles": [
              {
                "number": "748",
                "paragraphs": [
                  "إذا ارتكب أجنبي جريمة تخضع لاختصاص المحاكم المغربية، وكان من مواطني دولة لا يسمح تشريعها بتسليم مواطنيها، فإنه يمكن للسلطات المغربية في حالة لجوء مرتكب الجريمة إلى وطنه أن تقوم بإبلاغ دولته بما ارتكبه من أفعال للحصول على متابعته طبقا لتشريع الدولة المطلوبة.",
                  "توجه الشكايات الرسمية الصادرة عن السلطات القضائية المغربية من رئيس النيابة العامة إلى وزير العدل الذي يتولى إحالتها على السلطات القضائية الأجنبية عبر الطريق الدبلوماسي، ما لم توجد اتفاقيات مصادق عليها ومنشورة بالجريدة الرسمية تقضي بخلاف ذلك، وفي حالة الاستعجال يمكن له توجيهها مباشرة إلى السلطات الأجنبية.",
                  "يتضمن الإبلاغ عرضا للوقائع، ويبين فيه بدقة مكان ووقت ارتكاب الجريمة والعناصر المكونة لها والنصوص المطبقة عليها بالمغرب وجميع العناصر الأخرى التي يمكن استعمالها كوسائل إثبات، ويرفق على الخصوص بنسخ مصادق على مطابقتها للأصل من محاضر المعاينة والاستماع إلى الشهود أو إلى المساهمين أو المشاركين في الجريمة الذين يوجدون بالمغرب.",
                  "يوجه وزير الشؤون الخارجية الشكايات الرسمية الصادرة عن السلطات الأجنبية بعد الاطلاع عليها إلى وزير العدل الذي يتأكد من صحتها ويتخذ في شأنها ما يلزم قانونا.",
                  "تطبق مقتضيات الفقرات أعلاه مع مراعاة الاتفاقيات المبرمة في هذا الصدد."
                ]
              },
              {
                "number": "749",
                "paragraphs": [
                  "يمكن في حالة التوصل بشكاية رسمية من دولة أجنبية أن يتابع بالمغرب المواطن المغربي الذي يرتكب جريمة بالخارج أو داخل المملكة، ولا يتم تسليمه للدولة الأجنبية اعتبارا لجنسيته المغربية.",
                  "ويحاكم ويصدر الحكم عليه وفقا لمقتضيات القانون المغربي."
                ]
              }
            ]
          },
          {
            "name": "الباب السابع ",
            "title": "التسليم المراقب",
            "articles": [
              {
                "number": "748",
                "paragraphs": [
                  "إذا ارتكب أجنبي جريمة تخضع لاختصاص المحاكم المغربية، وكان من مواطني دولة لا يسمح تشريعها بتسليم مواطنيها، فإنه يمكن للسلطات المغربية في حالة لجوء مرتكب الجريمة إلى وطنه أن تقوم بإبلاغ دولته بما ارتكبه من أفعال للحصول على متابعته طبقا لتشريع الدولة المطلوبة.",
                  "توجه الشكايات الرسمية الصادرة عن السلطات القضائية المغربية من رئيس النيابة العامة إلى وزير العدل الذي يتولى إحالتها على السلطات القضائية الأجنبية عبر الطريق الدبلوماسي، ما لم توجد اتفاقيات مصادق عليها ومنشورة بالجريدة الرسمية تقضي بخلاف ذلك، وفي حالة الاستعجال يمكن له توجيهها مباشرة إلى السلطات الأجنبية.",
                  "يتضمن الإبلاغ عرضا للوقائع، ويبين فيه بدقة مكان ووقت ارتكاب الجريمة والعناصر المكونة لها والنصوص المطبقة عليها بالمغرب وجميع العناصر الأخرى التي يمكن استعمالها كوسائل إثبات، ويرفق على الخصوص بنسخ مصادق على مطابقتها للأصل من محاضر المعاينة والاستماع إلى الشهود أو إلى المساهمين أو المشاركين في الجريمة الذين يوجدون بالمغرب.",
                  "يوجه وزير الشؤون الخارجية الشكايات الرسمية الصادرة عن السلطات الأجنبية بعد الاطلاع عليها إلى وزير العدل الذي يتأكد من صحتها ويتخذ في شأنها ما يلزم قانونا.",
                  "تطبق مقتضيات الفقرات أعلاه مع مراعاة الاتفاقيات المبرمة في هذا الصدد."
                ]
              },
              {
                "number": "749",
                "paragraphs": [
                  "يمكن في حالة التوصل بشكاية رسمية من دولة أجنبية أن يتابع بالمغرب المواطن المغربي الذي يرتكب جريمة بالخارج أو داخل المملكة، ولا يتم تسليمه للدولة الأجنبية اعتبارا لجنسيته المغربية.",
                  "ويحاكم ويصدر الحكم عليه وفقا لمقتضيات القانون المغربي."
                ]
              }
            ]
          },
          {
            "name": "الباب الثامن ",
            "title": "الأمر الدولي بإلقاء القبض",
            "articles": [
              {
                "number": "3-749",
                "paragraphs": [
                  "يتضمن الأمر الدولي بالبحث وإلقاء القبض، مع مراعاة ما تنص عليه الاتفاقيات الدولية، البيانات التالية:",
                  "1- ملخص الأفعال وتحديد تاريخ ومكان ارتكابها وتكييفها القانوني؛",
                  "2- النصوص القانونية المطبقة على الأفعال الجرمية؛",
                  "3- الهوية الكاملة للشخص مع الإشارة إلى أوصافه ولكل المعلومات المتوفرة التي من شأنها التعريف بهويته؛",
                  "4- الأمر الصادر بضبط الشخص وإلقاء القبض عليه؛",
                  "5- الجهة القضائية المصدرة للأمر وتوقيعها والنصوص القانونية التي تمنحها الاختصاص.",
                  "تحيل الجهة القضائية المختصة الأمر الدولي بإلقاء القبض إلى الشرطة القضائية التي توجهه إلى المديرية العامة للأمن الوطني لنشره من قبل المنظمة الدولية للشرطة الجنائية (الأنتربول) وبكل الوسائل الأخرى المعمول بها، وتحال نسخة منه إلى رئيس النيابة العامة ووزير العدل.",
                  "يتعين على السلطات القضائية التي تقوم بإلغاء أمر دولي بالبحث وإلقاء القبض أو بتعديل مقتضياته أن تشعر بذلك فورا مصالح الشرطة القضائية المشار إليها في الفقرة الثانية من هذه المادة ورئيس النيابة العامة ووزير العدل.",
                  "يتعين على السلطات المختصة قبل تنفيذ الأوامر الدولية الصادرة عن السلطات الأجنبية أن تتأكد من احترامها للشروط القانونية المنصوص عليها في هذا القانون، ولا سيما مقتضيات المواد 719 و720 و721 أعلاه، ويمكن لها تحديد أجل لمطالبة السلطات الأجنبية بكل معلومة تراها مناسبة."
                ]
              }
            ]
          },
          {
            "name": "الباب التاسع",
            "title": "نقل الأشخاص المحكوم عليهم",
            "sections": [
              {
                "name": "الفرع الأول",
                "title": "نقل الأشخاص المحكوم عليهم بالخارج إلى المغرب",
                "articles": [
                  {
                    "number": "749-4",
                    "paragraphs": [
                      "يجوز لوزير العدل تلقائيا أو بناء على طلب المحكوم عليه المغربي، أن يقدم إلى الدولة الأجنبية التي يتم فيها تنفيذ العقوبة طلبا بنقله إلى المغرب لقضاء عقوبته أو ما تبقى منها.",
                      "يجوز له أيضا بناء على طلب دولة أجنبية نقل المحكوم عليه بعقوبة سالبة للحرية بمقتضى حكم صادر عن قضائها، وذلك لتنفيذ العقوبة أو ما تبقى منها في المغرب، إذا كان المحكوم عليه مغربيا وتوفرت الشروط الآتية:",
                      "أن يوافق المحكوم عليه كتابة على النقل أو بواسطة من يمثله قانونا طبقا لمقتضيات القانون المغربي أو قانون الدولة الأجنبية؛",
                      "أن يكون الحكم الصادر في حقه مكتسبا لقوة الشيء المقضي به؛",
                      "أن يكون الفعل الصادر من أجله حكم بالإدانة جريمة في القانون المغربي؛",
                      "ألا يكون قد صدر لأجل نفس الفعل حكم من المحاكم المغربية قضى ببراءة أو إدانة المحكوم عليه، أو ما يفيد أنه نفذ العقوبة المحكوم بها عليه أو تقادمت أو حصل على عفو بشأنها؛",
                      "ألا يتعارض تنفيذ الحكم مع المبادئ الأساسية للقانون المغربي؛"
                    ]
                  },
                  {
                    "number": "5-749",
                    "paragraphs": [
                      "يقدم طلب النقل كتابة إلى وزير العدل.",
                      "يرفق الطلب بأصل الحكم أو نسخة مطابقة منه ومستندات ووثائق التنفيذ، وموافقة المحكوم عليه أو من يمثله قانونا وشهادة تثبت المدة التي قضاها من العقوبة والمدة المتبقية منها، وترجمة رسمية باللغة العربية للوثائق المذكورة.",
                      "إذا تبين أن الوثائق والمستندات المقدمة من الدولة الطالبة غير كافية لتمكين السلطات المغربية من اتخاذ القرار، فإنه يمكن لوزير العدل أن يطلب من السلطة الأجنبية المختصة موافاته بالوثائق أو المعلومات التي تراها ضرورية للبت في الطلب، ويمكنه أن يحدد أجلا للحصول على تلك المعلومات والوثائق."
                    ]
                  },
                  {
                    "number": "6-749",
                    "paragraphs": [
                      "يمكن لوزير العدل قبول أو رفض طلب نقل المحكوم عليه إلى المغرب.",
                      "إذا تم قبول الطلب، فإن المحكوم عليه يستمر حبسه من تاريخ وصوله إلى المغرب.",
                      "وتحدد مدة العقوبة الواجب تنفيذها في المغرب بعد خصم ما تم تنفيذه منها في الخارج."
                    ]
                  },
                  {
                    "number": "7-749",
                    "paragraphs": [
                      "يتم تنفيذ العقوبة طبقا لأحكام التنفيذ المنصوص عليها في القانون المغربي مع الالتزام بالأحكام والقرارات الصادرة من الدولة طالبة النقل والتي يكون من شأنها إنهاء تنفيذ العقوبة المقضي بها، كلها أو بعضها أو وقف تنفيذها.",
                      "غير أنه إذا كانت العقوبة المحكوم بها الصادرة عن محاكم الدولة الأجنبية تتجاوز الحد الأقصى للعقوبة المقررة قانونا للفعل في القانون المغربي، فإن وزير العدل يحيل الأمر على رئيس النيابة العامة الذي يوجهه إلى النيابة العامة المختصة ترابيا قصد عرضه على قاضي تطبيق العقوبات بالمحكمة التي يقضي المعني بالأمر عقوبته بدائرة نفوذها لتعديلها إلى الحد الأقصى المشار إليه في هذه الفقرة مع إشعاره لوزير العدل بالقرار المتخذ.",
                      "يمكن أن يستفيد المحكوم عليه بالخارج، الذي يتم نقله إلى المغرب لقضاء عقوبته وفقا لمقتضيات هذا الفرع، من التخفيض التلقائي للعقوبة ومن الإفراج المقيد بشروط والعقوبات البديلة.",
                      "يمكنه أيضا الاستفادة من تدابير العفو والعفو العام التي تمنحها سلطات الدولة الصادر عنها حكم الإدانة ومن تدابير العفو أو العفو العام الصادرة عن السلطات المغربية المختصة."
                    ]
                  }
                ]
              },
              {
                "name": "الفرع الثاني",
                "title": "نقل الأشخاص المحكوم عليهم بالمغرب إلى دولة أجنبية",
                "articles": [
                  {
                    "number": "8-749",
                    "paragraphs": [
                      "يجوز نقل المحكوم عليه بعقوبة سالبة للحرية بموجب حكم مكتسب لقوة الشيء المقضي به صادر عن محكمة مغربية إلى دولة أجنبية لتنفيذ العقوبة المحكوم بها عليه أو ما تبقى منها، إذا كان المحكوم عليه من رعاياها وتوفرت الشروط الآتية:",
                      "1- أن يوافق المحكوم عليه كتابة على النقل أو بواسطة ممثله القانوني؛",
                      "2- أن يؤدي المحكوم عليه ما بذمته من غرامات ومصاريف قضائية وتعويضات وأي عقوبة مالية كيفما كان نوعها حكم عليه بأدائها أو الإدلاء بما يفيد إبراء ذمته منها؛",
                      "3- أن توافق دولة المحكوم عليه على هذا النقل؛",
                      "4- ألا يكون المحكوم عليه على المستوى الوطني موضوع أبحاث أو متابعات قضائية أو صادرة في مواجهته عقوبات أخرى."
                    ]
                  },
                  {
                    "number": "9-749",
                    "paragraphs": [
                      "تتقدم الدولة الأجنبية بطلب نقل المحكوم عليه لتنفيذ العقوبة إلى وزير العدل، الذي يصدر قرارا بقبول الطلب أو رفضه.",
                      "إذا قدم الطلب من قبل المحكوم عليه الأجنبي أو ممثله القانوني، فإن وزير العدل يبلغه إلى السلطات المختصة ببلاده بالطريق الدبلوماسي."
                    ]
                  },
                  {
                    "number": "10-749",
                    "paragraphs": [
                      "يتم إيقاف تنفيذ العقوبة في المؤسسة السجنية المغربية ابتداء من تاريخ تنفيذ قرار النقل.",
                      "لا تجوز العودة إلى التنفيذ إذا كانت العقوبة قد نفذت وفق قوانين الدولة الأجنبية."
                    ]
                  },
                  {
                    "number": "11-749",
                    "paragraphs": [
                      "يتم نقل المحكوم عليهم تحت الحراسة إلى الحدود الوطنية بواسطة القوة العمومية.",
                      "تتحمل الخزينة العامة نفقات التنقل داخل المملكة المغربية طبقا للتشريع المتعلق بالمصاريف القضائية في المادة الجنائية ومصاريف نقل السجناء المغاربة من الخارج لقضاء عقوباتهم بالمغرب.",
                      "تتحمل الدولة الأجنبية مصاريف نقل السجناء الحاملين لجنسيتها من المغرب إلى أراضيها."
                    ]
                  }
                ]
              }
            ]
          }
        ]
      }
    ]
  }