{
    "name": "الكتاب الثالث",
    "title": "القواعد الخاصة بالأحداث",
    "sections": [
      {
        "name": "القسم الأول",
        "title": "أحكام تمهيدية",
        "articles": [
          {
            "number": "458",
            "paragraphs": [
              "يتحدد سن الرشد الجنائي ببلوغ ثمان عشرة سنة ميلادية كاملة.",
              "يعتبر الحدث إلى غاية بلوغه سن اثنتي عشرة سنة غير مسؤول جنائيا لانعدام تمييزه.",
              "يعتبر الحدث الذي يتجاوز سن اثنتي عشرة سنة وإلى غاية بلوغه ثمان عشرة سنة مسؤولا مسؤولية ناقصة بسبب عدم اكتمال تمييزه."
            ]
          },
          {
            "number": "459",
            "paragraphs": [
              "يعتبر لتحديد سن الرشد الجنائي، سن الجانح يوم ارتكاب الجريمة.",
              "إذا لم توجد شهادة تثبت الحالة المدنية ووقع خلاف في تاريخ الولادة، فإن المحكمة المرفوعة إليها القضية تقدر السن بعد أن تأمر بإجراء فحص طبي وبجميع التحريات التي تراها مفيدة، وتصدر، إن اقتضى الحال، مقررا بعدم الاختصاص."
            ]
          },
          {
            "number": "460",
            "paragraphs": [
              "يمكن، دون المساس بمقتضيات المادة 470 أدناه، لضابط الشرطة القضائية المكلف بالأحداث أن يحتفظ بالحدث في نزاع مع القانون في مكان مخصص للأحداث لمدة لا يمكن أن تتجاوز في جميع الأحوال المدة الأصلية المحددة للحراسة النظرية دون قابليتها للتمديد، ما لم يتعلق الأمر بالجرائم المنصوص عليها في المادة 108 من هذا القانون، وعليه أن يتخذ كل التدابير لتفادي إيذائه.",
              "يجب تنفيذ تدبير الاحتفاظ في ظروف تضمن كرامة الحدث والحقوق المخولة له قانونا، وإذا تطلب الأمر اتخاذ تدابير أمنية يتعين التقيد بما هو ضروري منها.",
              "يجب تقديم الحدث إلى وكيل الملك أو الوكيل العام للملك قبل انتهاء هذه المدة.",
              "لا يعمل بالإجراء المنصوص عليه في الفقرتين الأولى والثالثة من هذه المادة إلا إذا تعذر تسليم الحدث لمن يتولى رعايته أو كانت ضرورة البحث أو سلامة الحدث تقتضي ذلك، وبعد موافقة النيابة العامة.",
              "تتحمل ميزانية الدولة نفقات التغذية المقدمة للأحداث المحتفظ بهم، وتحدد وفق نفس الكيفية المنصوص عليها في المادة 66 أعلاه قواعد نظام تغذيتهم وكيفيات تقديم الوجبات الغذائية لهم.",
              "يمكن كذلك للنيابة العامة، بصفة استثنائية، أن تأمر بإخضاع الحدث خلال فترة البحث التمهيدي لنظام الحراسة المؤقتة المنصوص عليه في المادة 471 بعده، إذا كانت ضرورة البحث أو سلامة الحدث تقتضي ذلك، على ألا تتجاوز مدة التدبير المأمور به خمسة عشر يوما.",
              "يجب، في كافة الأحوال، إشعار ولي الحدث أو المقدم عليه أو وصيه أو كافله أو حاضنه أو الشخص أو المؤسسة المعهود إليها برعايته بالإجراء المتخذ، وذلك وفقا لمقتضيات الفقرة الرابعة من المادة 67 من هذا القانون.",
              "ويحق لهؤلاء وللمحامي الاتصال بالحدث في الحالتين المنصوص عليهما في الفقرتين الأولى والسادسة من هذه المادة، تحت مراقبة ضابط الشرطة القضائية.",
              "يمنع على الأشخاص المشار إليهم في الفقرتين السابعة والثامنة أعلاه إخبار أي كان بما راج خلال الاتصال بالحدث قبل انتهاء البحث.",
              "تتم إجراءات البحث بكيفية سرية، ويحق لمحامي الحدث أو المحامي المعين له في إطار المساعدة القضائية أو لأحد الأشخاص المشار إليهم أعلاه أن يحضروا الاستماع للحدث من قبل ضباط الشرطة القضائية بعد ترخيص من النيابة العامة المختصة، وفي هذه الحالة يوقع المحامي أو الأشخاص المشار إليهم أعلاه على المحضر أو يشار إلى رفض التوقيع أو البصم أو عدم استطاعة ذلك."
            ]
          },
          {
            "number": "461",
            "paragraphs": [
              "تحيل النيابة العامة الحدث في نزاع مع القانون إلى قاضي الأحداث أو المستشار المكلف بالأحداث.",
              "إذا وجد مع الحدث مساهمون أو مشاركون رشداء، وجب فصل قضيتهم عن القضية المتعلقة بالحدث، وتكون النيابة العامة ملفا خاصا للحدث تحيله إلى قاضي الأحداث أو إلى المستشار المكلف بالأحداث.",
              "يمكن سلوك مسطرة الصلح في حالة ارتكاب جنحة وفقا للشروط والكيفيات المنصوص عليها في المواد 41 و1-41 و1-215 من هذا القانون.",
              "يمكن للنيابة العامة أو للحدث ووليه كذلك أن يلتمسوا، بعد إقامة الدعوى العمومية وقبل صدور حكم نهائي في جوهر القضية، إيقاف سير الدعوى العمومية في حالة سحب الشكاية أو تنازل المتضرر وفقا لمقتضيات المادة 372 من هذا القانون.",
              "يقوم وكيل الملك بتفقد الأحداث المودعين بالمؤسسات السجنية أو مراكز الملاحظة على الأقل مرة كل شهر، ويمكن أن يعهد بذلك لأحد نوابه أو لأحد المساعدين أو المساعدات الاجتماعيات بمكتب المساعدة الاجتماعية.",
              "ينجز تقرير بكل زيارة ويتخذ وكيل الملك الإجراءات الملائمة التي تدخل في اختصاصه لما فيه المصلحة الفضلى للحدث، أو يلتمس من قاضي الأحداث أو الجهة القضائية المختصة اتخاذ التدابير الضرورية."
            ]
          },
          {
            "number": "1-461",
            "paragraphs": [
              "إذا كانت الأفعال المنسوبة لحدث يقل عمره عن اثنتي عشرة سنة كاملة، فإن النيابة العامة تتخذ قرارا بحفظ القضية لانعدام مسؤوليته الجنائية وتسلمه إلى أبويه أو الوصي عليه أو المقدم عليه أو حاضنه أو كافله أو المكلف برعايته.",
              "إذا كان الحدث المذكور في الفقرة الأولى أعلاه مهملا أو كان في وضعية صعبة، فتطبق مقتضيات المواد من 512 إلى 517 من هذا القانون.",
              "يحق للضحية المطالبة بالتعويض عن الضرر الذي تسببت فيه الجريمة أمام الجهة القضائية المختصة."
            ]
          }
        ]
      },
      {
        "name": "القسم الثاني",
        "title": "هيئات التحقيق وهيئات الحكم",
        "chapters": [
          {
            "name": "الباب الأول",
            "title": "أحكام عامة",
            "articles": [
              {
                "number": "462",
                "paragraphs": [
                  "مع مراعاة الاختصاصات المخولة لبعض المحاكم بمقتضى نصوص خاصة، فإن الهيئات القضائية المكلفة بالأحداث هي:",
                  "بالنسبة للمحكمة الابتدائية:",
                  "قاضي الأحداث.",
                  "قاضي التحقيق المكلف بالأحداث.",
                  "غرفة الأحداث.",
                  "بالنسبة لمحكمة الاستئناف:",
                  "المستشار المكلف بالأحداث.",
                  "الغرفة الجنحية للأحداث.",
                  "غرفة الجنح الاستئنافية للأحداث.",
                  "غرفة الجنايات للأحداث.",
                  "غرفة الجنايات الاستئنافية للأحداث.",
                  "المستشار المكلف بالتحقيق في قضايا الأحداث.",
                  "يجب أن يرأس هذه الهيئات عند النظر في قضايا الأحداث قاض أو مستشار مكلف بالأحداث.",
                  "تراعى في تشكيلة هذه الهيئات مقتضيات المادة 297 أعلاه.",
                  "لا يمكن تحت طائلة البطلان لأي قاض أو مستشار عين أو انتدب أو كلف بصفة مؤقتة أن يشارك في الحكم في قضايا سبق له أن مارس فيها التحقيق الخاص بالأحداث.",
                  "لا يمكن لقضاة غرفة الأحداث أن يشاركوا في الحكم في قضية سبق لهم البت في موضوعها."
                ]
              },
              {
                "number": "1-462",
                "paragraphs": [
                  "لا تكتسي محاكمة الأحداث طبيعة عقابية.",
                  "تراعي النيابة العامة وقضاة التحقيق والهيئات القضائية المكلفة بالأحداث، المصلحة الفضلى للحدث في تقدير تدبير الحماية أو التهذيب الملائم لحالته والكفيل بتهذيب سلوكه وإصلاحه.",
                  "توفر للأحداث، في جميع الأحوال، مساعدة تستجيب لحاجياتهم.",
                  "لا يمكن اتخاذ تدبير الإيداع في السجن المنصوص عليه في المادة 473 أدناه، ولا العقوبات المنصوص عليها في المواد 480 و482 و493 أدناه، إلا في الأحوال الاستثنائية التي تقدر المحكمة أو القاضي أنه لا بديل عنها.",
                  "لا يمكن أن تمدد مدة اعتقال الحدث احتياطيا في الجنح إلا في حدود مرة واحدة لمدة شهر، وفي الجنايات في حدود مرتين لمدة شهرين، ويمكن تمديد مدة الاعتقال الاحتياطي ثلاث مرات ولنفس المدة بالنسبة للجنايات المنصوص عليها في المادة 108 من هذا القانون."
                ]
              },
              {
                "number": "463",
                "paragraphs": [
                  "يمارس الدعوى العمومية عند إجراء متابعة في الجنح والمخالفات التي يرتكبها أحداث، وكيل الملك لدى المحكمة الابتدائية المنتصب في دائرتها قاضي الأحداث المختص، ويمارسها الوكيل العام للملك في الجنايات والجنح المرتبطة بها.",
                  "في حالة ارتكاب جريمة يخول القانون فيها لإدارات عمومية الحق في متابعة مرتكبها، فإن النيابة العامة مؤهلة وحدها لممارسة هذه المتابعة استنادا إلى شكاية سابقة تقدمها الإدارة التي يهمها الأمر.",
                  "لا يمكن إقامة الدعوى العمومية في حق حدث من قبل الطرف المدني."
                ]
              },
              {
                "number": "1-463",
                "paragraphs": [
                  "يكون الاختصاص للهيئات القضائية المكلفة بالأحداث المنصوص عليها في المادة 462 أعلاه، التي ارتكبت الجريمة في دائرة نفوذها، أو التي يوجد ضمن دائرة نفوذها محل إقامة الحدث أو أبويه أو وصيه أو المقدم عليه أو كافله أو حاضنه.",
                  "يكون الاختصاص كذلك للهيئة القضائية التي عثر في دائرتها على الحدث.",
                  "يكون الاختصاص أيضا للهيئة القضائية التي أودع بدائرتها الحدث، إما بصفة مؤقتة أو بصفة نهائية."
                ]
              },
              {
                "number": "464",
                "paragraphs": [
                  "يمكن أن يطالب بالحق المدني كل شخص متضرر من جريمة ينسب اقترافها لحدث لم يبلغ من العمر ثماني عشرة سنة."
                ]
              },
              {
                "number": "465",
                "paragraphs": [
                  "تقام الدعوى المدنية ضد الحدث مع إدخال ممثله القانوني المسؤول مدنيا أمام قاضي الأحداث وأمام غرفة الأحداث لدى المحكمة الابتدائية في قضايا الجنح، وأمام المستشار المكلف بالأحداث وأمام غرفة الجنايات للأحداث لدى محكمة الاستئناف في قضايا الجنايات والجنح المرتبطة بها.",
                  "إذا اتهم في القضية الواحدة متهمون رشداء وآخرون أحداث، وبعد فصل المتابعة في حق هؤلاء الأخيرين طبقا للفقرة الثانية من المادة 461، فإن الدعوى المدنية التي يمارسها المتضرر ضد جميع المتهمين ترفع إلى الهيئة الزجرية التي يعهد إليها بمحاكمة الرشداء.",
                  "في هذه الحالة، لا يحضر الأحداث في المناقشات، ويحضر نيابة عنهم في الجلسة ممثلهم القانوني.",
                  "يمكن أن يؤجل البت في الدعوى المدنية إلى أن يبت نهائيا في حق الأحداث."
                ]
              },
              {
                "number": "466",
                "paragraphs": [
                  "يمنع نشر أية بيانات عن جلسات الهيئات القضائية للأحداث في الكتب والصحافة والإذاعة وعن طريق الصور والسينما والتلفزة أو غيرها من وسائل النشر الإلكترونية أو السمعية البصرية أو أية وسيلة أخرى.",
                  "يمنع أيضا أن ينشر بنفس الطرق كل نص أو رسم أو صورة تتعلق بالأحداث، سواء كانوا ضحايا أو في وضعية صعبة أو في نزاع مع القانون.",
                  "دون الإخلال بالعقوبات الأشد، يعاقب عن مخالفة هذه المقتضيات بغرامة تتراوح بين عشرة آلاف وخمسين ألف درهم.",
                  "في حالة العود إلى نفس الجريمة داخل أجل سنة ابتداء من أول حكم مكتسب لقوة الشيء المقضي به، يمكن الحكم بالحبس لمدة تتراوح بين شهرين وسنتين.",
                  "يمكن للمحكمة، علاوة على ذلك، أن تأمر بمنع أو توقيف وسيلة النشر التي ارتكبت بواسطتها المخالفة لمدة لا تتجاوز ثلاثين يوما.",
                  "يمكن للمحكمة أيضا أن تأمر بمصادرة أو إتلاف المطبوعات أو الأشرطة الصوتية أو المصورة أو غيرها من وسائل النشر كليا أو جزئيا، أو بحذف جزء منها، أو بمنع عرضها أو بيعها أو توزيعها أو إذاعتها أو بثها أو تداولها.",
                  "غير أنه يجوز نشر الحكم دون أن يبين فيه اسم الحدث، ولو بالأحرف الأولى لاسمه، أو بواسطة صور أو رسوم أو أية إشارات أخرى من شأنها التعريف به، وإلا عوقب على ذلك بغرامة يتراوح مبلغها بين ألف ومائتي درهم وثلاثة آلاف درهم.",
                  "كما يجوز للمسؤولين عن مراكز حماية الطفولة استعمال وسائل الإعلام لنشر بعض المعلومات المتعلقة بالحدث الذي انقطعت صلته بأسرته قصد تسهيل العثور عليها، وذلك بعد أخذ إذن قاضي الأحداث."
                ]
              }
            ]
          },
          {
            "name": "الباب الثاني",
            "title": "قاضي الأحداث لدى المحاكم الابتدائية",
            "articles": [
              {
                "number": "467",
                "paragraphs": [
                  "يعين قاض أو أكثر من قضاة المحكمة الابتدائية للقيام بمهام قاضي الأحداث لمدة ثلاث سنوات قابلة للتجديد من قبل المجلس الأعلى للسلطة القضائية باقتراح من رئيس المحكمة الابتدائية.",
                  "في حالة حدوث عائق يمنع قاضي الأحداث من القيام بمهامه، يكلف رئيس المحكمة الابتدائية من يقوم مقامه بصفة مؤقتة بعد استشارة وكيل الملك.",
                  "يكلف وكيل الملك، بصفة خاصة، قاضياً أو عدة قضاة من النيابة العامة بالقضايا المتعلقة بالأحداث."
                ]
              },
              {
                "number": "468",
                "paragraphs": [
                  "يختص قاضي الأحداث لدى المحكمة الابتدائية بالبت، وفقاً لمقتضيات المواد 375 إلى 382 والفقرة السادسة من المادة 384 من هذا القانون، في قضايا المخالفات المنسوبة إلى الحدث البالغ من العمر ما بين اثنتي عشرة سنة وثمان عشرة سنة.",
                  "في حالة ثبوت المخالفة، يمكن للقاضي أن يقتصر إما على توبيخ الحدث، أو الحكم بالغرامة المنصوص عليها قانوناً.",
                  "لا يتخذ في حق الحدث الذي لم يبلغ الثانية عشرة من عمره سوى التسليم لأبويه أو حاضنه أو الوصي عليه أو المقدم عليه أو كافله أو الشخص أو المؤسسة المعهود إليها برعايته."
                ]
              },
              {
                "number": "469",
                "paragraphs": [
                  "إذا كانت الجنحة تستدعي إجراء تحقيق، فإن وكيل الملك يحيلها إلى قاضي التحقيق المكلف بالأحداث.",
                  "تطبق في هذه الحالة المسطرة المقررة في القسم الثالث من الكتاب الأول المتعلق بالتحقيق الإعدادي، مع مراعاة المقتضيات المنصوص عليها في الكتاب الثالث من هذا القانون المتعلق بالقواعد الخاصة بالأحداث."
                ]
              },
              {
                "number": "470",
                "paragraphs": [
                  "إذا كانت الجنحة لا تستدعي إجراء تحقيق، فإن وكيل الملك يحيل القضية إلى قاضي الأحداث الذي يبت فيها وفقاً للمسطرة المقررة في المواد 475 و476 ومن 478 إلى 481 من هذا القانون.",
                  "تتألف الهيئة، تحت طائلة البطلان، من قاضي الأحداث بحضور ممثل النيابة العامة وبمساعدة كاتب الضبط.",
                  "غير أنه إذا تعلق الأمر بقضايا تقرر فيها متابعة الحدث في حالة اعتقال ولو توبع معه أحداث في حالة سراح، تبت في القضية غرفة الأحداث لدى المحكمة الابتدائية وفق التشكيلة المحددة في المادة 477.",
                  "إذا تبين لقاضي الأحداث أن الأفعال لا تدخل في اختصاصه، فإنه يصرح بعدم الاختصاص ويبت عند الاقتضاء في مدى استمرار نظام الحراسة المؤقتة أو الإيداع في السجن المنصوص عليه في المادة 473."
                ]
              },
              {
                "number": "471",
                "paragraphs": [
                  "يمكن لقاضي الأحداث في قضايا الجنح أن يصدر أمراً يخضع بمقتضاه الحدث لواحد أو أكثر من تدابير نظام الحراسة المؤقتة.",
                  "تشمل هذه التدابير تسليم الحدث إلى أبويه أو الوصي عليه أو المقدم عليه أو كافله أو حاضنه أو شخص من عائلته جدير بالثقة، أو إلى مركز للملاحظة، أو إلى قسم الإيواء بمؤسسة عمومية أو خصوصية، أو إلى مصلحة أو مؤسسة عمومية مكلفة برعاية الطفولة، أو إلى مؤسسة صحية عند الاقتضاء، أو إلى مؤسسة أو معهد للتربية أو التكوين أو المعالجة، أو إلى جمعية ذات منفعة عامة، أو إلى أسرة مستقبلة طبقاً لنص تنظيمي.",
                  "إذا رأى قاضي الأحداث أن حالة الحدث الصحية أو النفسانية أو سلوكه العام تستوجب فحصاً عميقاً، يمكنه الأمر بإيداعه مؤقتاً لمدة لا تتجاوز ثلاثة أشهر بمركز مؤهل.",
                  "يمكن أن تباشر التدابير السابقة تحت نظام الحرية المحروسة.",
                  "تنفذ هذه التدابير المؤقتة رغم كل طعن وتكون قابلة دائماً للإلغاء."
                ]
              },
              {
                "number": "472",
                "paragraphs": [
                  "يكون الأمر القاضي بالتدابير المؤقتة قابلاً للاستئناف طبقاً للقواعد المقررة في هذا القانون.",
                  "يمكن الطعن فيه من طرف النيابة العامة أو الحدث أو ممثله القانوني أو أبويه أو الشخص أو المؤسسة المكلفة برعايته.",
                  "يرفع الاستئناف أمام الغرفة الجنحية للأحداث بمحكمة الاستئناف."
                ]
              },
              {
                "number": "473",
                "paragraphs": [
                  "لا يمكن إيداع الحدث الذي لم يبلغ أربع عشرة سنة كاملة في الجنايات وست عشرة سنة كاملة في الجنح بمؤسسة سجنية، ولو بصفة مؤقتة، مهما كان نوع الجريمة.",
                  "لا يمكن إيداع الحدث الذي يتراوح عمره بين أربع عشرة سنة وثمان عشرة سنة في مؤسسة سجنية إلا إذا كان ذلك ضرورياً أو استحال اتخاذ أي تدبير آخر، مع تعليل القرار.",
                  "يحتفظ بالحدث في جناح خاص أو مكان معزول عن أماكن وضع الرشداء، ويبقى على انفراد أثناء الليل حسب الإمكان.",
                  "يقوم قاضي الأحداث أو المستشار المكلف بالأحداث أو وكيل الملك أو الوكيل العام للملك بتفقد الأحداث المعتقلين والمودعين بالمؤسسات مرة واحدة على الأقل كل شهر."
                ]
              },
              {
                "number": "474",
                "paragraphs": [
                  "إذا كانت الأفعال تكون جنحة، فإن قاضي الأحداث يجري بنفسه أو يأمر بإجراء بحث لتحديد التدابير اللازمة لحماية الحدث.",
                  "يتلقى معلومات بواسطة بحث اجتماعي حول الحالة العائلية والسلوكية والتعليمية والمهنية للحدث.",
                  "يمكنه الأمر بإجراء فحص طبي أو عقلي أو نفساني، وإصدار جميع الأوامر المفيدة.",
                  "يمكن لقاضي الأحداث، مراعاة لمصلحة الحدث، ألا يأمر بأي تدبير أو أن يقتصر على تدبير واحد.",
                  "يمكن إسناد البحث الاجتماعي إلى الإدارة المكلفة بالشؤون الاجتماعية أو الجمعيات أو الأشخاص المؤهلين أو مكتب المساعدة الاجتماعية بالمحكمة."
                ]
              },
              {
                "number": "475",
                "paragraphs": [
                  "يشعر قاضي الأحداث الأبوين أو الممثلين القانونيين أو الجهة المكلفة برعاية الحدث بإجراء المتابعات.",
                  "إذا لم يختر الحدث أو ممثله القانوني محامياً، يعينه له قاضي الأحداث تلقائياً أو يطلب من نقيب المحامين تعيينه."
                ]
              },
              {
                "number": "476",
                "paragraphs": [
                  "إذا كان الحدث متابعاً مع متهمين رشداء عن نفس الأفعال، وتم فصل القضية، يؤجل البت في حق الحدث إلى حين صدور الحكم في حق الرشداء ما لم يتعارض ذلك مع مصلحته."
                ]
              },
              {
                "number": "477",
                "paragraphs": [
                  "تتألف غرفة الأحداث لدى المحكمة الابتدائية من قاضي الأحداث رئيساً وقاضيين اثنين، وتعقد جلساتها بحضور ممثل النيابة العامة وبمساعدة كاتب الضبط."
                ]
              },
              {
                "number": "478",
                "paragraphs": [
                  "يجري البحث والمناقشات ويصدر الحكم بجلسة سرية، ويحضر الحدث شخصياً بمساعدة محاميه وممثله القانوني.",
                  "تطبق مقتضيات المواد 297 إلى 372 مع مراعاة النصوص الخاصة بالأحداث.",
                  "إذا تغيب الحدث أو ممثله دون عذر مقبول، يبت في القضية ويوصف الحكم وفقاً للمادة 314."
                ]
              },
              {
                "number": "479",
                "paragraphs": [
                  "يحكم في كل قضية على حدة دون حضور باقي المتابعين.",
                  "لا يحضر الجلسة إلا الأشخاص المحددون قانوناً.",
                  "يمكن للرئيس أن يأمر بانسحاب الحدث من البحث والمناقشات.",
                  "يمكن عقد الجلسات دون ارتداء البدلة الرسمية."
                ]
              },
              {
                "number": "480",
                "paragraphs": [
                  "إذا تبين أن الجريمة لا تنسب إلى الحدث، تصرح المحكمة ببراءته.",
                  "يمكن للمحكمة تطبيق تدابير الحماية إذا اقتضت مصلحة الحدث ذلك.",
                  "تحدد التدابير أو العقوبات حسب سن الحدث وخطورة الأفعال.",
                  "إذا تبين أن الأفعال جناية، تصرح المحكمة بعدم الاختصاص.",
                  "إذا كانت الأفعال مخالفة أو جنحة من اختصاص القاضي المنفرد، تحيلها المحكمة على قاضي الأحداث."
                ]
              },
              {
                "number": "481",
                "paragraphs": [
                  "يمكن لغرفة الأحداث اتخاذ واحد أو أكثر من تدابير الحماية أو التهذيب المحددة قانوناً.",
                  "يجب ألا تتجاوز مدة التدابير التاريخ الذي يبلغ فيه الحدث ثمان عشرة سنة ميلادية كاملة."
                ]
              },
              {
                "number": "482",
                "paragraphs": [
                  "يمكن لغرفة الأحداث بصفة استثنائية الحكم بعقوبة سالبة للحرية أو مالية للأحداث الذين تجاوزوا السن المحدد قانوناً، مع تعليل القرار.",
                  "تخفض الحدود القصوى والدنيا للعقوبة إلى النصف.",
                  "تنفذ العقوبة الحبسية بالأسبقية ولا تحول دون تطبيق التدابير."
                ]
              },
              {
                "number": "483",
                "paragraphs": [
                  "يمكن للمحكمة الأمر بالتنفيذ المؤقت للتدابير المحكوم بها رغم كل تعرض أو استئناف."
                ]
              },
              {
                "number": "484",
                "paragraphs": [
                  "تطبق على مقررات محكمة الأحداث قواعد الأحكام الغيابية والتعرض والاستئناف مع مراعاة خصوصيات قضايا الأحداث.",
                  "يمكن الطعن من طرف الحدث أو نائبه القانوني أو النيابة العامة.",
                  "لا يوقف الاستئناف تنفيذ تدابير الحماية أو التهذيب."
                ]
              }
            ]
          },
          {
            "name": "الباب الرابع",
            "title": "المستشار المكلف بالأحداث",
            "articles": [
              {
                "number": "485",
                "paragraphs": [
                  "يعين في كل محكمة استئناف مستشار أو أكثر للقيام بمهام مستشار مكلف بالأحداث لمدة ثلاث سنوات قابلة للتجديد من قبل المجلس الأعلى للسلطة القضائية باقتراح من الرئيس الأول لمحكمة الاستئناف.",
                  "في حالة تغيب المستشار المعين أو إذا حال دون قيامه بمهمته مانع، فإن الرئيس الأول يكلف مستشاراً آخر يقوم مقامه بعد استشارة الوكيل العام للملك.",
                  "يكلف الوكيل العام للملك قاضياً أو عدة قضاة من النيابة العامة بقضايا الأحداث.",
                  "يساعد المستشارين وقضاة التحقيق والنيابة العامة المكلفين بالأحداث مساعدون ومساعدات اجتماعيات بمكتب المساعدة الاجتماعية بالمحكمة.",
                  "يقوم هؤلاء بقدر الإمكان بالاستقبال الأولي للأطفال الضحايا في مكتب خاص يراعي خصوصية أوضاعهم ومصلحتهم الفضلى، ويعملون على تقديم الدعم النفسي لهم والاستماع إليهم، كما يتولون مرافقتهم داخل المحاكم."
                ]
              },
              {
                "number": "486",
                "paragraphs": [
                  "إذا كانت الأفعال المنسوبة للحدث تكتسي طابعاً جنائياً، فإن المستشار المكلف بالتحقيق في قضايا الأحداث، بعد قيامه بالبحث المنصوص عليه في المادة 474 أعلاه، يجري تحقيقاً في القضية حسب الكيفيات المقررة في القسم الثالث من الكتاب الأول المتعلق بالتحقيق الإعدادي.",
                  "يمكنه إخضاع الحدث لنظام الحراسة المؤقتة المنصوص عليه في المادة 471 أو لواحد أو أكثر من تدابير الحماية أو التهذيب المنصوص عليها في المادة 481 أعلاه.",
                  "يمكنه، مع مراعاة مقتضيات المادة 473 أعلاه، أن يصدر أمراً باعتقال الحدث مؤقتاً، وتسري في هذه الحالة الأحكام المتعلقة بالاعتقال الاحتياطي."
                ]
              },
              {
                "number": "487",
                "paragraphs": [
                  "بمجرد ما يعتبر المستشار المكلف بالتحقيق في قضايا الأحداث أن البحث قد انتهى، يوجه الملف إلى الوكيل العام للملك بعد أن يقوم كاتب الضبط بترقيم أوراقه، ويجب على الوكيل العام للملك أن يوجه إلى المستشار المكلف بالتحقيق في قضايا الأحداث ملتمساته خلال ثمانية أيام على الأكثر.",
                  "إذا ظهر للمستشار المكلف بالتحقيق في قضايا الأحداث أن الأدلة كافية في حق الحدث ويشكل الفعل جناية، فإنه يأمر بإحالة القضية إلى غرفة الجنايات للأحداث.",
                  "إذا ارتأى أن الأفعال لا تقع أو لم تعد واقعة تحت طائلة التشريع الجنائي، أو تبين له عدم توفر قرائن كافية ضد الحدث، فإنه يصدر أمراً بعدم المتابعة.",
                  "إذا ارتأى أن الأفعال تكون جنحة أو مخالفة، أحال الحدث على المحكمة الابتدائية المختصة وبت، عند الاقتضاء، في استمرار التدابير المشار إليها في المادة 486 أعلاه.",
                  "تقبل هذه القرارات الاستئناف أمام الغرفة الجنحية للأحداث.",
                  "يتم الاستئناف وفقاً لمقتضيات المواد من 222 إلى 224 من هذا القانون."
                ]
              },
              {
                "number": "488",
                "paragraphs": [
                  "تتكون الغرفة الجنحية للأحداث لدى محاكم الاستئناف، تحت طائلة البطلان، من مستشار للأحداث بصفته رئيساً ومن مستشارين اثنين، وتعقد جلساتها بحضور ممثل النيابة العامة وبمساعدة كاتب الضبط.",
                  "تطبق على عقد جلساتها وعلى قراراتها المقتضيات الخاصة بالغرفة الجنحية الواردة في القسم الرابع من الكتاب الأول من هذا القانون."
                ]
              }
            ]
          },
          {
            "name": "الباب السادس:",
            "title": "غرفة الجنح الاستئنافية للأحداث",
            "articles": [
              {
                "number": "489",
                "paragraphs": [
                  "تتكون غرفة الجنح الاستئنافية للأحداث، تحت طائلة البطلان، من مستشار للأحداث بصفته رئيساً ومن مستشارين اثنين، وتعقد جلساتها بحضور ممثل النيابة العامة وبمساعدة كاتب الضبط.",
                  "تختص بالنظر في استئناف الأحكام الصادرة عن غرفة الأحداث لدى المحكمة الابتدائية أو عن قاضي الأحداث طبقاً للمادة 470 أعلاه.",
                  "تطبق على عقد الجلسات وعلى مقررات غرفة الجنح الاستئنافية للأحداث مقتضيات الفرع الخامس من الباب الأول من القسم الرابع من الكتاب الثاني من هذا القانون المتعلقة بالاختصاصات الخاصة بغرفة الجنح الاستئنافية، مع مراعاة أحكام المواد من 480 إلى 482 و492 من هذا القانون.",
                  "تعقد جلساتها وتصدر مقرراتها في جلسة سرية."
                ]
              },
              {
                "number": "490",
                "paragraphs": [
                  "تتكون غرفة الجنايات للأحداث، تحت طائلة البطلان، من مستشار للأحداث بصفته رئيساً ومن مستشارين اثنين، وتعقد جلساتها بحضور ممثل النيابة العامة وبمساعدة كاتب الضبط.",
                  "تختص بالنظر في الجنايات والجنح المرتبطة بها المنسوبة للأحداث.",
                  "تبت الغرفة في جلسة سرية وفقاً للمسطرة المنصوص عليها في المواد 316 و416 وما يليها إلى 457 من هذا القانون، مع مراعاة المقتضيات الواردة في المواد 491 إلى 497 بعده.",
                  "لا يمكن إعمال المسطرة الغيابية في حق الحدث البالغ من العمر أقل من أربع عشرة سنة، ولا يمكن نشر صورة الحدث على شاشة المنصة المعدة لنشر الإعلان المتعلق بالمسطرة الغيابية، وذلك خلافاً لمقتضيات المادة 466 من هذا القانون."
                ]
              },
              {
                "number": "491",
                "paragraphs": [
                  "يحدد الرئيس تاريخ الجلسة، ويستدعي الوكيل العام للملك كلا من الحدث وممثله القانوني.",
                  "يجب أن يسلم الاستدعاء وفقاً لما تنص عليه المادة 420 أعلاه."
                ]
              },
              {
                "number": "492",
                "paragraphs": [
                  "إذا ارتأت الغرفة أن الأفعال منسوبة إلى الحدث، فإنها تبت طبقاً للمقتضيات المقررة في المواد 473 و476 ومن 481 إلى 483 من هذا القانون."
                ]
              },
              {
                "number": "493",
                "paragraphs": [
                  "إذا تبين من المناقشات أن الجريمة غير منسوبة إلى الحدث، تصدر الغرفة قراراً ببراءته.",
                  "إذا أثبتت المناقشات أن الأفعال تنسب إلى الحدث، يمكن للغرفة أن تصدر في حقه تدبيراً أو أكثر من تدابير الحماية أو التهذيب المنصوص عليها في المادة 481 أعلاه، ويمكنها بصفة استثنائية أن تعوض هذه التدابير بالنسبة للأحداث الذين يتجاوز سنهم أربع عشرة سنة بعقوبة من العقوبات المنصوص عليها في المادة 482 أعلاه.",
                  "إذا كانت العقوبة الأصلية المقررة للجريمة هي السجن لمدة ثلاثين سنة أو عقوبة أشد، فإن الغرفة تستبدلها بعقوبة سجنية من عشر سنوات إلى خمس عشرة سنة.",
                  "تطبق مقتضيات هذه المادة وفقاً للمادة 1-462 أعلاه، ويجب أن يتضمن المقرر القضائي الأسباب التي تحول دون تطبيق تدابير الحماية والأسباب الداعية إلى تطبيق العقوبة."
                ]
              },
              {
                "number": "494",
                "paragraphs": [
                  "يمكن الطعن بالاستئناف في قرارات غرفة الجنايات الصادرة في حق الأحداث أمام غرفة الجنايات الاستئنافية للأحداث وفقاً لمقتضيات المادة 457 أعلاه، من طرف الحدث أو نائبه القانوني أو النيابة العامة أو الطرف المدني أو المسؤول عن الحقوق المدنية.",
                  "تتألف غرفة الجنايات الاستئنافية للأحداث من مستشار للأحداث رئيساً ومن أربعة مستشارين، وتعقد جلساتها بحضور ممثل النيابة العامة وبمساعدة كاتب الضبط.",
                  "تبت الغرفة التي تنظر في الطعن مع مراعاة المقتضيات المشار إليها في المادتين 492 و493 أعلاه.",
                  "تعقد جلساتها وتصدر مقرراتها في جلسة سرية."
                ]
              },
              {
                "number": "495",
                "paragraphs": [
                  "يمكن الطعن بالنقض حسب الكيفيات العادية في المقررات النهائية الصادرة في حق الأحداث عن غرفة الجنح الاستئنافية للأحداث والغرفة الجنحية للأحداث لدى محكمة الاستئناف وغرفة الجنايات للأحداث.",
                  "يقدم الطعن بالنقض من طرف الحدث أو نائبه القانوني أو النيابة العامة أو الطرف المدني أو المسؤول عن الحقوق المدنية.",
                  "لا يوقف الطعن بالنقض تنفيذ تدابير الحماية أو التهذيب المحكوم بها بمقتضى المادة 493."
                ]
              }
            ]
          }
        ]
      },
      {
        "name": "القسم الثالث",
        "title": "الحرية المحروسة",
        "articles": [
          {
            "number": "496",
            "paragraphs": [
              "يعهد في دائرة كل محكمة استئناف إلى مندوب أو عدة مندوبين دائمين وإلى مندوبين متطوعين بالإشراف والتتبع التربوي للأحداث الجاري عليهم نظام الحرية المحروسة.",
              "يعين مندوب لرعاية كل حدث، إما بأمر من قاضي الأحداث لدى المحكمة الابتدائية، وإما بأمر صادر عن المستشار المكلف بالأحداث بمحكمة الاستئناف، أو بمقرر صادر عن إحدى الهيئات القضائية المشار إليها في المادة 462 من هذا القانون.",
              "يمكن أيضا أن يعهد للقيام بهذه المهمة إلى مكتب المساعدة الاجتماعية بالمحكمة."
            ]
          },
          {
            "number": "497",
            "paragraphs": [
              "يوضع الحدث الخاضع لنظام الحرية المحروسة المشار إليه في البند رقم 2 من المادة 481 أعلاه تحت الإشراف والتتبع التربوي لمندوب تكون مهمته العمل على تجنيب الحدث كل عود إلى الجريمة واقتراح كل تدبير مفيد لإعادة تربيته.",
              "يمكن أن يتخذ هذا التدبير إما خلال مدة جريان المسطرة فقط، وإما إلى غاية بلوغ الحدث ثماني عشرة سنة، أو إلى حين الاطمئنان على سلوكه."
            ]
          },
          {
            "number": "498",
            "paragraphs": [
              "تناط بالمندوبين أو بمكتب المساعدة الاجتماعية بالمحكمة مهمة مراقبة الظروف المادية والمعنوية التي يعيش فيها الحدث، وحالته الصحية، وظروف تربيته وعمله، وعلاقاته، وحسن استعماله لهواياته.",
              "يرفع المندوبون أو مكتب المساعدة الاجتماعية بالمحكمة إلى القاضي أو الهيئة القضائية التي عينتهم تقارير عن مهمتهم كل ثلاثة أشهر.",
              "يتعين عليهم كذلك رفع تقرير فوري إلى القاضي أو الهيئة المذكورين عما يعترضهم من عراقيل تحول دون قيامهم بمهمتهم، أو إذا ساءت سيرة الحدث، أو تعرض لخطر معنوي، أو أصبح يعاني من سوء معاملة.",
              "يشمل التقرير الفوري أيضاً كل حادثة أو حالة يظهر أنها تستوجب تغييراً في تدابير الإيداع أو الكفالة."
            ]
          },
          {
            "number": "499",
            "paragraphs": [
              "يعين المندوبون الدائمون بمقرر إداري تصدره السلطة الحكومية المكلفة بالطفولة، ويتقاضون أجرة عن أعمالهم، ويختارون نظراً لسلوكهم الحسن واهتمامهم بمصالح الأحداث.",
              "يعين المندوبون المتطوعون من طرف القضاة والمستشارين المكلفين بالأحداث، من بين الأشخاص الذين يبلغون من العمر خمساً وعشرين سنة على الأقل، ولا يتقاضون أجرة.",
              "تناط بالمندوبين الدائمين، بالإضافة إلى المهام المسندة إليهم بمقتضى المادتين 497 و498 أعلاه، مهمة تسيير وتنسيق نشاط المندوبين المتطوعين، وذلك تحت سلطة قاضي الأحداث أو المستشار المكلف بالأحداث.",
              "تؤدى المصاريف التي يستوجبها تنقل المندوبين الدائمين والمتطوعين لإجراء مراقبة الأحداث باعتبارها من مصاريف القضاء الجنائي."
            ]
          },
          {
            "number": "500",
            "paragraphs": [
              "في جميع الحالات التي يتقرر فيها نظام الحرية المحروسة، يعلم الحدث وأبواه أو كافله أو الوصي عليه أو المقدم عليه أو حاضنه أو الشخص أو المؤسسة المكلفة برعايته بطبيعة هذا التدبير وموضوعه والالتزامات التي يستوجبها.",
              "في حالة وفاة الحدث أو إصابته بمرض خطير، أو تغيير محل إقامته، أو تغيبه بدون إذن، يتعين على الأشخاص المذكورين أعلاه أو مشغله إشعار المندوب بذلك دون تأخير.",
              "إذا كشفت حادثة ما عن إهمال واضح في مراقبة الحدث من طرف الأشخاص المذكورين، أو عن عراقيل متكررة تحول دون قيام المندوب بمهمته، جاز للقاضي أو للهيئة القضائية التي أمرت بإخضاع الحدث لنظام الحرية المحروسة أن تحكم على هؤلاء الأشخاص بغرامة مدنية تتراوح بين مائتي درهم وألف ومائتي درهم."
            ]
          }
        ]
      },
      {
        "name": "القسم الرابع",
        "title": "تغيير تدابير المراقبة والحماية وإعادة النظر",
        "articles": [
          {
            "number": "501",
            "paragraphs": [
              "يمكن في كل وقت لقاضي الأحداث أو المستشار المكلف بالأحداث، إما تلقائياً أو بطلب من النيابة العامة أو بناءً على تقرير يقدمه المندوب المكلف بالحرية المحروسة أو مدير المؤسسة السجنية أو المركز الذي أودع به الحدث، أو بناءً على طلب من الحدث أو ممثله القانوني أو الشخص أو المؤسسة المكلفة برعايته أو مكتب المساعدة الاجتماعية بالمحكمة، أن يعيد النظر في التدابير المنصوص عليها في المادة 481 من هذا القانون.",
              "يتم ذلك كيفما كانت الهيئة القضائية التي أصدرت المقرر، مع مراعاة المصلحة الفضلى للحدث."
            ]
          },
          {
            "number": "1-501",
            "paragraphs": [
              "يمكن لقاضي الأحداث أو المستشار المكلف بالأحداث، تلقائياً أو بناءً على ملتمس من النيابة العامة أو قاضي تطبيق العقوبات أو بطلب من الجهات المشار إليها في المادة 501 أعلاه، إذا تبين له أثناء تتبع حالة حدث يقضي عقوبة سالبة للحرية حكم بها وفقاً لمقتضيات المواد 482 أو 489 أو 492 أو 493 أو 494 من هذا القانون، أن استمرار اعتقال الحدث من شأنه أن يحول دون تهذيب سلوكه أو إصلاحه، أو أن وضعيته لم تعد تتطلب تنفيذ العقوبة السالبة للحرية، أن يقدم تقريراً معللاً إلى آخر هيئة قضائية بتت في موضوع القضية.",
              "يلتمس في هذا التقرير استبدال العقوبة السالبة للحرية بتدبير أو أكثر من تدابير الحماية أو التهذيب المنصوص عليها في المادة 481 من هذا القانون."
            ]
          },
          {
            "number": "502",
            "paragraphs": [
              "إذا مرت على الأقل ثلاثة أشهر على تنفيذ مقرر صادر بإيداع الحدث خارج أسرته، يمكن لأبويه أو الوصي عليه أو المقدم عليه أو حاضنه أو كافله أن يقدموا طلباً بتسليمه إليهم أو بإرجاعه تحت حضانتهم، بعد إثبات أهليتهم لتربية الطفل وتحسن سيرته تحسناً كافياً، كما يجوز للحدث تقديم نفس الطلب.",
              "يمكن الطعن بالاستئناف في قرار قاضي الأحداث أو المستشار المكلف بالأحداث داخل أجل عشرة أيام ابتداءً من تاريخ صدوره، من طرف النيابة العامة أو الحدث أو أحد الأشخاص المشار إليهم في الفقرة الأولى من هذه المادة.",
              "يرفع هذا الاستئناف أمام الغرفة الجنحية للأحداث بمحكمة الاستئناف.",
              "في حالة رفض الطلب يمكن تجديده في أي وقت."
            ]
          },
          {
            "number": "503",
            "paragraphs": [
              "يمكن للقاضي المختص عند الاقتضاء، إذا طرأ نزاع عارض أو أقيمت دعوى متعلقة بتغيير نظام الإيداع أو التسليم أو الحرية المحروسة، أن يأمر باتخاذ جميع التدابير التي يراها ضرورية ليبقى الحدث رهن إشارته.",
              "يرجع الاختصاص المحلي للبت في أي نزاع عارض وفي دعاوى تغيير التدابير إلى قاضي الأحداث أو المستشار المكلف بالأحداث حسب الحالة.",
              "يمكن، بمقتضى تفويض منهما لاختصاصاتهما، إسناد الاختصاص إلى القاضي أو المستشار المنتدب الذي يقع ضمن دائرته موطن أبوي الحدث، أو موطن الشخص أو الهيئة أو المؤسسة أو المعهد أو الجمعية التي سلم الحدث إليها، أو إلى قاضي المكان الذي يقضي به الحدث مدة الإيداع أو الاعتقال.",
              "إذا كانت القضية تستوجب الاستعجال، أمكن بناءً على ملتمس النيابة العامة اتخاذ كل تدبير مؤقت من طرف قاضي الأحداث بالمكان الذي يقضي به الحدث مدة الإيداع أو الاعتقال، مع إشعار القاضي أو الهيئة المكلفة بقضية الحدث."
            ]
          },
          {
            "number": "504",
            "paragraphs": [
              "يمكن رغم كل تعرض أو استئناف أن يقرر التنفيذ المؤقت للمقررات الصادرة في النزاع العارض أو الدعاوى الرامية إلى تغيير الوضع بخصوص الحرية المحروسة أو الإيداع أو التسليم.",
              "يقدم الاستئناف من طرف الحدث أو نائبه القانوني أو النيابة العامة أو المطالب بالحق المدني أو المسؤول عن الحقوق المدنية إلى الغرفة الجنحية للأحداث بمحكمة الاستئناف، ضمن الشروط المنصوص عليها في المادة 488 أعلاه."
            ]
          }
        ]
      },
      {
        "name": "القسم الخامس",
        "title": "تنفيذ الأحكام",
        "articles": [
          {
            "number": "505",
            "paragraphs": [
              "تسجل الأحكام الصادرة عن الهيئات المختصة بالأحداث في سجل خاص يمسكه كاتب الضبط، ولا يكون في متناول العموم."
            ]
          },
          {
            "number": "506",
            "paragraphs": [
              "تضمن في السجل العدلي المقررات المحتوية على تدابير الحماية أو التهذيب.",
              "غير أنه لا يشار إليها إلا في البطائق رقم 2 المسلمة للقضاة وللمصلحة المكلفة بالحرية المحروسة، باستثناء أية سلطة أو مصلحة عمومية أخرى، كما تنص على ذلك الفقرة الأخيرة من المادة 665 بعده."
            ]
          },
          {
            "number": "507",
            "paragraphs": [
              "إذا تأكد تحسن سيرة الحدث، يمكن لقاضي الأحداث، بعد انصرام أجل ثلاث سنوات ابتداءً من يوم انتهاء مدة تدبير الحماية أو التهذيب، أن يأمر بإلغاء البطاقة رقم 1 التي تنص على التدبير المتخذ في حقه، إما تلقائياً أو بطلب من النيابة العامة أو من الحدث أو ممثله القانوني أو الوصي عليه أو المقدم عليه أو كافله أو الشخص أو المؤسسة المكلفة برعايته.",
              "يختص بالنظر في ذلك كل من القاضي الذي أجرى المتابعة الأولى، أو القاضي الذي يوجد في دائرته الموطن الحالي للحدث، أو القاضي الذي كانت ولادة الحدث بدائرته.",
              "يقبل مقرر القاضي بالرفض الطعن بالاستئناف أمام الغرفة الجنحية للأحداث لدى محكمة الاستئناف داخل أجل عشرة أيام.",
              "إذا صدر الأمر بالإلغاء، أتلفت البطاقة رقم 1 المتعلقة بالتدبير المذكور."
            ]
          },
          {
            "number": "508",
            "paragraphs": [
              "يتعين في جميع الحالات التي يسلم فيها الحدث مؤقتاً أو نهائياً لغير أبيه أو أمه أو الوصي عليه أو المقدم عليه أو كافله أو حاضنه إصدار حكم يتضمن تحديد الحصة التي تتحملها الأسرة من صوائر الرعاية والإيداع، مع مراعاة مداخيلها.",
              "تعفى الأسرة من هذه المصاريف إذا أثبتت عوزها.",
              "تستخلص هذه الصوائر باعتبارها من صوائر القضاء الجنائي.",
              "تؤدى التعويضات العائلية والمساعدات الاجتماعية التي يستحقها الحدث، في سائر الأحوال وخلال مدة الرعاية أو الإيداع، من طرف الهيئة المدينة بها إلى الشخص أو المؤسسة المكلفة بالحدث.",
              "إذا سلم الحدث لمصلحة عمومية مكلفة برعاية الطفولة، فإن الدولة تتحمل الحصة غير الواجبة على الأسرة من صوائر الرعاية والإيداع."
            ]
          },
          {
            "number": "509",
            "paragraphs": [
              "تعفى الأحكام الصادرة عن الهيئات القضائية للأحداث من إجراءات التنبر والتسجيل، باستثناء ما يرجع منها للبت في المطالب المدنية إن اقتضى الحال ذلك."
            ]
          }
        ]
      },
      {
        "name": "القسم السادس",
        "title": "حماية الأطفال ضحايا جنايات أو جنح",
        "articles": [
          {
            "number": "510",
            "paragraphs": [
              "إذا ارتكبت جناية أو جنحة وكان ضحيتها حدثاً لا يتجاوز عمره ثماني عشرة سنة، فلِقاضي الأحداث أو المستشار المكلف بالأحداث، إما تلقائياً وإما استناداً إلى ملتمسات النيابة العامة أو إلى طلبات أحد الأطراف أو دفاعه، وبعد أخذ رأي النيابة العامة، أن يصدر أمراً قضائياً بإيداع الحدث المجني عليه لدى شخص من عائلته جدير بالثقة، أو لدى أسرة مستقبلة، أو مؤسسة خصوصية، أو جمعية معترف لها بصفة المنفعة العامة مؤهلة لذلك، أو بتسليمه إلى مصلحة أو مؤسسة عمومية مكلفة برعاية الطفولة، إلى أن يصدر حكم نهائي في موضوع الجناية أو الجنحة.",
              "ينفذ هذا الأمر رغم كل طعن.",
              "يمكن للنيابة العامة أو لقاضي الأحداث أو للمستشار المكلف بالأحداث الأمر بعرض الحدث على خبرة طبية أو نفسية أو عقلية لتحديد نوع وأهمية الأضرار اللاحقة به، وبيان ما إذا كان يحتاج إلى علاج ملائم لحالته حالاً ومستقبلاً.",
              "يمكنهم أيضاً الاستعانة بمكتب المساعدة الاجتماعية بالمحكمة، الذي يتولى الاستقبال الأولي للأطفال الضحايا في مكتب خاص يراعي خصوصية أوضاعهم ومصلحتهم الفضلى، ويعمل على تقديم الدعم النفسي لهم والاستماع إليهم، كما يتولى مرافقتهم داخل المحاكم."
            ]
          },
          {
            "number": "511",
            "paragraphs": [
              "يمكن للنيابة العامة، في حالة صدور حكم من أجل جناية أو جنحة ارتكبت ضد حدث، أن تحيل القضية على قاضي الأحداث أو المستشار المكلف بالأحداث المختص، إذا ارتأت أن مصلحة الحدث تبرر ذلك.",
              "يمكن للقاضي المذكور أن يتخذ ما يراه مناسباً من تدابير الحماية، كما يمكنه أن يأمر بالتنفيذ المعجل لقراره.",
              "يمكن للنيابة العامة وللحدث أو لأبويه أو لوصيه عليه أو للمقدم عليه أو لحاضنه أو لكافله أو للمكلف برعايته، أن يستأنف قرار القاضي داخل أجل عشرة أيام من تاريخ صدوره أمام الغرفة الجنحية للأحداث بمحكمة الاستئناف."
            ]
          }
        ]
      },
      {
        "name": "القسم السابع",
        "title": "حماية الأطفال الموجودين في وضعية صعبة",
        "articles": [
          {
            "number": "512",
            "paragraphs": [
              "يمكن لقاضي الأحداث لدى المحكمة الابتدائية، بناءً على ملتمس النيابة العامة، أن يتخذ لفائدة الحدث الموجود في وضعية صعبة أي تدبير يراه كفيلاً بحمايته، من بين التدابير المنصوص عليها في البنود 1 و3 و4 و5 و6 من المادة 471 من هذا القانون."
            ]
          },
          {
            "number": "513",
            "paragraphs": [
              "يعتبر الحدث في وضعية صعبة إذا كانت سلامته البدنية أو الذهنية أو النفسية أو الأخلاقية أو تربيته معرضة للخطر.",
              "تتحقق هذه الوضعية إذا كان الحدث يختلط بأشخاص منحرفين أو معرضين للانحراف أو معروفين بسوء سيرتهم أو من ذوي السوابق في الإجرام.",
              "تتحقق كذلك إذا تمرد الحدث على سلطة أبويه أو حاضنه أو الوصي عليه أو المقدم عليه أو كافله أو الشخص أو المؤسسة المكلفة برعايته.",
              "تعتبر الوضعية صعبة أيضاً إذا اعتاد الحدث الهروب من المؤسسة التي يتابع بها دراسته أو تكوينه، أو هجر مقر إقامته، أو لعدم توفره على مكان صالح يستقر فيه."
            ]
          },
          {
            "number": "514",
            "paragraphs": [
              "إذا رأى قاضي الأحداث أن حالة الحدث الصحية أو النفسانية أو سلوكه العام تستوجب فحصاً عميقاً، أمر بإيداعه مؤقتاً لمدة لا تتجاوز ثلاثة أشهر بمركز مقبول مؤهل لذلك."
            ]
          },
          {
            "number": "515",
            "paragraphs": [
              "يعهد إلى أحد مندوبي الحرية المحروسة أو إلى المساعدات والمساعدين الاجتماعيين بالمحكمة بتتبع حالة الحدث وظروف تنفيذ التدابير، وفقاً للكيفيات المنصوص عليها في المواد من 496 إلى 500 من هذا القانون."
            ]
          },
          {
            "number": "516",
            "paragraphs": [
              "يمكن لقاضي الأحداث أن يأمر في كل وقت بإلغاء التدابير المتخذة أو تغييرها إذا اقتضت مصلحة الحدث ذلك.",
              "يصدر القاضي أمره إما تلقائياً أو بناءً على طلب من وكيل الملك أو الحدث أو أبويه أو الوصي عليه أو المقدم عليه أو حاضنه أو كافله أو الشخص أو المؤسسة المكلفة برعايته.",
              "يمكن أيضاً إصدار الأمر بناءً على تقرير يقدمه مندوب الحرية المحروسة أو مكتب المساعدة الاجتماعية بالمحكمة.",
              "يتعين أخذ رأي وكيل الملك إذا لم يكن هو من تقدم بالطلب."
            ]
          },
          {
            "number": "517",
            "paragraphs": [
              "ينتهي مفعول التدابير المأمور بها بانتهاء المدة التي حددها أمر قاضي الأحداث.",
              "ينتهي مفعول هذه التدابير في جميع الأحوال ببلوغ الحدث سن ثماني عشرة سنة ميلادية كاملة."
            ]
          }
        ]
      }
    ]
  }