{
    "name": "الكتاب السادس",
    "title": "تنفيذ المقررات القضائية والسجل العدلي ورد الاعتبار",
    "sections": [
      {
        "name": "القسم الأول",
        "title": "تنفيذ المقررات القضائية",
        "chapters": [
          {
            "name": "الباب الأول",
            "title": "أحكام عامة",
            "articles": [
              {
                "number": "596",
                "paragraphs": [
                  "يعين قاض أو أكثر من قضاة المحكمة الابتدائية للقيام بمهام قاضي تطبيق العقوبات.",
                  "يعين هؤلاء القضاة من قبل المجلس الأعلى للسلطة القضائية باقتراح من رئيس المحكمة الابتدائية لمدة ثلاث سنوات قابلة للتجديد.",
                  "إذا حدث مانع لقاضي تطبيق العقوبات حال دون قيامه بمهامه، يعين رئيس المحكمة قاضيا للنيابة عنه مؤقتا.",
                  "يعهد إلى قاضي تطبيق العقوبات بزيارة المؤسسات السجنية التابعة لدائرة المحكمة الابتدائية التي ينتمي إليها مرة كل شهر على الأقل.",
                  "يتتبع مدى تطبيق القانون المتعلق بتنظيم وتدبير المؤسسات السجنية، والنصوص التنظيمية الصادرة لتطبيقه في شأن قانونية الاعتقال وحقوق وواجبات السجناء ومراقبة سلامة إجراءات التأديب.",
                  "يطلع على سجلات الاعتقال ويعد تقريرا عن كل زيارة يضمنه ملاحظاته يوجهه إلى الرئيس المنتدب للمجلس الأعلى للسلطة القضائية ووزير العدل ورئيس النيابة العامة والإدارة المكلفة بالسجون، ويحيل نسخة منه إلى وكيل الملك.",
                  "يمكنه مسك بطاقات خاصة بالسجناء الذين يتتبع وضعيتهم تتضمن بيانات حول هويتهم ورقم اعتقالهم والمقررات القضائية والتأديبية الصادرة في شأنهم وملاحظات القاضي.",
                  "يمكنه تقديم مقترحات حول الإفراج المقيد بشروط ومقترحات العفو، كما يتعين عليه تقديم مقترحات للعفو التلقائي بالنسبة للأشخاص المحكوم عليهم بالإعدام، ويتعين في هذه الحالة على النيابة العامة المختصة إشعار قاضي تطبيق العقوبات بالأحكام الصادرة بالإعدام بمجرد صدورها.",
                  "يسهر على مراقبة قرارات التخفيض التلقائي للعقوبة ويرأس اللجنة التي تبت في التظلمات المرفوعة ضد هذه القرارات.",
                  "يختص بالبت في طلبات رد الاعتبار القضائي وتغيير العقوبة وفقا لأحكام المادة 12-749 من هذا القانون.",
                  "يشرف قاضي تطبيق العقوبات على تنفيذ العقوبات البديلة وفق النصوص القانونية والتنظيمية الجاري بها العمل وعلى تحديد مصاريف القيد الإلكتروني التي يمكن فرضها على المحكوم عليه كليا أو جزئيا حسب المبالغ المحددة بنص تنظيمي.",
                  "يمارس مهامه حسب هذا القانون وكذا بموجب أي نصوص أخرى.",
                  "يمكن لقاضي تطبيق العقوبات في إطار ممارسته لمهامه الاستعانة بخدمات مكتب المساعدة الاجتماعية بالمحكمة في إطار إنجاز الأبحاث الاجتماعية.",
                  "في حالة وجود نزاع عارض متعلق بتنفيذ قرارات قاضي تطبيق العقوبات تطبق مقتضيات المادتين 599 و600 أدناه، غير أنه يجب إيقاف تنفيذ قرار قاضي تطبيق العقوبات إلى حين البت في النزاع العارض.",
                  "يتوفر قاضي تطبيق العقوبات على كتابة لمسك المستندات والسجلات، وتوضع رهن إشارته الوسائل اللازمة للقيام بمهامه."
                ]
              },
              {
                "number": "597",
                "paragraphs": [
                  "تقوم النيابة العامة والطرف المدني، كل فيما يخصه، بتتبع تنفيذ المقرر الصادر بالإدانة حسب الشروط المنصوص عليها في هذا القسم.",
                  "يقع التنفيذ بطلب من النيابة العامة عندما يصبح المقرر غير قابل لأي طريقة من طرق الطعن العادية، أو للطعن بالنقض لمصلحة الأطراف.",
                  "يحق لوكيل الملك أو الوكيل العام للملك أن يسخر القوة العمومية لهذه الغاية."
                ]
              },
              {
                "number": "1-597",
                "paragraphs": [
                  "في حالة صدور مقرر قضائي حائز لقوة الشيء المقضي به يقضي بعقوبة سالبة للحرية من أجل جنحة من الجنح المنصوص عليها في المادة 1-41 من هذا القانون، يمكن للنيابة العامة تلقائيا أو بناء على طلب المعني بالأمر أو دفاعه، في حالة تنازل الطرف المشتكي أو المتضرر من الفعل الجرمي وأداء قيمة الغرامات والمصاريف القضائية، أن تتقدم بملتمس للمحكمة المصدرة للحكم يرمي إلى إيقاف تنفيذ العقوبة السالبة للحرية.",
                  "يضع قرار المحكمة القاضي بإيقاف تنفيذ العقوبة حدا لتنفيذها، وإذا كان المحكوم عليه مودعا بالمؤسسة السجنية، فإن المحكمة تأمر بالإفراج عليه فورا."
                ]
              },
              {
                "number": "598",
                "paragraphs": [
                  "يمكن أن يجري التنفيذ بطلب من الطرف المدني طبقا لقواعد المسطرة المدنية، بمجرد ما يصبح المقرر الصادر بمنح التعويضات المدنية نهائيا لعدم قبوله لأي طريق من طرق الطعن العادية.",
                  "لا يجوز تطبيق الإكراه البدني إلا إذا اكتسب المقرر المذكور قوة الشيء المقضي به."
                ]
              },
              {
                "number": "599",
                "paragraphs": [
                  "يرجع النظر في النزاعات العارضة المتعلقة بالتنفيذ إلى المحكمة التي أصدرت المقرر المراد تنفيذه، ويمكن لهذه المحكمة أيضا أن تقوم بتصحيح الأخطاء المادية الصرفة الواردة فيه."
                ]
              },
              {
                "number": "600",
                "paragraphs": [
                  "تنظر المحكمة في النزاعات العارضة بغرفة المشورة بناء على ملتمسات النيابة العامة أو بناء على طلب يرفعه الطرف الذي يهمه الأمر أو دفاعه أو مدير المؤسسة السجنية المعتقل بها المعني بالأمر أو من طرف كل ذي مصلحة، ويستمع إلى ممثل النيابة العامة وإلى محامي الطرف إن طلب ذلك وإلى الطرف شخصيا إن اقتضى الحال.",
                  "يمكن للمحكمة أن تأمر بتوقيف التنفيذ المتنازع فيه.",
                  "لا يقبل المقرر الفاصل في النزاع أي طعن ما عدا الطعن بالنقض."
                ]
              }
            ]
          },
          {
            "name": "الباب الثاني",
            "title": "تنفيذ عقوبة الإعدام",
            "articles": [
              {
                "number": "601",
                "paragraphs": [
                  "يتعين على النيابة العامة أن تنهي إلى علم وزير العدل كل قرار بعقوبة الإعدام بمجرد صدوره."
                ]
              },
              {
                "number": "602",
                "paragraphs": [
                  "لا يمكن تنفيذ عقوبة الإعدام إلا بعد رفض طلب العفو.",
                  "إذا كانت المحكوم عليها امرأة ثبت حملها، فإنها لا تعدم إلا بعد مرور سنتين على وضع حملها.",
                  "تنفذ عقوبة الإعدام بأمر من وزير العدل رميا بالرصاص، وتقوم بذلك السلطة العسكرية التي تطلبها لهذه الغاية النيابة العامة لدى المحكمة التي أصدرت القرار."
                ]
              },
              {
                "number": "603",
                "paragraphs": [
                  "لا يكون التنفيذ علنيا إلا إذا قرر وزير العدل ذلك.",
                  "يقع التنفيذ داخل المؤسسة السجنية التي يوجد المحكوم عليه رهن الاعتقال بها أو في أي مكان آخر يعينه وزير العدل وذلك بحضور الأشخاص الآتي بيانهم:",
                  "-1 رئيس الغرفة الجنائية التي أصدرت القرار وإلا فمستشار من هذه الغرفة يعينه الرئيس الأول لمحكمة الاستئناف؛",
                  "-2 عضو من النيابة العامة يعينه الوكيل العام للملك لمحكمة الاستئناف التي أصدرت القرار؛",
                  "-3 أحد قضاة التحقيق وإلا فأحد القضاة من محكمة المكان الذي سيقع به التنفيذ يعين من طرف رئيس المحكمة المذكورة؛",
                  "-4 أحد كتاب الضبط من محكمة المكان الذي سيقع به التنفيذ؛",
                  "-5 محامو المحكوم عليه؛",
                  "-6 مدير المؤسسة السجنية التي يقع بها التنفيذ أو مدير السجن الذي كان المحكوم عليه معتقاً به عندما يقع التنفيذ بمكان آخر؛",
                  "-7 رجال الأمن الوطني أو الدرك الملكي المكلفون من قبل النيابة العامة؛",
                  "-8 طبيب المؤسسة السجنية، وإذا تعذر ذلك، فطبيب تعينه النيابة العامة؛",
                  "-9 إمام وعدلان، وإذا لم يكن المحكوم عليه مسلماً فيحضر ممثل الديانة السماوية التي يعتنقها المنفذ عليه."
                ]
              },
              {
                "number": "604",
                "paragraphs": [
                  "إذا أراد المحكوم عليه أن يفضي بأي تصريح، فيتلقاه منه قاضي التحقيق أو القاضي المشار إليه في البند رقم 3 من المادة السابقة بمساعدة كاتب الضبط."
                ]
              },
              {
                "number": "605",
                "paragraphs": [
                  "يحرر محضر التنفيذ فورا من قبل كاتب الضبط، ويوقعه كل من رئيس غرفة الجنايات أو المستشار المعين من طرف الرئيس الأول لمحكمة الاستئناف وممثل النيابة العامة وكاتب الضبط.",
                  "تعلق مباشرة بعد التنفيذ نسخة من هذا المحضر بباب المؤسسة السجنية التي وقع فيها التنفيذ وتبقى معلقة لمدة أربع وعشرين ساعة.",
                  "إذا وقع التنفيذ خارج المؤسسة السجنية، يعلق المحضر بباب بلدية مكان التنفيذ."
                ]
              },
              {
                "number": "606",
                "paragraphs": [
                  "لا يمكن أن ينشر عن طريق الصحافة أي بيان أو مستند يتعلق بالتنفيذ ما عدا المحضر المذكور، وإلا تعرض المخالف لغرامة تتراوح بين 10.000 و 60.000 درهم.",
                  "يمنع تحت طائلة نفس العقوبة أن ينشر أو يذاع بأي وسيلة من الوسائل، قبل التنفيذ أو قبل تبليغ ظهير العفو لعلم المحكوم عليه، أي خبر أو أي رأي أبدته لجنة العفو، أو الأمر الصادر عن جلالة الملك."
                ]
              },
              {
                "number": "607",
                "paragraphs": [
                  "تسلم جثة المحكوم عليه إثر التنفيذ إلى عائلته إذا طلبت ذلك، على أن تلتزم بدفنه في غير علانية، وإلا فيتم دفنه من طرف الجهات المختصة بمسعى من النيابة العامة."
                ]
              }
            ]
          },
          {
            "name": "الباب الثالث",
            "title": "تنفيذ الاعتقال الاحتياطي أو المؤقت والعقوبات السالبة للحرية",
            "articles": [
              {
                "number": "608",
                "paragraphs": [
                  "لا يمكن حرمان شخص من حريته إلا بمقتضى سند صادر عن السلطة القضائية يأمر باعتقاله احتياطيا أو مؤقتا أو بناء على سند يأمر بتنفيذ مقرر مكتسب لقوة الشيء المقضي به صادر عن هيئة قضائية يقضي عليه بعقوبة السجن أو الحبس أو الإكراه البدني، مع مراعاة مقتضيات المادتين 66 و80 من هذا القانون المتعلقتين بالوضع تحت الحراسة النظرية.",
                  "لا يمكن الاعتقال إلا بمؤسسات سجنية تابعة للإدارة المكلفة بالسجون وخاضعة لمراقبة السلطات القضائية وفقا لما ينص عليه القانون."
                ]
              },
              {
                "number": "609",
                "paragraphs": [
                  "يترتب عن كل إيداع في السجن، بناء على سند من السندات الصادرة عن السلطة القضائية المنصوص عليها في المادة 608، إعداد ملف خاص بكل معتقل، سواء كان التنفيذ بواسطة القوة العمومية أو تقدم المعني بالأمر إلى السجن عن طواعية واختيار."
                ]
              },
              {
                "number": "610",
                "paragraphs": [
                  "يتعين على كل منفذ لأمر قضائي بالإيداع في السجن أن يمتثل للإجراءات المنصوص عليها في الفقرة 2 من المادة 15 من القانون رقم 98-23 بشأن تنظيم وتسيير المؤسسات السجنية الصادر بتنفيذه الظهير الشريف رقم 1.99.200 بتاريخ 13 من جمادى الأولى 1420 (25 أغسطس 1999)."
                ]
              },
              {
                "number": "611",
                "paragraphs": [
                  "لا يمكن لأي مأمور من إدارة السجون أن يقبل أو يحجز شخصا، إلا إذا قدم له سند من سندات الاعتقال المنصوص عليها في المادة 608 أعلاه، وبعد تسجيل هذا السند في سجل الاعتقال المنصوص عليه في المادة 13 من القانون رقم 98-23 المشار إليه في المادة السابقة، وإلا اعتبر مرتكبا لجريمة الاعتقال التحكمي."
                ]
              },
              {
                "number": "612",
                "paragraphs": [
                  "يجب أن تتوفر كل مؤسسة سجنية على سجل للاعتقال.",
                  "يقدم هذا السجل من أجل المراقبة والتأشير إلى السلطات القضائية المختلفة عند كل زيارة تقوم بها، وكذا إلى السلطات الإدارية المختصة بإجراء التفتيش العام للمؤسسة، وذلك وفقا للطريقة المنصوص عليها في القانون المنظم للمؤسسات السجنية."
                ]
              },
              {
                "number": "613",
                "paragraphs": [
                  "يضاف عند الاقتضاء التاريخ الفعلي لحرمان شخص من حريته إلى تاريخ إيداعه في السجن، ويؤخذ بعين الاعتبار تاريخ القبض عليه ومدة وضعه تحت الحراسة النظرية.",
                  "عند تعدد أوامر الإيداع بالسجن الصادرة في حق المعتقل احتياطيا، يتم بالأولوية تنفيذ المقرر القضائي القاضي بعقوبة سالبة للحرية نافذة بعد حيازته لقوة الأمر المقضي به، مع مراعاة مقتضيات الفصل 120 من مجموعة القانون الجنائي.",
                  "ولا يمكن في كل الأحوال أن يقضي الشخص المعتقل بموجب أوامر متعددة أكثر من مجموع المدد المحكوم بها عليه في المقررات القضائية الصادرة في حقه."
                ]
              },
              {
                "number": "1-613",
                "paragraphs": [
                  "عند تعدد الجرائم وفقا للفصل 119 من مجموعة القانون الجنائي، تتولى النيابة العامة بآخر محكمة مصدرة للعقوبة السالبة للحرية، تلقائيا أو بناء على طلب من المحكوم عليه أو دفاعه أو مدير المؤسسة السجنية أو من يعنيه الأمر، مباشرة إجراءات إدماج العقوبة الواردة في الفقرة الثانية من الفصل 120 من نفس القانون.",
                  "يمكن المنازعة في قرار النيابة العامة وفقا لأحكام المادتين 599 و 600 من هذا القانون."
                ]
              },
              {
                "number": "2-613",
                "paragraphs": [
                  "يمكن لضابط الشرطة القضائية من أجل تنفيذ العقوبات السالبة للحرية، الاحتفاظ بالمحكوم عليه في المكان المعد للوضع تحت الحراسة النظرية أو الاحتفاظ داخل أجل لا يتعدى 24 ساعة من تاريخ الاحتفاظ إلى حين إيداعه في المؤسسة السجنية.",
                  "وينجز محضر يبين فيه ساعة ومكان إيقاف الشخص المحكوم عليه ومراجع القرار القضائي القاضي بعقوبة سالبة للحرية وتاريخ إيداعه في المؤسسة السجنية.",
                  "يمكن بصفة استثنائية تمديد الأجل المذكور في الفقرة أعلاه لمدة 24 ساعة إضافية بإذن من النيابة العامة بمكان الإيقاف.",
                  "يتولى ضابط الشرطة القضائية الذي قام بتوقيفه بإنجاز محضر بذلك، ويشعر الشرطة القضائية المختصة ترابيا لمباشرة عملية النقل والإيداع في السجن.",
                  "تحتسب مدة العقوبة السالبة للحرية منذ الساعة الأولى لإيقاف الشخص المحكوم عليه، ولهذه الغاية تسلم نسخة من محضر الإيقاف إلى المؤسسة السجنية."
                ]
              },
              {
                "number": "3-613",
                "paragraphs": [
                  "عند تحقق الأسباب القانونية لإلغاء وقف تنفيذ العقوبة وفقا لأحكام الفصل 56 من مجموعة القانون الجنائي، تتولى النيابة العامة تلقائيا بعد حيازة المقرر القضائي الثاني لقوة الشيء المقضي به مباشرة إجراءات تنفيذ العقوبة الأولى التي صدرت موقوفة التنفيذ، والتي تنفذ قبل العقوبة الثانية دون إمكانية إدماجها."
                ]
              },
              {
                "number": "614",
                "paragraphs": [
                  "يتعين على مدير المؤسسة السجنية الإفراج عن المعتقلين الاحتياطيين أو المؤقتين الذين أمرت السلطة القضائية المختصة بالإفراج عنهم، وكذا المعتقلين أو المكرهين بدنيا الذين أنهوا العقوبات الصادرة في حقهم ما لم يكن هناك أمر يستوجب استمرار اعتقالهم.",
                  "يرفع الاعتقال عن المودع في السجن ببيان يضمن في ملف المعتقل وفي سجل الاعتقال عند الإفراج عن المعتقل أو عند خروجه نهائيا من المؤسسة السجنية لأي سبب كان، ويجب أن يشار إلى هذا السبب في سند الاعتقال.",
                  "كما يشار بملف المعتقل وبسجل الاعتقال إلى يوم وساعة الخروج من السجن."
                ]
              },
              {
                "number": "615",
                "paragraphs": [
                  "يودع المتهمون المعتقلون بصفة احتياطية بسجن محلي بالمكان الموجودة فيه المحكمة المحالة إليها القضية في المرحلة الابتدائية أو الاستئنافية حسب الأحوال، كلما سمحت بذلك ضرورة الأمن والقدرة الإيوائية للمؤسسة السجنية.",
                  "يسمح للمعتقلين احتياطياً بجميع الاتصالات والتسهيلات المتلائمة مع مستلزمات النظام والأمن، لتمكينهم من ممارسة حقهم في الدفاع في نطاق الحدود المقررة في القانون رقم 98-23 المتعلق بتنظيم وتسيير المؤسسات السجنية الصادر بتنفيذه الظهير الشريف رقم 1.99.200 بتاريخ 13 من جمادى الأولى 1420 (25 أغسطس 1999)."
                ]
              },
              {
                "number": "616",
                "paragraphs": [
                  "يقوم قاضي تطبيق العقوبات ووكيل الملك أو أحد نوابه بتفقد السجناء على الأقل مرة كل شهر، وذلك من أجل التأكد من صحة الاعتقال ومراقبة مدى احترام ظروف أنسنة تنفيذ العقوبة وكذا من حسن مسك سجلات الاعتقال.",
                  "يقوم قاضي الأحداث ووكيل الملك أو أحد نوابه بتفقد الأحداث المودعين بالمراكز والمؤسسات المقبولة والمؤهلة لهذه الغاية مرة كل شهر.",
                  "يمكن للسلطات القضائية المذكورة في الفقرتين أعلاه الاستعانة بخدمات مكتب المساعدة الاجتماعية بالمحكمة عند زيارة مراكز الإيداع والمؤسسات السجنية.",
                  "تحرر الجهات القضائية المشار إليها في الفقرتين أعلاه تقريرا بشأن كل زيارة يرفع إلى وزير العدل ورئيس النيابة العامة والرئيس المنتدب للمجلس الأعلى للسلطة القضائية والإدارة المكلفة بالسجون مشفوعا بوجهة نظر واقتراحات الجهات القضائية المذكورة."
                ]
              },
              {
                "number": "617",
                "paragraphs": [
                  "يجب على ممثل النيابة العامة لدى كل محكمة زجرية تم تكليفه بتنفيذ أحكام تقضي بعقوبات سالبة للحرية، أن يمسك سجلا يخصص لتنفيذ العقوبات.",
                  "تضمن في السجل المعلومات بالترتيب يوما بيوم بعد كل جلسة، وعند القيام بكل مبادرة تتعلق بالتنفيذ."
                ]
              },
              {
                "number": "618",
                "paragraphs": [
                  "لا يعتبر مداناً إلا الشخص الذي صدر في حقه مقرر قضائي اكتسب قوة الشيء المقضي به.",
                  "يعتبر معتقلاً احتياطياً كل متهم في مرحلة التحقيق أو المحاكمة لم يصدر بعد في حقه حكم أو قرار قضائي.",
                  "يعتبر معتقلاً محكوماً عليه كل متهم صدر في حقه مقرر قضائي لم يكتسب بعد قوة الشيء المقضي به. ويستفيد خلال ممارسته للطعون من جميع الضمانات المقررة للمعتقل الاحتياطي.",
                  "يعتبر معتقلاً مؤقتاً كل شخص تم إيداعه بالسجن في إطار مسطرة التسليم.",
                  "يعتبر مكرهاً بدنياً كل شخص تم حبسه بسبب عدم أداء ما بذمته من دين."
                ]
              },
              {
                "number": "619",
                "paragraphs": [
                  "يخضع السجناء المتهمون أو المتابعون بمتابعة جديدة المحكوم عليهم من أجل جريمة أخرى، لنفس النظام المطبق على باقي المحكوم عليهم، غير أنه يجب أن تمنح لهم كل التسهيلات لضمان حقهم في الدفاع.",
                  "يمكن، عند الاقتضاء، أن يفرض عليهم قاضي التحقيق المنع من الاتصال بالغير، مع مراعاة مقتضيات القانون رقم 23.98 المتعلق بتنظيم وتسيير المؤسسات السجنية المشار إليه أعلاه."
                ]
              },
              {
                "number": "620",
                "paragraphs": [
                  "تكلف في كل ولاية أو عمالة أو إقليم لجنة للمراقبة، يناط بها على الخصوص السهر على توفير وسائل الصحة والأمن والوقاية من الأمراض وعلى نظام تغذية المعتقلين وظروف حياتهم العادية وكذا المساعدة على إعادة تربيتهم الأخلاقية وإدماجهم اجتماعياً وإحلالهم محلاً لائقاً بعد الإفراج عنهم.",
                  "ويترأس هذه اللجنة الوالي أو العامل أو مفوض من قبله، ويساعده رئيس المحكمة الابتدائية ووكيل الملك بها وقاضي تطبيق العقوبات ومساعدة أو مساعد بمكتب المساعدة الاجتماعية بالمحكمة وممثل السلطة العمومية المكلفة بالصحة ورئيس مجلس الجهة ورئيس مجلس الجماعة اللتين توجد بهما المؤسسة وممثلو قطاعات التربية الوطنية والشؤون الاجتماعية والشبيبة والرياضة والتكوين المهني.",
                  "تضم اللجنة زيادة على ذلك، أعضاء متطوعين يعينهم وزير العدل من بين الجمعيات أو من بين الشخصيات المعروفة باهتمامها بمصير المحكوم عليهم."
                ]
              },
              {
                "number": "621",
                "paragraphs": [
                  "تؤهل اللجنة المنصوص عليها في المادة 620 أعلاه لزيارة المؤسسات السجنية الموجودة في الجهة أو العمالة أو الإقليم مرة كل ستة أشهر على الأقل، وترفع إلى كل من وزير العدل والرئيس المنتدب للمجلس الأعلى للسلطة القضائية ورئيس النيابة العامة والمندوب العام لإدارة السجون وإعادة الإدماج ورئيس المجلس الوطني لحقوق الإنسان الملاحظات التي ترى من الواجب إبداؤها وتشير إلى أنواع الإخلالات التي يجب إنهاؤها وإلى التحسينات التي ينبغي تحقيقها.",
                  "يمكنها أن تقدم إلى لجنة العفو أو لجنة الإفراج المقيد بشروط توصية بمن يظهر لها من المعتقلين استحقاقه ذلك.",
                  "لا يمكن للجنة المنصوص عليها في المادة 620 أعلاه أن تقوم بأي عمل من أعمال السلطة.",
                  "تؤهل اللجنة كذلك لزيارة المؤسسات المكلفة برعاية الأحداث الجانحين المنصوص عليها في المادتين 471 و 481 أعلاه.",
                  "وفي هذه الحالة فإنه يضاف إلى تشكيلة اللجنة قاضي الأحداث لدى المحكمة الابتدائية وممثلو القطاعات العمومية المكلفة بالطفولة، كما يمكن أن يضاف إليها أعضاء متطوعون يعينهم وزير العدل من بين الجمعيات أو الشخصيات المعروفة باهتمامها برعاية الطفولة وحمايتها.",
                  "وترفع اللجنة في هذه الحالة إلى جانب السلطات والهيئات المشار إليها في الفقرة الأولى أعلاه إلى الجهة المعنية برعاية الأحداث الملاحظات المشار إليها في الفقرة الأولى من هذه المادة."
                ]
              }
            ]
          },
          {
            "name": "الباب الرابع",
            "title": "الإفراج المقيد بشروط",
            "articles": [
              {
                "number": "622",
                "paragraphs": [
                  "يمكن للمحكوم عليهم بعقوبة سالبة للحرية من أجل جناية أو جنحة، الذين برهنوا بما فيه الكفاية على تحسن سلوكهم، أن يستفيدوا من الإفراج المقيد بشروط إذا كانوا من بين:",
                  "1- المحكوم عليهم من أجل جنحة الذين قضوا حبسا فعليا يعادل على الأقل نصف العقوبة المحكوم بها؛",
                  "2- المحكوم عليهم بعقوبة جنائية أو بعقوبة جنحية من أجل وقائع وصفت بأنها جناية، أو من أجل جنحة يتجاوز الحد الأقصى للعقوبة المقررة لها خمس سنوات حبسا إذا قضوا حبسا فعليا يعادل على الأقل ثلثي العقوبة المحكوم بها.",
                  "إذا تعلق الأمر بمحكوم عليهم بالإقصاء، فإنه يمكن أن تكون مدة اعتقالهم الفعلي أقل من ثلاث سنوات تحسب من اليوم الذي أصبح فيه تدبير الإقصاء ساري المفعول."
                ]
              },
              {
                "number": "623",
                "paragraphs": [
                  "إذا وجب قضاء عدة عقوبات بالتتابع، تعين ضمها واستخلاص مدة الاعتقال المفروضة من مجموعها.",
                  "إذا كان تخفيض العقوبة ناتجا عن عفو، فيجري الحساب باعتبار العقوبة المخفضة.",
                  "تؤخذ بعين الاعتبار مدة العقوبة التي تم قضاؤها مسبقا عند استبدال عقوبة بأخرى حتى لو كان تاريخ بدء سريان العقوبة الجديدة هو تاريخ صدور الظهير الشريف المتعلق بالعفو."
                ]
              },
              {
                "number": "624",
                "paragraphs": [
                  "تكون بوزارة العدل لجنة للإفراج المقيد بشروط، تكلف بإبداء الرأي في اقتراحات الإفراج، ويتولى رئاستها نيابة عن وزير العدل مدير الشؤون الجنائية والعفو أو من يمثله، وتتكون من مدير إدارة السجون وإعادة الإدماج أو من يمثله، وممثل عن الرئيس الأول لمحكمة النقض وممثل عن الوكيل العام للملك لدى محكمة النقض.",
                  "يتولى كتابة اللجنة موظف بمديرية الشؤون الجنائية والعفو."
                ]
              },
              {
                "number": "625",
                "paragraphs": [
                  "يعد رئيس المؤسسة السجنية التي يقضي بها المحكوم عليه عقوبته اقتراحات الإفراج المقيد بشروط، إما تلقائيا أو بناء على طلب من المعني بالأمر أو عائلته، وإما بتعليمات من وزير العدل أو مدير إدارة السجون، أو بمبادرة من قاضي تطبيق العقوبات طبقا لمقتضيات المادة 155 من المرسوم رقم 2.00.485 الصادر في 6 شعبان 1421 (3 نوفمبر 2000) تحدد بموجبه كيفية تطبيق القانون رقم 23.98 المتعلق بتنظيم وتسيير المؤسسات السجنية الصادر بتنفيذه الظهير الشريف رقم 1.99.200 بتاريخ 13 من جمادى الأولى 1420 (25 أغسطس 1999).",
                  "ويوجه رئيس المؤسسة السجنية هذه الاقتراحات، بعد تضمينها رأيه المعلل، إلى مدير إدارة السجون وإعادة الإدماج الذي يطبق مقتضيات المادة 156 من المرسوم السالف الذكر ويعرضها على اللجنة المشار إليها في المادة 624 أعلاه."
                ]
              },
              {
                "number": "626",
                "paragraphs": [
                  "تعرض اقتراحات الإفراج المقيد بشروط المتوصل بها على أنظار اللجنة فور تجهيزها.",
                  "ويمكن للجنة مكاتبة السلطات المعنية للحصول على الوثائق والمعطيات اللازمة بما فيها التأكد من واقعة الصلح أو التنازل أو أداء التعويضات المحكوم بها.",
                  "خلافا لمقتضيات المادة 526 من هذا القانون، يمكن للمحكوم عليهم الأحداث أو المدرجين ضمن الحالات الإنسانية، أو الحالات المندرجة في عداد المرضى أو المسنين أو الأمهات الحوامل أو المرفقات بأطفال أن يستفيدوا من الإفراج المقيد بشروط، إذا قضوا حبسا فعليا يعادل على الأقل ربع العقوبة المحكوم بها في الجنح ونصف العقوبة المحكوم بها في الجنايات."
                ]
              },
              {
                "number": "627",
                "paragraphs": [
                  "يتم منح الاستفادة من الإفراج المقيد بشروط بقرار لوزير العدل بناء على رأي اللجنة المشار إليها في المادة 624 أعلاه.",
                  "يمكن بمقتضى هذا القرار إخضاع الإفراج المقيد لبعض الشروط واتخاذ تدابير مراقبة تكون الغاية منها تسهيل وتحقيق إعادة إدماج المستفيدين من الإفراج في المجتمع خاصة:",
                  "1 - أداء المبالغ الواجبة للخزينة أو التعويضات المحكوم بها للضحايا؛",
                  "2 - الالتزام بالانخراط في القوات المسلحة الملكية إذا كان الأمر يتعلق بمواطن؛",
                  "3 - الطرد من تراب المملكة إذا كان الأمر يتعلق بأجنبي؛",
                  "4 - الخضوع لواحد أو أكثر من تدابير المراقبة القضائية المشار إليها في المادة 161 من هذا القانون.",
                  "يجب أن ينص القرار على بيان اسم السجين الذي سيفرج عنه والسجن الذي يقضي فيه العقوبة، وتاريخ ابتداء الإفراج الممنوح، والمكان الذي يتعين على الشخص المفرج عنه أن يجعل فيه موطنه والأجل المحدد له للتوجه إلى هذا المكان، وبيان السلطات التي يتعين على المفرج عنه أن يتقدم إليها بمجرد حلوله بالمكان، والشروط التي يمكنه بمقتضاها إما التنقل مؤقتاً وإما تغيير محل إقامته.",
                  "لا يمنح الإفراج بشروط إذا أبدت اللجنة رأيا برفضه."
                ]
              },
              {
                "number": "628",
                "paragraphs": [
                  "يبلغ قرار الإفراج المقيد بشروط إلى علم المستفيد منه بواسطة مدير السجن الذي يحرر محضرا في شأن التبليغ للمستفيد من الإفراج، ويسلم له رخصة تتضمن بيان هويته وحالته الجنائية ونسخة من القرار ومن محضر التبليغ.",
                  "توجه نسخة من قرار الإفراج إلى وكيل الملك وإلى الوالي أو العامل الذي يتعين على المفرج عنه أن يجعل فيه محل إقامته.",
                  "وتشعر السلطات المذكورة رجال الدرك الملكي ومصالح الشرطة بالقرار وتأمرهم بموافاتها، إن اقتضى الحال، بأية معلومات عن سوء سيرة المفرج عنه أو مخالفته لشروط الإفراج المحددة في القرار.",
                  "توجه كذلك نسخة من قرار الإفراج المقيد بشروط إلى قاضي تطبيق العقوبات الذي يسهر على تتبع تنفيذ الإفراج المقيد بشروط."
                ]
              },
              {
                "number": "629",
                "paragraphs": [
                  "لا يصبح الإفراج نهائيا إلا بانتهاء مدة العقوبة، ويمكن العدول عنه ما دام لم يصبح نهائيا إذا ثبت سوء سلوك المستفيد منه أو عدم احترامه للشروط المحددة في قرار الإفراج المقيد بشروط.",
                  "يتم إلغاء الإفراج المقيد بشروط بقرار لوزير العدل بناء على تقرير يرفعه إليه إما قاضي تطبيق العقوبات أو النيابة العامة أو الوالي أو العامل.",
                  "يمكن في حالة الاستعجال للنيابة العامة، تلقائيا أو بناء على إشعار من الوالي أو العامل الأمر باعتقال المفرج عنه احتياطياً، بشرط إخبار وزير العدل داخل ثمان وأربعين ساعة الذي له أن يقرر ما إذا كان هناك ما يدعو للإبقاء على هذا التدبير."
                ]
              },
              {
                "number": "630",
                "paragraphs": [
                  "يسري مفعول العدول عن الإفراج ابتداء من يوم تجديد الإيداع في السجن، ويقع الإرجاع إلى السجن لقضاء ما بقي من العقوبة المحكوم بها من وقت بدء مفعول الإفراج المقيد بشروط.",
                  "غير أنه تؤخذ بعين الاعتبار لتحديد تاريخ الإفراج النهائي مدة الاعتقال الاحتياطي المنصوص عليها في المادة السابقة."
                ]
              },
              {
                "number": "631",
                "paragraphs": [
                  "تجب الإشارة في البطاقة رقم 1 من السجل العدلي إلى كل قرار بالإفراج المقيد بشروط أو العدول عنه."
                ]
              },
              {
                "number": "632",
                "paragraphs": [
                  "لا تقبل القرارات الصادرة بشأن الإفراج المقيد بشروط أي طعن.",
                  "لا يحول رفض طلب الإفراج المقيد دون تقديم طلب جديد."
                ]
              },
              {
                "number": "1-632",
                "paragraphs": [
                  "يستفيد السجناء الذين أبانوا عن تحسن سلوكهم خلال تنفيذهم للعقوبة، من تخفيض تلقائي للعقوبة السالبة للحرية قدره:",
                  "- خمسة أيام عن كل شهر إذا كانت العقوبة سنة أو أقل؛",
                  "- شهر واحد عن كل سنة وثلاثة أيام عن كل شهر إذا كانت العقوبة المحكوم بها أكثر من سنة.",
                  "لا يستفيد من التخفيض التلقائي للعقوبة المحكوم عليه الذي اتخذ في حقه قرار تأديبي وفقا للمقتضيات التشريعية والتنظيمية المتعلقة بالسجون خلال المدة التي يحتسب على أساسها التخفيض.",
                  "يتم تنفيذ التخفيض تلقائيا من قبل لجنة تتألف من مدير المؤسسة السجنية ورئيس المعقل والمشرف الاجتماعي ورئيس مكتب الضبط القضائي وطبيب المؤسسة في نهاية كل شهر أو كل سنة حسب الأحوال شريطة:",
                  "- 1 أن يكون الحكم مكتسبا لقوة الشيء المقضي به؛",
                  "- 2 أن يكون المحكوم عليه قد قضى على الأقل ربع العقوبة السالبة للحرية المحكوم بها عليه.",
                  "يستفيد المحكوم عليه الذي تأخر في مواجهته صدور حكم مكتسب لقوة الشيء المقضي به من التخفيض التلقائي للعقوبة ابتداء من التاريخ الذي يستوفي فيه الشرط المتعلق بقضاء ربع العقوبة السالبة للحرية المحكوم بها عليه، وذلك ما لم يكن قد قضى عقوبته.",
                  "يجب على المحاكم ومحكمة النقض إشعار المؤسسة السجنية بالطعون المقدمة والأحكام الصادرة في قضايا المعتقلين فور تقديمها أو صدورها.",
                  "تسهر النيابة العامة على التطبيق الفوري لهذا المقتضى."
                ]
              },
              {
                "number": "2-632",
                "paragraphs": [
                  "يمكن أن يستفيد المحكوم عليهم الذين لهم سوابق قضائية والذين أبانوا عن تحسن سلوكهم، من التخفيض التلقائي للعقوبة وذلك في حدود نصف المدة وضمن الشروط المنصوص عليها في المادة 1-632 أعلاه."
                ]
              },
              {
                "number": "3-632",
                "paragraphs": [
                  "يتولى مدير المؤسسة السجنية تنفيذ التخفيض التلقائي للعقوبة بعد توفر شروطه القانونية.",
                  "يحيل المدير المذكور داخل أجل ثلاثة أيام نسخة من قرار التخفيض التلقائي للعقوبة إلى قاضي تطبيق العقوبات وإلى وكيل الملك الذي يوجد بدائرة نفوذه مقر المؤسسة السجنية، مرفقة بملخص الحالة الجنائية للمعني بالأمر يتضمن ملاحظات عن سلوكه وسيرته داخل المؤسسة السجنية وعن العقوبات التأديبية التي اتخذت في حقه وعن مساهمته في البرامج الاجتماعية والتربوية والصحية الرامية إلى تسهيل الإدماج في المجتمع.",
                  "يمكن لقاضي تطبيق العقوبات أو وكيل الملك أن يطلب إيقاف تنفيذ التخفيض المقرر من قبل مدير المؤسسة السجنية خلال ثلاثة أيام من إشعارهما به، وعرض الأمر على لجنة مراقبة تطبيق التخفيض التلقائي المنصوص عليها في المادة 4-632 بعده للبت فيه، وذلك إذا كان لديهما ملاحظات حول سلوك السجين المستفيد، أو في حالة عدم توفر الشروط الأخرى للاستفادة من التخفيض التلقائي للعقوبة.",
                  "يمكن لكل سجين لم يستفد من التخفيض التلقائي للعقوبة رفع تظلمه إلى اللجنة المنصوص عليها في المادة 4-632 بعده.",
                  "تتم إحالة التظلمات فورا إلى قاضي تطبيق العقوبات.",
                  "تصدر اللجنة قرارها داخل أجل خمسة عشر يوما من تاريخ تقديم التظلم إلى إدارة المؤسسة السجنية أو النيابة العامة أو إلى قاضي تطبيق العقوبات.",
                  "تصدر اللجنة قرارها فورا في حالة الاستعجال، وتتوفر حالة الاستعجال إذا كان احتساب المدة المتنازع عليها يؤدي إلى الإفراج الفوري أو الوشيك عن السجين."
                ]
              },
              {
                "number": "4-632",
                "paragraphs": [
                  "تحدث بمقر المحكمة الابتدائية التي توجد بدائرة نفوذها المؤسسة السجنية، لجنة مراقبة تطبيق التخفيض التلقائي للعقوبة، تختص بالبت في التظلمات المقدمة ضد القرارات الصادرة عن لجنة التخفيض بشأن التخفيض التلقائي للعقوبة.",
                  "تتألف هذه اللجنة علاوة على قاضي تطبيق العقوبات بصفته رئيساً، من ممثل النيابة العامة والمدير الجهوي لإدارة السجون أو من يمثله، وتتولى كتابة الضبط بالمحكمة مهام كتابة اللجنة.",
                  "تضم كذلك هذه اللجنة في عضويتها قاضي الأحداث إذا كان الأمر يتعلق بحدث.",
                  "تجتمع اللجنة بالمحكمة الابتدائية ويمكن أن تجتمع بمقر المؤسسة السجنية إذا قرر قاضي تطبيق العقوبات ذلك بناء على طلب ممثل النيابة العامة.",
                  "يمكن للجنة أن تستمع إلى السجين المتظلم الذي يمكنه كذلك الاستعانة بمحام.",
                  "يمكن للجنة كذلك أن تطلب تقريراً من المندوب الجهوي لإدارة السجون حول سلوك المعني بالأمر."
                ]
              },
              {
                "number": "5-632",
                "paragraphs": [
                  "يمكن للجنة المشار إليها في المادة 4-632 أعلاه، بناء على اقتراح من الإدارة المكلفة بالسجون، منح تخفيض إضافي للسجناء المؤهلين للاستفادة من التخفيض التلقائي للعقوبة والذين شاركوا في برامج الإدماج أو أبانوا عن مجهودات متميزة في متابعة دراستهم أو في التكوين المهني أو الخضوع للعلاج وذلك لمدة خمسة أيام عن كل شهر بالنسبة للعقوبات المحكوم بها التي لا تتجاوز سنة أو شهراً واحداً عن كل سنة أو جزء من السنة بالنسبة للعقوبات التي تفوق السنة.",
                  "لا يمكن أن يستفيد السجين من التخفيض التلقائي الإضافي أكثر من خمس مرات طيلة مدة العقوبة التي يقضيها بالمؤسسة السجنية.",
                  "لا تقبل مقررات اللجنة أي طعن."
                ]
              },
              {
                "number": "6-632",
                "paragraphs": [
                  "يمكن للجنة أن تأمر بسحب آخر تخفيض تلقائي للعقوبة استفاد منه السجين الذي أبدى سلوكا سيئا وذلك بناء على ملتمس كتابي يقدمه مدير المؤسسة السجنية أو وكيل الملك أو الوكيل العام للملك أو قاضي تطبيق العقوبات.",
                  "يتعين على اللجنة الاستماع للسجين الذي يمكنه الاستعانة بمحاميه قبل اتخاذ القرار المشار إليه في الفقرة الأولى أعلاه."
                ]
              },
              {
                "number": "7-632",
                "paragraphs": [
                  "تطبق مقتضيات هذا الباب على الأحداث ضمن نفس الشروط.",
                  "غير أن مدة التخفيض التلقائي للعقوبة تضاعف في هذه الحالة."
                ]
              }
            ]
          },
          {
            "name": "الباب الخامس",
            "title": "تنفيذ العقوبات المالية والإكراه البدني",
            "articles": [
              {
                "number": "633",
                "paragraphs": [
                  "تتولى المصالح المكلفة بالمالية ومصالح كتابات الضبط بمحاكم الاستئناف والمحاكم الابتدائية والمفوضون القضائيون وكل هيئة أخرى مؤهلة بموجب النصوص التشريعية والتنظيمية الجاري بها العمل استيفاء المصاريف القضائية والغرامات ما لم ينص على خلاف ذلك في قوانين خاصة.",
                  "يمكن كذلك اللجوء عند الحاجة إلى أعوان وضباط الشرطة القضائية للقيام باستيفاء المصاريف القضائية والغرامات بمناسبة تنفيذ أوامر الإكراه البدني.",
                  "يؤهل مأمورو كتابات الضبط في محاكم الاستئناف والمحاكم بالمملكة للقيام في آن واحد مع القباض بالمتابعات المنصوص عليها في القانون رقم 15.97 بمثابة مدونة تحصيل الديون العمومية الصادر بتنفيذه الظهير الشريف رقم 1.00.175 الصادر في 28 من محرم 1421 (3 ماي 2000) بتحصيل الغرامات والعقوبات المالية.",
                  "يعتبر مستخرج المقرر الصادر بالإدانة سندا يمكن بمقتضاه الحصول على الأداء من أموال المحكوم عليه بجميع الوسائل القانونية، ويكون هذا الأداء مستحقا بمجرد ما يصبح مقرر الإدانة مكتسبا لقوة الشيء المقضي به.",
                  "غير أنه إذا أفصح المحكوم عليه حضوريا بعقوبة غرامة فقط عن إرادته أداء ما عليه فورا، سلم إليه أمر بالدفع مؤشر عليه من قبل النيابة العامة، ويمكن لكاتب الضبط حين تقديم الأمر إليه أن يستوفي مبلغ الغرامة والمصاريف القضائية.",
                  "تعمل المصالح التابعة للمحاكم على إدراج هذه الغرامات والمصاريف القضائية في الأنظمة المعلوماتية ذات الصلة بالإدارات التي تقدم الخدمات العمومية المعنية من أجل تسهيل عملية التحصيل."
                ]
              },
              {
                "number": "634",
                "paragraphs": [
                  "إذا كانت أموال المحكوم عليه غير كافية لتحصيل المصاريف والغرامة ورد ما يلزم رده والتعويضات، فيخصص المبلغ المحصل وفقا لنظام الأسبقية الآتي:",
                  "-1 المصاريف القضائية؛",
                  "-2 رد ما يلزم رده؛",
                  "-3 التعويضات؛",
                  "-4 الغرامات.",
                  "إذا تقررت الإدانة من أجل جرائم مختلفة من حيث وصفها القانوني، فإن المبالغ المحكوم بها تستخلص على الترتيب الآتي: المبالغ المحكوم بها في الجنايات أولا ثم في الجنح ثم المخالفات."
                ]
              },
              {
                "number": "1-634",
                "paragraphs": [
                  "يجب على كل شخص حكم عليه بغرامة أن يقوم بتنفيذ الحكم الصادر في حقه وعند الاقتضاء مصاريف الدعوى، داخل أجل ثلاثين يوما من تاريخ تبليغه من قبل كتابة الضبط، أو الجهة المكلفة باستخلاص الغرامة.",
                  "وفي حالة قيامه بالأداء داخل الأجل المحدد له، يؤدي المحكوم عليه فقط ثلثي الغرامة المحكوم بها."
                ]
              },
              {
                "number": "635",
                "paragraphs": [
                  "يمكن تطبيق مسطرة الإكراه البدني في حالة عدم تنفيذ الأحكام الصادرة بالغرامة ورد ما يلزم رده والتعويضات والمصاريف، إذا تبين أن الإجراءات الرامية إلى الحصول على الأموال المنصوص عليها في المادة 634 أعلاه بقيت بدون جدوى أو أن نتائجها غير كافية.",
                  "يتم الإكراه البدني بإيداع المدين في السجن، وفي جميع الأحوال فإنه لا يسقط الالتزام الذي يمكن أن يكون محلا لإجراءات لاحقة بطرق التنفيذ العادية.",
                  "غير أنه لا يمكن تنفيذ الإكراه البدني، على المحكوم عليه الذي يدلي لإثبات عسره بشهادة عدم الخضوع للضريبة على المستوى الوطني تسلمها مصلحة الضرائب بموطن المحكوم عليه.",
                  "ويمكن للنيابة العامة، عند الاقتضاء، إجراء بحث للتأكد من ذمته المالية.",
                  "وإذا تعلق الأمر بأشخاص أجانب، فإنه يمكن إعفاؤهم من تطبيق الإكراه البدني بعد إدلائهم بشهادة عدم الخضوع للضريبة مسلمة من المصالح الإدارية أو القنصلية المختصة.",
                  "ويمكن للنيابة العامة المختصة، عند الاقتضاء، إجراء بحث للتأكد من ذمته المالية كما يمكنها الاستعانة بطلبات المساعدة القضائية على المستوى الدولي."
                ]
              },
              {
                "number": "636",
                "paragraphs": [
                  "يجب على كل محكمة زجرية عندما تصدر مقررا بالغرامة أو برد ما يلزم رده أو بالتعويضات أو المصاريف أن تحدد مدة الإكراه البدني.",
                  "في حالة الإغفال إما عن الحكم بالإكراه البدني أو عن تحديد مدته، يرجع إلى المحكمة لتبت في الموضوع بغرفة المشورة وينفذ مقررها رغم كل طعن.",
                  "غير أنه لا يمكن الحكم بالإكراه البدني أو تطبيقه:",
                  "-1 في الجرائم السياسية؛",
                  "-2 إذا صدر الحكم بعقوبة الإعدام أو بالسجن المؤبد؛",
                  "-3 إذا كان عمر المحكوم عليه يقل عن 20 سنة يوم ارتكابه للجريمة أو بلغ ستين سنة فما فوق؛",
                  "-4 إذا كان مجموع المبالغ المستحقة يقل عن 8000 درهم؛",
                  "-5 ضد مدين لفائدة زوجه أو أصوله أو فروعه أو إخوته أو أخواته أو عمه أو خاله أو عمته أو خالته أو ابن أخيه أو ابن أخته أو ابنة أخيه أو ابنة أخته أو من تربطه به مصاهرة من نفس الدرجة."
                ]
              },
              {
                "number": "637",
                "paragraphs": [
                  "لا ينفذ الإكراه البدني في آن واحد على الزوج وزوجته ولو من أجل ديون مختلفة، ولا ينفذ على امرأة حامل ولا على امرأة مرضع في حدود سنتين من تاريخ الولادة.",
                  "يوضع حد لتنفيذ الإكراه البدني بمجرد بلوغ المحكوم عليه 60 سنة."
                ]
              },
              {
                "number": "638",
                "paragraphs": [
                  "تحدد مدة الإكراه البدني من بين المدد المبينة بعده، ما لم تنص قوانين خاصة على خلاف ذلك:",
                  "- من خمسة عشر يوما (15) إلى واحد وعشرين يوما (21) إذا كان المبلغ يعادل أو يفوق ثمانية آلاف درهم (8.000) ويقل عن عشرين ألف درهم (20.000)؛",
                  "- من شهر واحد (1) إلى شهرين (2) إذا كان المبلغ يعادل أو يفوق عشرين ألف درهم (20.000) ويقل عن خمسين ألف درهم (50.000)؛",
                  "- من ثلاثة أشهر (3) إلى خمسة أشهر (5) إذا كان المبلغ يعادل أو يفوق خمسين ألف درهم (50.000) ويقل عن مائتي ألف درهم (200.000)؛",
                  "- من ستة أشهر (6) إلى تسعة أشهر (9) إذا كان المبلغ يعادل أو يفوق مائتي ألف درهم ويقل عن مليون درهم (1.000.000)؛",
                  "- من عشرة أشهر (10) إلى خمسة عشر شهرا (15) إذا كان المبلغ يعادل أو يفوق مليون درهم (1.000.000).",
                  "إذا كان الإكراه البدني يرمي إلى تسديد عدة ديون، فتحسب مدته حسب مجموع المبالغ المحكوم بها."
                ]
              },
              {
                "number": "639",
                "paragraphs": [
                  "يقدم طلب تطبيق الإكراه البدني لوكيل الملك لدى المحكمة الابتدائية التي باشرت إجراءات التحصيل أو التي تم انتدابها لذلك، ويرفق بنسخة من المقرر القابل للتنفيذ بالإضافة إلى الوثائق المشار إليها في المادة 640 بعده."
                ]
              },
              {
                "number": "640",
                "paragraphs": [
                  "لا يمكن تطبيق الإكراه البدني، في جميع الأحوال ولو نص عليه مقرر قضائي، إلا بعد موافقة قاضي تطبيق العقوبات الذي يتحقق داخل أجل لا يتعدى ثلاثين يوما من توفر الشروط الآتية بعد توصله بالملف من وكيل الملك:",
                  "1 - تقديم طلب كتابي من المطالب بالإكراه البدني يرمي إلى الإيداع في السجن؛",
                  "2 - الإدلاء بما يثبت عدم إمكانية التنفيذ على أموال المدين.",
                  "لا يأمر وكيل الملك أعوان القوة العمومية بإلقاء القبض على الشخص المطلوب تطبيق الإكراه البدني في حقه، إلا بعد صدور قرار بالموافقة على ذلك عن قاضي تطبيق العقوبات، مع مراعاة مقتضيات المادة 641 بعده.",
                  "يقبل مقرر قاضي تطبيق العقوبات بشأن تنفيذ الإكراه البدني المنازعة وفقا لمقتضيات المادة 596 من هذا القانون من طرف النيابة العامة أو المحكوم عليه أو طالب الإكراه البدني داخل أجل عشرة أيام تبتدئ من تاريخ الإشعار أو العلم بصدور المقرر القضائي، وتبت المحكمة فيه ولو في غيبة الأطراف بموجب مقرر غير قابل لأي طعن."
                ]
              },
              {
                "number": "641",
                "paragraphs": [
                  "خلافا للمقتضيات السابقة، إذا كان المحكوم عليه ما يزال معتقلا وأصبح الحكم الصادر في حقه مكتسبا لقوة الشيء المقضي به، فإن رئيس المؤسسة السجنية بمجرد توصله بالطلب من قبل طالب الإكراه البدني يوجه فورا إلى المحكوم عليه إنذارا كتابيا لأداء دينه، ويجب أن يشمل هذا الإنذار إضافة إلى التذكير بموجز مقرر الإدانة مبلغ العقوبة المالية ومبلغ المصاريف وكذا مدة الإكراه المأمور به.",
                  "إذا أدى المحكوم عليه دينه يسلم إليه وصل مستخرج من سجل ذي أرومة تودعه في كل مؤسسة سجنية لهذا الغرض كتابة الضبط بالمحكمة الابتدائية التي توجد المؤسسة السجنية داخل دائرة نفوذها، ويستعمل هذا الوصل لإثبات الأداء الذي يوجه كذلك إشعار به على الفور إلى كتابة الضبط بالمحكمة التي قضت بالإدانة وكذا إلى إدارة المالية.",
                  "إذا صرح المحكوم عليه بعدم قدرته على الوفاء بدينه يشار إلى ذلك في محضر يحرره رئيس المؤسسة السجنية ويوجهه على الفور إلى النيابة العامة لدى المحكمة الابتدائية التي تقع داخل دائرة نفوذها المؤسسة السجنية المذكورة.",
                  "بعد الاطلاع على المحضر المذكور، يوقع وكيل الملك على أمر بإبقاء المحكوم عليه في السجن.",
                  "ويخضع المحكوم عليه للإكراه البدني بعد قضاء العقوبة المحكوم بها عليه، مع مراعاة مقتضيات الفقرة الأخيرة من المادة 635 أعلاه."
                ]
              },
              {
                "number": "642",
                "paragraphs": [
                  "إذا لم يتم تبليغ مقرر الإدانة مسبقا للمدين، فإنه يتعين تبليغه قبل توجيه الإنذار.",
                  "ولا يعتد بالإنذار غير المسبوق بتبليغ مقرر الإدانة.",
                  "وفي حالة تعذر تبليغ مقرر الإدانة أو توجيه الإنذار تطبق مقتضيات المادة 43 من القانون رقم 15.97 بمثابة مدونة تحصيل الديون العمومية الصادر بتنفيذه الظهير الشريف رقم 1.00.175 بتاريخ 28 من محرم 1421 (3 ماي 2000).",
                  "تنشر بمنصة إلكترونية معدة لتطبيق الإكراه البدني البيانات اللازمة لمباشرة عملية التحصيل وتحديد البيانات المطلوبة بنص تنظيمي."
                ]
              },
              {
                "number": "643",
                "paragraphs": [
                  "إذا وقع نزاع، أحضر المحكوم عليه بالإكراه البدني المقبوض عليه أو الموجود في حالة اعتقال إلى المحكمة الابتدائية الكائن مقرها بمحل القبض أو الاعتقال ويقدم إلى رئيس المحكمة للبت في النزاع.",
                  "إذا كان النزاع يتعلق بصحة إجراءات الإكراه البدني، بت الرئيس في الخلاف بشكل استعجالي، وينفذ أمره رغم الطعن بالاستئناف.",
                  "في حالة نزاع عارض يستلزم تفسيرا، تطبق مقتضيات المادتين 599 و 600 أعلاه."
                ]
              },
              {
                "number": "644",
                "paragraphs": [
                  "يحدد قاضي تطبيق العقوبات مدة الإكراه البدني المتعلقة بالمدين المطلوب تطبيق الإكراه في حقه في حالة الحكم بتضامن المدينين، وتراعى في ذلك حصة المدين المعني بالأمر من الدين."
                ]
              },
              {
                "number": "645",
                "paragraphs": [
                  "يمكن للمحكوم عليهم بالإكراه البدني أن يتجنبوا مفعوله أو أن يوقفوا سريانه، إما بأداء مبلغ من المال كاف لانقضاء الدين من أصل وفوائد وصوائر وإما برضى الدائن الذي سعى إلى اعتقالهم أو بأداء قسط من الدين مع الالتزام بأداء الباقي في تاريخ محدد.",
                  "يفرج وكيل الملك عن المدين المعتقل بناء على ثبوت انقضاء الدين أو بطلب من الدائن."
                ]
              },
              {
                "number": "646",
                "paragraphs": [
                  "إذا لم ينفذ المدين الالتزامات التي أدت إلى إيقاف الإكراه البدني، أمكن إكراهه من جديد فيما يخص المبالغ الباقية بذمته."
                ]
              },
              {
                "number": "647",
                "paragraphs": [
                  "إذا انتهى الإكراه البدني لسبب ما، باستثناء الحالة المنصوص عليها في المادة السابقة، لا يمكن بعدئذ تنفيذه لا من أجل نفس الدين ولا من أجل أحكام أخرى صدرت قبل تنفيذه، ما لم تكن هذه الأحكام تستلزم بسبب مجموع مبالغها مدة إكراه أطول من المدة التي تم تنفيذها على المحكوم عليه.",
                  "وفي هذه الحالة، يتعين دائما إسقاط مدة الاعتقال الأول من الإكراه الجديد."
                ]
              },
              {
                "number": "2-647",
                "paragraphs": [
                  "تقوم النيابة العامة بإحالة المقرر المتضمن للعقوبة البديلة بعد اكتسابه قوة الشيء المقضي به إلى قاضي تطبيق العقوبات الذي يصدر مقررا تنفيذيا بذلك، ويحيله على الإدارة المكلفة بالسجون التي تقع داخل نفوذ المحكمة التي أصدرت الحكم.",
                  "غير أنه يمكن تنفيذ المقرر المشار إليه في الفقرة السابقة قبل اكتسابه قوة الشيء المقضي به، إذا وافقت النيابة العامة على ذلك ولم تمارس حق الطعن.",
                  "وإذا وجد المحكوم عليه خارج دائرة نفوذ قاضي تطبيق العقوبات، فإنه يمكن له أن ينيب عنه قاضي تطبيق العقوبات الموجود بدائرة نفوذه المحكوم عليه لإصدار المقرر التنفيذي بذلك.",
                  "ويشعر النيابة العامة بكل امتناع أو إخلال في تنفيذها.",
                  "إذا صدر القرار القاضي بالعقوبة البديلة عن محكمة الاستئناف، فإن الاختصاص ينعقد لقاضي تطبيق العقوبات بالمحكمة الابتدائية التي بتت في القضية ابتدائيا."
                ]
              },
              {
                "number": "3-647",
                "paragraphs": [
                  "يختص قاضي تطبيق العقوبات بالفصل في جميع المنازعات المتعلقة بتنفيذ العقوبات البديلة أو وضع حد لتنفيذها وإصدار جميع القرارات والأوامر المتعلقة بها، بعد التوصل بمستنتجات النيابة العامة، وله على الخصوص ما يلي:",
                  "-1 الأمر بتنفيذ العقوبة الأصلية أو ما تبقى منها في حالة الامتناع عن تنفيذ العقوبات البديلة أو الإخلال بها خلال مدة تنفيذها؛",
                  "-2 الأمر بتمديد المدة التي يتعين خلالها تنفيذ العقوبة البديلة في الحالات المنصوص عليها قانونا؛",
                  "-3 النظر في التقارير المتعلقة بتنفيذ العقوبات البديلة التي تعرض عليه واتخاذ ما يراه مناسبا بشأنها؛",
                  "-4 إصدار مقرر يقضي بتمام تنفيذ العقوبة البديلة المحكوم بها بناء على تقرير الإدارة المكلفة بالسجون، تسلم نسخة منه للمعني بالأمر، وتحال نسخة أيضا على النيابة العامة ومركز السجل العدلي المختص.",
                  "تقبل قرارات وأوامر قاضي تطبيق العقوبات المنازعة داخل أجل ثلاثة أيام من تاريخ الإشعار بصدورها وفقا لمقتضيات المادتين 599 و 600 من هذا القانون، ويحال الملف فورا على المحكمة التي تبت وجوبا داخل أجل خمسة عشر يوما من تاريخ إحالة الملف عليها.",
                  "ويترتب عن كل منازعة إيقاف تنفيذ القرار أو الأمر الصادر عن قاضي تطبيق العقوبات."
                ]
              },
              {
                "number": "4-647",
                "paragraphs": [
                  "يستفيد المحكوم عليه الذي ينفذ العقوبة البديلة من رد الاعتبار القضائي بعد مرور أجل سنة من تاريخ انقضاء العقوبة البديلة.",
                  "ويرد الاعتبار بقوة القانون لكل محكوم عليه بعقوبة بديلة، وذلك بعد انتهاء فترة اختبار مدتها سنة ونصف تحتسب من تاريخ تنفيذ العقوبة البديلة."
                ]
              }
            ]
          },
          {
            "name": "الباب الخامس مكرر",
            "title": "تنفيذ العقوبات البديلة",
            "articles": [
              {
                "number": "5-647",
                "paragraphs": [
                  "تحيل النيابة العامة داخل أجل لا يتجاوز خمسة أيام من صدور حكم المحكمة القاضي بتحديد العقوبة البديلة ملف المحكوم عليه إلى قاضي تطبيق العقوبات، لإصدار مقرر يقضي بتنفيذ عقوبة العمل لأجل المنفعة العامة.",
                  "إذا كان المحكوم عليه معتقلا، يبقى رهن الاعتقال إلى غاية إصدار قاضي تطبيق العقوبات مقرر تنفيذ عقوبة العمل لأجل المنفعة العامة الذي يجب أن يصدر داخل أجل لا يتجاوز عشرة أيام من تاريخ إحالة الملف إليه، ويجب أن يتضمن الإشارة إلى:",
                  "الهوية الكاملة للمحكوم عليه؛",
                  "طبيعة العمل المسند إليه والمؤسسة التي سيؤديه فيها؛",
                  "عدد الساعات الإجمالية وتوزيعها وفق برنامج زمني يتم الاتفاق عليه مع المؤسسة المعنية.",
                  "يبلغ فورا مقرر قاضي تطبيق العقوبات الخاص بتنفيذ عقوبة العمل لأجل المنفعة العامة إلى المحكوم عليه ونائبه الشرعي إذا كان حدثا والنيابة العامة والمؤسسة التي يوجد بها رهن الاعتقال أو الإيداع، وترسل أيضا نسخة من نفس المقرر للمؤسسة التي سيؤدي بها العمل لأجل المنفعة العامة.",
                  "يتم الإفراج عن المحكوم عليه المعتقل بمجرد توصل المؤسسة السجنية بمقرر قاضي تطبيق العقوبات المحدد للعقوبة البديلة.",
                  "تخصم مدة الاعتقال التي قضاها المحكوم عليه بحساب ثلاث ساعات عمل عن كل يوم حبس، ثم تستبدل المدة المتبقية من عقوبة الحبس الأصلية ليؤديها عملا لأجل المنفعة العامة دون أن تقل عن 40 ساعة."
                ]
              },
              {
                "number": "6-647",
                "paragraphs": [
                  "يأمر قاضي تطبيق العقوبات فور توصله بالملف بإحضار المحكوم عليه والاستماع إليه حول هويته ووضعيته الاجتماعية والمهنية والعائلية.",
                  "يمكن لقاضي تطبيق العقوبات الاستعانة بالنيابة العامة للتأكد من صحة المعلومات التي يدلي بها المحكوم عليه، كما يمكنه أن يكلف بذلك مكتب المساعدة الاجتماعية.",
                  "يمكن لقاضي تطبيق العقوبات أن يأمر بعرض المحكوم عليه على خبرة طبية لفحصه وتقديم تقرير عن حالته الصحية من أجل اختيار طبيعة العمل الذي يناسب حالته البدنية إذا اقتضى الأمر ذلك، ثم يعهد إلى المحكوم عليه باختيار عمل معين من بين الأعمال المعروضة التي تلائم قدراته ومهاراته، والتي من شأنها أن تحافظ على اندماجه دون التأثير سلبا على المسار العادي لحياته العائلية أو المهنية أو الدراسية.",
                  "يراعى عند تطبيق مقتضيات العمل لأجل المنفعة العامة بالنسبة للنساء والأحداث والأشخاص في وضعية إعاقة والمسنين، المقتضيات التشريعية والتنظيمية المتعلقة بتشغيل هذه الفئات، ويراعى ضمان اندماجهم في محيطهم الأسري وأداء مهام الأمومة وعدم التأثير على السير العادي للدراسة بالنسبة للأشخاص الذين ما زالوا يتابعون دراستهم."
                ]
              },
              {
                "number": "7-647",
                "paragraphs": [
                  "في حالة عدم تنفيذ أو إخلال المحكوم عليه بالالتزامات المحددة له في المقرر التنفيذي لأداء عقوبة العمل لأجل المنفعة العامة، يمكن لقاضي تطبيق العقوبات إصدار مقرر لوضع حد لهذه العقوبة، وتطبق حينها في حق المحكوم عليه العقوبة الحبسية الأصلية بعد خصم عدد ساعات العمل المنفذة والتي يتم احتسابها على أساس يوم واحد لكل ثلاث ساعات عمل غير مؤداة."
                ]
              },
              {
                "number": "8-647",
                "paragraphs": [
                  "تمسك المؤسسات التي يؤدي بها المحكوم عليه عقوبة العمل لأجل المنفعة العامة سجلا خاصا يوقع عليه قاضي تطبيق العقوبات ويؤشر على جميع صفحاته، يتضمن هوية المحكوم عليه وساعات العمل التي أداها مشفوعة بتوقيعه الشخصي أو إبصامه عند الاقتضاء.",
                  "يوضع هذا السجل رهن إشارة قاضي تطبيق العقوبات قصد الاطلاع عليه كلما طلب ذلك، كما يمكن الاطلاع عليه من قبل وكيل الملك أو من ينوب عنه ومن قبل الإدارة المكلفة بالسجون.",
                  "يتعين على المؤسسات المذكورة أن توجه إلى قاضي تطبيق العقوبات تقريرا عن كل محكوم عليه يؤدي عقوبة العمل لأجل المنفعة العامة لديها بمجرد انتهاء مدة عقوبته، أو إذا انقطع عن القيام بالعمل المعهود به إليه أو رفض القيام به أو حال مانع دون ذلك.",
                  "توجه نسخة من التقرير إلى وكيل الملك والإدارة المكلفة بالسجون.",
                  "تقوم الإدارة المكلفة بالسجون بزيارات تفقدية للمحكوم عليهم، ويتم إشعار قاضي تطبيق العقوبات والنيابة العامة بكل إخلال في تنفيذ العقوبة.",
                  "يمكن لقاضي تطبيق العقوبات أن يقوم بزيارة تفقدية للمحكوم عليهم الذين يقضون عقوبات العمل لأجل المنفعة العامة، تلقائيا أو بناء على ملتمس من النيابة العامة، ينجز على إثرها تقريرا يحيل نسخة منه إلى هذه الأخيرة.",
                  "كما يمكن له تكليف موظفين من كتابة الضبط أو أحد المساعدات أو المساعدين الاجتماعيين بمكتب المساعدة الاجتماعية بالدائرة القضائية لمكان تنفيذ العقوبة، للقيام بالزيارة وإعداد تقرير بشأنها.",
                  "كما يمكن لوكيل الملك أن يقوم بزيارة تفقدية لأماكن تنفيذ عقوبات العمل لأجل المنفعة العامة، ينجز على إثرها تقريرا يحيل نسخة منه على قاضي تطبيق العقوبات.",
                  "يمكن لقاضي تطبيق العقوبات أو وكيل الملك أن يطلب من المؤسسات التي تؤدى فيها عقوبة العمل لأجل المنفعة العامة إعداد تقارير خاصة أو دورية حول تنفيذ العمل لأجل المنفعة العامة بالنسبة لبعض المؤسسات أو بعض المحكوم عليهم."
                ]
              },
              {
                "number": "9-647",
                "paragraphs": [
                  "يمكن لقاضي تطبيق العقوبات، تلقائيا أو بناء على طلب من المحكوم عليه، أو دفاعه أو من له مصلحة في ذلك، أن يصدر مقررا بوقف تنفيذ العقوبة إلى حين زوال السبب المبرر المتعلق بالظروف الاجتماعية أو الصحية أو العائلية أو الدراسية أو المهنية للمحكوم عليه أو بظروف المؤسسة التي يقضي بها العقوبة.",
                  "يبلغ هذا المقرر إلى النيابة العامة والمحكوم عليه والمؤسسة التي يقضي بها المحكوم عليه العقوبة البديلة والإدارة المكلفة بالسجون.",
                  "يمكن للمحكوم عليه أو النيابة العامة المنازعة في المقرر المذكور داخل أجل خمسة أيام من تاريخ تبليغه ويتم البت فيه طبقا لمقتضيات الفقرة الثانية من المادة 3-647 أعلاه.",
                  "خلافا لمقتضيات الفقرة الأخيرة من المادة 3-647 أعلاه، لا توقف المنازعة تنفيذ المقرر المذكور أعلاه."
                ]
              }
            ],
            "sections": [
              {
                "name": "الفرع الثاني",
                "title": "تدابير تنفيذ المراقبة الإلكترونية",
                "articles": [
                  {
                    "number": "10-647",
                    "paragraphs": [
                      "تتولى الإدارة المكلفة بالسجون تتبع تنفيذ تدبير المراقبة الإلكترونية المحددة في الحكم القاضي بالإدانة، وفق الكيفية المشار إليها في المواد من 11-647 إلى 14-647 أدناه.",
                      "ويمكن لقاضي تطبيق العقوبات أو لوكيل الملك أن يتخذ التدابير اللازمة للتحقق من تنفيذ التدبير أعلاه بما فيها طلب تقارير من الإدارة المكلفة بالسجون."
                    ]
                  },
                  {
                    "number": "11-647",
                    "paragraphs": [
                      "تتم المراقبة الإلكترونية بواسطة قيد إلكتروني يوضع بمعصم المحكوم عليه أو ساقه أو على جزء آخر من جسده، بشكل يسمح برصد تحركاته داخل الحدود الترابية المحددة له.",
                      "يمكن وضع الحدث تحت هذا التدبير بحضور وليه أو المقدم عليه أو وصيه أو كافله أو حاضنه أو الشخص المعهود إليه برعايته."
                    ]
                  },
                  {
                    "number": "12-647",
                    "paragraphs": [
                      "تلتزم الجهات المشار إليها في المادة 1-647 برصد وتتبع حركات وتنقلات الشخص الخاضع للمراقبة الإلكترونية.",
                      "يعاقب كل شخص خاضع للمراقبة الإلكترونية أخل عمدا بالالتزامات المفروضة عليه أو فر أو تخلص، بأي وسيلة كانت، من الأجهزة أو الأدوات المستعملة في المراقبة أو قام بإتلافها أو بتعييبها بالحبس من شهر إلى ثلاثة أشهر وغرامة من 2000 درهم إلى 5000 درهم أو بإحدى هاتين العقوبتين فقط.",
                      "تنفذ العقوبات المحكوم بها طبقا لمقتضيات الفقرة أعلاه ضد الشخص المخل بالالتزامات المفروضة عليه استثناء من مقتضيات الفصل 120 من مجموعة القانون الجنائي، بالإضافة إلى العقوبة الأصلية الصادرة في حقه أو ما تبقى منها.",
                      "إذا تقرر في هذه الحالة تطبيق العقوبة الأصلية أو ما تبقى منها من طرف قاضي تطبيق العقوبات، تنفذ العقوبة رغم المنازعة."
                    ]
                  },
                  {
                    "number": "13-647",
                    "paragraphs": [
                      "تحدد بنص تنظيمي كيفيات تدبير القيد الإلكتروني والمصاريف التي يمكن فرضها على المحكوم عليه بهذا الخصوص.",
                      "تحدث مكاتب لدى المؤسسات السجنية بالنسبة للمحكوم عليهم الموجودين في حالة اعتقال وبالمحاكم بالنسبة للمحكوم عليهم في حالة سراح، تتولى الإشراف على عملية وضع وإزالة القيد الإلكتروني عن المحكوم عليهم.",
                      "ينجز تقرير بعملية وضع القيد الإلكتروني على جسد المحكوم عليه، يوجه إلى قاضي تطبيق العقوبات الذي يضمه إلى ملف المعني بالأمر.",
                      "تحرر الإدارة المكلفة بالسجون المختصة بتدبير وتتبع عملية المراقبة الإلكترونية تقارير ترفعها إلى قاضي تطبيق العقوبات كلما دعت الضرورة إلى ذلك أو إذا طلبها القاضي المذكور، وتوجه نسخة منها إلى النيابة العامة."
                    ]
                  },
                  {
                    "number": "14-647",
                    "paragraphs": [
                      "يمكن لقاضي تطبيق العقوبات أن يخضع المعني بالأمر، بناء على طلبه أو من له مصلحة في ذلك، لفحص طبي للتحقق من تأثير القيد الإلكتروني على صحته. وفي حالة ما إذا كان هناك أي تأثير، يمكن لقاضي تطبيق العقوبات عرض الأمر على المحكمة المصدرة للعقوبة البديلة قصد تغييرها بعقوبة بديلة أخرى بعد أخذ مستنتجات النيابة العامة.",
                      "يمكن اعتبارا للظروف الصحية للمحكوم عليه، في حالة تدخل طبي استعجالي، إزالة القيد، على أن يرفع الطبيب المعالج تقريرا في الموضوع إلى قاضي تطبيق العقوبات في أجل أربعة وعشرين ساعة يوضح أسباب ذلك.",
                      "يصدر قاضي تطبيق العقوبات مقررا يوقف تنفيذ العقوبة إلى حين زوال المانع الصحي، أو بتغيير مكان وضع القيد، يبلغ إلى النيابة العامة والمحكوم عليه والمؤسسة السجنية، وتطبق بشأن المنازعة فيه مقتضيات الفقرتين الثالثة والرابعة من المادة 9-647."
                    ]
                  }
                ]
              },
              {
                "name": "الفرع الثالث",
                "title": "تدابير تنفيذ عقوبة تقييد بعض الحقوق أو فرض تدابير رقابية أو علاجية أو تأهيلية",
                "articles": [
                  {
                    "number": "15-647",
                    "paragraphs": [
                      "يأمر قاضي تطبيق العقوبات بإطلاق سراح المحكوم عليه بعقوبة تقييد الحقوق أو فرض تدابير رقابية أو علاجية أو تأهيلية بمجرد صيرورة الحكم الصادر في حقه مكتسبا لقوة الشيء المقضي به، ما لم يكن معتقلا من أجل سبب آخر.",
                      "غير أنه يمكن إصدار المقرر المشار إليه في الفقرة السابقة قبل اكتساب الحكم قوة الشيء المقضي به، إذا وافقت النيابة العامة على ذلك ولم تمارس حق الطعن.",
                      "يلتزم المحكوم عليه بالمثول أمام قاضي تطبيق العقوبات داخل أجل أقصاه أسبوع، من تاريخ تبليغه المقرر النهائي الصادر في حقه أو من تاريخ الإفراج عنه."
                    ]
                  },
                  {
                    "number": "16-647",
                    "paragraphs": [
                      "تتولى الإدارة المكلفة بالسجون تتبع تنفيذ التدابير الرقابية أو العلاجية أو التأهيلية المحددة في الحكم القاضي بالعقوبة البديلة.",
                      "يمكن لقاضي تطبيق العقوبات أو وكيل الملك أن يتخذ التدابير اللازمة للتحقق من تنفيذ التدابير أعلاه.",
                      "ويمكن لقاضي تطبيق العقوبات، عند الاقتضاء، تكليف موظفي كتابة الضبط بالمحكمة أو المكلفين بمكتب المساعدة الاجتماعية بالدائرة القضائية للقيام بالتدابير اللازمة للتحقق من تنفيذ التدابير الرقابية أو العلاجية أو التأهيلية وإعداد تقارير بشأنها، توجه نسخة منها إلى قاضي تطبيق العقوبات ووكيل الملك."
                    ]
                  },
                  {
                    "number": "17-647",
                    "paragraphs": [
                      "يلتزم المحكوم عليه بالإدلاء للإدارة المكلفة بالسجون بما يفيد تنفيذه أو استمراره في تنفيذ التدابير الرقابية أو العلاجية أو التأهيلية المحكوم بها عليه، وذلك وفق الجدولة الزمنية المحددة له، وتحال نسخة منها إلى قاضي تطبيق العقوبات المختص.",
                      "في حالة رصد إخلال المحكوم عليه بتنفيذ عقوبة تقييد بعض الحقوق أو فرض تدابير رقابية أو علاجية أو تأهيلية أو بالالتزامات المحددة له من قبل قاضي تطبيق العقوبات، يصدر هذا القاضي أمرا بتطبيق المحكوم عليه للعقوبة الحبسية الأصلية الصادرة في حقه وفقا لمقتضيات المادة 3-647 أعلاه."
                    ]
                  }
                ]
              },
              {
                "name": "الفرع الرابع",
                "title": "تدابير تنفيذ الغرامة اليومية",
                "articles": [
                  {
                    "number": "18-647",
                    "paragraphs": [
                      "يؤدى مجموع الغرامة اليومية دفعة واحدة، غير أنه يمكن لقاضي تطبيق العقوبات أن يأذن بتقسيط أدائها داخل الآجال المحددة في الفصل 15-35 من مجموعة القانون الجنائي إذا تعلق الأمر بمحكوم عليه غير معتقل، شريطة أداء قسط أولي يعادل على الأقل نصف المبالغ الواجبة الأداء."
                    ]
                  },
                  {
                    "number": "19-647",
                    "paragraphs": [
                      "يأمر قاضي تطبيق العقوبات بإطلاق سراح المحكوم عليه بعقوبة الغرامة اليومية، إذا كان معتقلا، بمجرد صيرورة الحكم الصادر في حقه مكتسبا لقوة الشيء المقضي به وأدائه مجموع قيمة الغرامة اليومية المحكوم بها عليه.",
                      "غير أنه يمكن إصدار المقرر المشار إليه في الفقرة السابقة قبل اكتساب الحكم لقوة الشيء المقضي به إذا وافقت النيابة العامة على ذلك ولم تمارس حق الطعن.",
                      "لا تحسب مدة الاعتقال التي قضاها المحكوم عليه عند تحديد مبلغ الغرامة اليومية الواجب أداؤها."
                    ]
                  },
                  {
                    "number": "20-647",
                    "paragraphs": [
                      "يلتزم المحكوم عليه بالإدلاء بما يفيد أداء الغرامة اليومية أو تنفيذه أو استمراره في التنفيذ، وذلك وفق الجدولة الزمنية التي يحددها له قاضي تطبيق العقوبات.",
                      "في حالة إخلال المحكوم عليه بتنفيذ الغرامة اليومية يصدر قاضي تطبيق العقوبات مقررا بتطبيق المحكوم عليه للعقوبة الحبسية الأصلية الصادرة في حقه، والتي تخصم منها عدد الأيام التي أديت غرامتها."
                    ]
                  },
                  {
                    "number": "21-647",
                    "paragraphs": [
                      "تتولى الإدارة المكلفة بالسجون التنسيق مع القطاعات الحكومية والمؤسسات والهيئات، لاسيما التي يمكن إشراك المصالح التابعة لها في تنفيذ العقوبات البديلة.",
                      "تقوم الإدارة المكلفة بالسجون بإعداد تقارير دورية حول سير وحصيلة تنفيذ العقوبات البديلة والإكراهات التي تعترضها والحلول المقترحة لها، وتوجه هذه التقارير إلى السلطات القضائية المعنية."
                    ]
                  },
                  {
                    "number": "22-647",
                    "paragraphs": [
                      "يمكن لقاضي تطبيق العقوبات بالمحكمة مصدرة الحكم الابتدائي، وفق الشروط والضوابط المنصوص عليها في هذا القانون، إما تلقائيا بعد التوصل بمستنتجات النيابة العامة أو بطلب منها أو طلب المحكوم عليه، أو دفاعه، أو الممثل الشرعي للحدث، أو مدير المؤسسة السجنية، أو من يعنيه الأمر، استبدال العقوبة الحبسية أو ما تبقى منها بعقوبة بديلة أو أكثر لفائدة المحكوم عليهم بمقررات قضائية مكتسبة لقوة الشيء المقضي به.",
                      "تقبل في هذه الحالة قرارات قاضي تطبيق العقوبات المنازعة من النيابة العامة أو المحكوم عليه أو دفاعه أو الممثل الشرعي للحدث خلال اليوم الموالي ليوم التبليغ بصدورها وفقا لمقتضيات المادتين 599 و600 من القانون المتعلق بالمسطرة الجنائية، ويحال الملف فورا على المحكمة التي تبت وجوبا داخل أجل خمسة عشر يوما من تاريخ إدراج الملف بالجلسة.",
                      "يترتب على كل منازعة إيقاف تنفيذ القرار الصادر عن قاضي تطبيق العقوبات."
                    ]
                  }
                ]
              }
            ]
          },
          {
            "name": "الباب السادس",
            "title": "تقادم العقوبات",
            "articles": [
              {
                "number": "648",
                "paragraphs": [
                  "يترتب عن تقادم العقوبة تخلص المحكوم عليه من آثار الإدانة إذا لم تكن العقوبة قد نفذت خلال الآجال المحددة في المادة 649 وما بعدها إلى المادة 651 بعده.",
                  "غير أنه، مع ذلك، فإن حالات انعدام الأهلية المحكوم بها في مقرر الإدانة أو التي تكون نتيجة قانونية لهذا المقرر تبقى سارية المفعول.",
                  "ينقطع التقادم فيما يخص استيفاء المصاريف القضائية والغرامات بكل إجراء من إجراءات التحصيل يتم بمسعى من الجهات المأذون لها بتحصيل تلك الأموال."
                ]
              },
              {
                "number": "649",
                "paragraphs": [
                  "تتقادم العقوبات الجنائية بمضي خمس عشرة سنة ميلادية كاملة، تحسب ابتداء من التاريخ الذي يصبح فيه الحكم الصادر بالعقوبة مكتسبا لقوة الشيء المقضي به.",
                  "إذا تقادمت عقوبة المحكوم عليه، فإنه يخضع بقوة القانون طيلة حياته للمنع من الإقامة في دائرة العمالة أو الإقليم التي يستقر بها الضحية الذي ارتكبت الجريمة على شخصه أو على أمواله أو يستقر بها ورثته المباشرون.",
                  "تطبق على المنع من الإقامة في هذه الحالة مقتضيات القانون الجنائي."
                ]
              },
              {
                "number": "650",
                "paragraphs": [
                  "تتقادم العقوبات الجنحية بمضي أربع سنوات ميلادية كاملة، ابتداء من التاريخ الذي يصبح فيه الحكم الصادر بالعقوبة مكتسبا لقوة الشيء المقضي به.",
                  "غير أنه إذا كانت عقوبة الحبس المحكوم بها تتجاوز خمس سنوات، فإن مدة التقادم تكون مساوية لمدة العقوبة."
                ]
              },
              {
                "number": "651",
                "paragraphs": [
                  "تتقادم العقوبات عن المخالفات بمضي سنة ميلادية كاملة، تحسب ابتداء من التاريخ الذي يصبح فيه الحكم الصادر بالعقوبة مكتسبا لقوة الشيء المقضي به."
                ]
              },
              {
                "number": "652",
                "paragraphs": [
                  "لا يمكن بأي حال من الأحوال أن يقبل من شخص تقدمه لتنفيذ ما حكم به عليه في غيبته، أو بناء على المسطرة الغيابية، إذا تقادمت العقوبة المحكوم بها عليه."
                ]
              },
              {
                "number": "653",
                "paragraphs": [
                  "تتقادم المقتضيات المدنية الواردة في منطوق مقرر زجري مكتسب لقوة الشيء المقضي به حسب قواعد تقادم الأحكام المدنية."
                ]
              },
              {
                "number": "1-653",
                "paragraphs": [
                  "لا تتقادم العقوبات الصادرة بشأن جرائم ينص على عدم تقادمها القانون أو اتفاقية دولية صادقت عليها المملكة المغربية ونشرت بالجريدة الرسمية."
                ]
              }
            ]
          }
        ]
      },
      {
        "name": "القسم الثاني",
        "title": "السجل العدلي",
        "chapters": [
          {
            "name": "الباب الأول",
            "title": "أحكام عامة",
            "articles": [
              {
                "number": "654",
                "paragraphs": [
                  "يشمل السجل العدلي مركزا وطنيا تابعا لوزارة العدل ومراكز محلية بالمحاكم الابتدائية يتم تعيينها بقرار لوزير العدل.",
                  "يختص مركز السجل العدلي الوطني بالإشراف على موظفي المراكز المحلية للسجل العدلي، ويتولى مسك سجل عدلي خاص بالأشخاص المولودين خارج المملكة من غير اعتبار لجنسيتهم، ومسك بطائق السجل العدلي للأشخاص الاعتبارية المنصوص عليها في المواد 678 وما بعدها من هذا القانون.",
                  "يتولى مركز السجل العدلي المحلي مسك السجلات العدلية لجميع الأشخاص مهما كانت جنسيتهم المولودين بدائرة المحكمة المحددة طبقا للفقرة الأولى من هذه المادة."
                ]
              },
              {
                "number": "1-654",
                "paragraphs": [
                  "من أجل ضرورة المعالجة المعلوماتية لنظام السجل العدلي، يتولى المركز الوطني للسجل العدلي تدبير قاعدة بيانات مركزية تجمع فيها بطائق السجل العدلي أو التدبير المعلوماتي لرد الاعتبار بقوة القانون للأشخاص الذاتيين المغاربة والأجانب والأشخاص الاعتباريين.",
                  "تحدد بنص تنظيمي كيفيات تنظيم قاعدة البيانات.",
                  "تعالج بطائق السجل العدلي إلكترونيا بالمحاكم المتواجد بها مراكز السجل العدلي المحلي.",
                  "يمكن أن تذيل بطائق السجل العدلي بالتوقيع الإلكتروني أو الرقمي."
                ]
              },
              {
                "number": "655",
                "paragraphs": [
                  "يتولى إدارة مركز السجل العدلي الوطني أحد القضاة العاملين بوزارة العدل.",
                  "تسند إدارة السجل العدلي المحلي لأحد قضاة النيابة العامة."
                ]
              },
              {
                "number": "656",
                "paragraphs": [
                  "تمسك مراكز السجل العدلي المحلي بطائق تسمى البطائق رقم 1 للسجل العدلي، وتسلم حسب الشروط المحددة في المواد 665 وما يليها، بيانات أو ملخصات منها تدعى البطائق رقم 2 أو رقم 3.",
                  "يمسك مركز السجل العدلي الوطني نفس البطائق ويسلم نفس البيانات بالنسبة للأشخاص المولودين خارج المملكة وللأشخاص الاعتبارية."
                ]
              }
            ]
          },
          {
            "name": "الباب الثاني",
            "title": "البطائق رقم 1 ونظائرها",
            "articles": [
              {
                "number": "657",
                "paragraphs": [
                  "ترتب البطائق رقم 1 حسب الحروف الهجائية، وفيما يخص كل شخص حسب تاريخ الإدانة أو الحكم."
                ]
              },
              {
                "number": "658",
                "paragraphs": [
                  "تستوجب إقامة البطاقة رقم 1 المقررات الآتية:",
                  "1- المقررات الصادرة بالإدانة عن أية محكمة زجرية من أجل جناية أو جنحة؛",
                  "2- المقررات الصادرة بناء على مسطرة غيابية والمقررات الصادرة بالعقوبة في غيبة المحكوم عليه والتي لم يطعن فيها بالتعرض؛",
                  "3- المقررات الصادرة في حق الأحداث الجانحين، المشار إليها في المادة 506 أعلاه؛",
                  "4- المقررات الصادرة بالإدانة مع الإعفاء من العقوبة؛",
                  "5- المقررات التأديبية الصادرة عن السلطة القضائية أو عن سلطة إدارية فيما إذا ترتب عنها فقدان للأهلية أو نصت على هذا الفقدان؛",
                  "6- المقررات المعلنة للتصفية القضائية والعقوبات التي يحكم بها على مسيري المقاولة وسقوط الأهلية التجارية؛",
                  "7- قرارات الطرد المتخذة ضد الأجانب؛",
                  "8- المقررات الصادرة بسقوط الولاية الأبوية أو بسحب الحقوق المرتبطة بها كلا أو بعضا."
                ]
              },
              {
                "number": "659",
                "paragraphs": [
                  "يكون كل مقرر من المقررات المنصوص عليها في المادة السابقة موضوع البطاقة رقم 1 التي يحررها كاتب الضبط بالمحكمة التي بتت في القضية أو التي يقع بدائرتها مقر الهيئة التأديبية التي اتخذت المقررات التأديبية المشار إليها في البندين رقم 5 و7 من المادة السابقة.",
                  "تقام البطاقة رقم 1:",
                  "1- داخل خمسة عشر يوما من صيرورة المقرر نهائيا، في حالة صدوره حضوريا؛",
                  "2- بعد مرور خمسة عشر يوما من تاريخ تبليغ المقرر الصادر غيابيا؛",
                  "3- داخل خمسة عشر يوما من صدور المقرر بالعقوبة بناء على مسطرة غيابية.",
                  "يشهد وكيل الملك بصحة هذه البطائق بعد التأكد من محتواها، وتستعمل على الخصوص لتطبيق العقوبات في حالة العود ولإلغاء إيقاف التنفيذ وكذا لتمكين مختلف الإدارات من منع المجرمين من ولوج الوظائف العمومية والانخراط في القوات المسلحة الملكية."
                ]
              },
              {
                "number": "660",
                "paragraphs": [
                  "تحرر البطائق رقم 1 التي تثبت مقررا تأديبيا صادرا عن سلطة إدارية يتضمن أو يترتب عنه فقدان الأهلية، من طرف كاتب الضبط بمركز السجل العدلي بالمحكمة التي ولد بدائرتها الشخص المعني بالأمر، أو بمصلحة السجل العدلي المركزي إذا كان الشخص المذكور مولودا خارج المملكة، وذلك بناء على إشعار من السلطة الإدارية الصادر عنها المقرر توجهه إلى المركز المعني داخل خمسة عشر يوما من صدور المقرر.",
                  "تحرر البطائق رقم 1 التي تتضمن مقررا بطرد أجنبي داخل خمسة عشر يوما من صدور المقرر من طرف وزارة الداخلية وتوجه إلى السجل العدلي المركزي أو للسجل العدلي بمكان الولادة إن كان الصادر في حقه المقرر مولودا بالمغرب."
                ]
              },
              {
                "number": "661",
                "paragraphs": [
                  "تضاف إلى البطاقة رقم 1 التغييرات المتعلقة بما يلي:",
                  "الأوامر الملكية القاضية بالعفو من العقوبة كليا أو جزئيا أو استبدال عقوبة بأخرى؛",
                  "المقررات الصادرة بتوقيف تنفيذ عقوبة تطبيقا لمقتضيات المادة 137 من القانون رقم 108.13 المتعلق بالقضاء العسكري الصادر بتنفيذه الظهير الشريف رقم 1.14.178 بتاريخ 17 من صفر 1436 (10 ديسمبر 2014)؛",
                  "قرارات الإفراج المقيد بشروط وقرارات العدول عن هذا الإفراج؛",
                  "مقررات إيقاف تنفيذ العقوبة ومقررات رد الاعتبار القانوني أو القضائي ومقررات إنهاء الإقصاء؛",
                  "المقررات الصادرة بإلغاء أو توقيف قرارات طرد الأجانب؛",
                  "إلغاء المقررات المنصوص عليها في البند رقم 8 من المادة 658 من هذا القانون؛",
                  "المقررات الصادرة بإلغاء مقرر تأديبي يتضمن فقدانا لأهلية وفقا للفقرة الأولى من المادة 660 أعلاه؛",
                  "وبصفة عامة، كل مقرر يصدر بتغيير أو إنهاء العقوبات أو التدابير المنصوص عليها في المادتين 658 و660 أعلاه."
                ]
              },
              {
                "number": "662",
                "paragraphs": [
                  "يعهد إلى من يأتي ذكرهم بتحرير البطائق أو الأوراق المغيرة لمضمن البطاقة رقم 1، ويتعين توجيهها فورا إلى مركز السجل العدلي الوطني أو المركز المحلي المختص:",
                  "1- كاتب الضبط بالمحكمة التي أصدرت العقوبة إذا كان الأمر يتعلق بالعفو أو بإبدال عقوبة بأخرى أو بالتخفيض منها أو بإلغائها؛",
                  "2- مديري السجون والمشرفين الرؤساء، إذا كان الأمر يتعلق بتواريخ انتهاء العقوبات البدنية والإفراج المقيد بشروط، ومدير إدارة السجون إذا كان الأمر يرجع إلى قرارات إلغاء الإفراج المقيد بشروط؛",
                  "3- الخزنة الوزاريين والخزنة لدى الجماعات الترابية والخزنة المكلفين بالأداء لدى المؤسسات والمنشآت العامة المؤهلين بناء على قرار للوزير المكلف بالمالية لإجراء المراقبة على المداخيل وكتاب الضبط بالمحاكم إذا كان الأمر يتعلق بأداء الغرامة؛",
                  "4- السلطة التي أصدرت مقررات بتوقيف عقوبة أو إلغاء توقيفها إذا كان الأمر يرجع إلى مثل هذه المقررات؛",
                  "5- وزير الداخلية فيما يرجع للمقررات الصادرة بإلغاء أو إيقاف مفعول مقررات طرد الأجانب؛",
                  "6- النيابة العامة لدى المحكمة التي بتت في طلب رد الاعتبار؛",
                  "7- كاتب الضبط بالمحكمة التي بتت في النازلة إذا كان الأمر يتعلق بقابلية العذر في قضايا التصفية القضائية والتصديق على المصالحة بين المدين وغرمائه؛",
                  "8- كاتب الضبط لدى المحكمة الواقع بدائرتها مقر السلطة الإدارية التي قامت بالإشعار إذا كان الأمر يتعلق بإلغاء المقرر التأديبي المشار إليه في الفقرة الأولى من المادة 660 أعلاه."
                ]
              },
              {
                "number": "663",
                "paragraphs": [
                  "تسحب البطائق رقم 1 من السجل العدلي وتتلف في الحالات الآتية:",
                  "1- عند وفاة صاحب البطاقة؛",
                  "2- في حالة محو العقوبة المضمنة في البطاقة محوا تاما على إثر العفو الشامل؛",
                  "3- في حالة حصول المعني بالأمر على مقرر بإلغاء مضمون السجل العدلي؛",
                  "4- إذا تخلص المحكوم عليه من المسطرة الغيابية المقررة في حقه أو في حالة تعرض المحكوم عليه على الحكم الصادر غيابيا أو في حالة إبطال محكمة النقض للمقرر تطبيقا لمقتضيات المواد 560 و570 و571؛",
                  "5- إذا أمرت هيئة قضائية للأحداث بحذف البطاقة رقم 1 تطبيقا للمادة 507.",
                  "تجب الإشارة تلقائيا من طرف كاتب الضبط في البطاقة رقم 1 إلى رد الاعتبار بحكم القانون، المنصوص عليه في الباب الثاني من القسم الثالث من الكتاب السادس من هذا القانون بمجرد ما يصير حقا مكتسبا."
                ]
              },
              {
                "number": "664",
                "paragraphs": [
                  "يحرر نظير من جميع البطائق رقم 1 الناصة على عقوبة سالبة للحرية من أجل جناية أو جنحة مع تأجيل التنفيذ أو عدمه.",
                  "يوجه هذا النظير إلى الإدارة العامة للأمن الوطني على وجه الإخبار، ولا يطلع على مضمون هذا النظير إلا السلطات القضائية ومصالح الشرطة والدرك الملكي.",
                  "تحال أيضا على هذه الإدارة نظائر البطائق المتضمنة للتغييرات اللاحقة وفقا للمادة 661 أعلاه.",
                  "تسحب النظائر في الحالات المنصوص عليها في المادة 663 أعلاه من سجل الإدارة العامة للأمن الوطني."
                ]
              }
            ]
          },
          {
            "name": "الباب الثالث",
            "title": "البطائق رقم 2 والبطائق رقم 3",
            "articles": [
              {
                "number": "665",
                "paragraphs": [
                  "تعتبر البطاقة رقم 2 نسخة للنص الكامل لمختلف البطائق رقم 1 المتعلقة بشخص واحد.",
                  "تسلم هذه البطاقة للجهات الآتية:",
                  "أعضاء النيابة العامة وقضاة التحقيق والقضاة والمدير العام للأمن الوطني.",
                  "رؤساء المحاكم التجارية بقصد إضافتها إلى إجراءات التصفية القضائية.",
                  "السلطات العسكرية، فيما يخص الشبان الذين يرغبون في التجنيد بالقوات المسلحة الملكية.",
                  "المصلحة المكلفة بالحرية المحروسة، فيما يخص الأحداث الموضوعين تحت مراقبتها.",
                  "الإدارات العمومية للدولة المعروضة عليها إما طلبات التوظيف في وظائف عمومية أو اقتراحات لمنح شارات فخرية أو التزامات تخص سمسرة بعض الأشغال أو سمسرة صفقات عمومية أو قصد القيام بمتابعات تأديبية أو لفتح مؤسسة للتعليم الخاص.",
                  "السلطات المختصة بإعداد اللوائح الانتخابية أو للفصل في المنازعات الخاصة بممارسة حق من الحقوق الانتخابية.",
                  "غير أن المقررات المتعلقة بالأحداث الجانحين لا ينص عليها إلا في البطائق رقم 2، التي تسلم للقضاة وللمصلحة المكلفة بالحرية المحروسة المشار إليها أعلاه، باستثناء أية سلطة أو إدارة عمومية أخرى."
                ]
              },
              {
                "number": "666",
                "paragraphs": [
                  "تتحقق مراكز السجل العدلي من هوية الشخص الذي يعنيه الأمر، مع الاستعانة بالبطاقة الوطنية إن وجدت.",
                  "يتعين على السلطة التي تقوم بتحرير البطاقة رقم 2، في حالة عدم توفرها على ما يثبت هوية الشخص، أن تدرج في البطاقة بصفة بارزة عبارة: هوية غير محققة.",
                  "في حالة عدم وجود البطاقة رقم 1 في السجل العدلي لشخص من الأشخاص، تسلم البطاقة رقم 2 المتعلقة به حاملة للعبارة الآتية: لا شيء."
                ]
              },
              {
                "number": "667",
                "paragraphs": [
                  "تعتبر البطاقة رقم 3 بيانا بالأحكام الصادرة بعقوبات سالبة للحرية عن إحدى محاكم المملكة من أجل جناية أو جنحة، وينص فيها صراحة على أن الغرض منها ينحصر فيما ذكر.",
                  "لا تدرج في هذه البطاقة إلا العقوبات من النوع المشار إليه أعلاه والتي لم يقع محوها بسبب رد الاعتبار ولم تأمر المحكمة في شأنها بإيقاف التنفيذ، ما لم تصدر في هذه الحالة الأخيرة عقوبة جديدة تقضي بحرمان الشخص المعني بالأمر من الاستفادة من هذا التدبير."
                ]
              },
              {
                "number": "668",
                "paragraphs": [
                  "يقدم طلب الحصول على البطاقة رقم 3 للسجل العدلي بالنسبة للأشخاص المولودين بالمملكة المغربية إلى مركز السجل العدلي بالمحكمة الابتدائية التابع لها مكان ولادة الطالب.",
                  "لا يمكن أن يطلب البطاقة رقم 3 إلا الشخص المعني بها وبعد إدلائه بما يثبت هويته، ولا يمكن تسليمها لغيره إلا بناء على توكيل خاص.",
                  "يمكن للمعني بالأمر طلب البطاقة رقم 3 من مركز السجل العدلي لدى المحكمة الابتدائية التابع لها محل سكناه أو سكنى الشخص الذي يتوفر على توكيل خاص منه بذلك.",
                  "يحصل هذا المركز على البطاقة من قاعدة البيانات المركزية أو من مركز السجل العدلي المحلي لدى المحكمة التابع لها محل ولادة المعني بالأمر، ويمكنه أن ينوب عن المركز الأخير بختمه بطابع المركز.",
                  "يمكن للمعني بالأمر طلب وتسلم البطاقة رقم 3 من أي مركز للسجل العدلي والحصول عليها مباشرة أو بطريقة إلكترونية وفق ما تسمح به الوسائل التقنية المعتمدة.",
                  "إذا تعلق الأمر بشخص اعتباري، فإن الطلب يقدم إلى القاضي المكلف بالسجل العدلي المركزي من طرف الممثل القانوني للشخص الاعتباري الذي عليه أن يدلي بما يثبت صفته هذه.",
                  "إذا كان الشخص مقيما أو مستقرا بالخارج، فإن البطاقة رقم 3 تطلب وتوجه إليه بواسطة السلطات الدبلوماسية والقنصلية عند الاقتضاء."
                ]
              },
              {
                "number": "669",
                "paragraphs": [
                  "يتحقق مركز السجل العدلي من هوية الشخص ويحرر البطاقة رقم 3 وفقاً لما نص عليه في المادة 666 أعلاه.",
                  "غير أنه يكتفى بوضع سطر منحرف على البطاقة إذا كانت البيانات التي تتضمنها البطاقة رقم 1 لا يجوز إدراجها بالبطاقة رقم 3."
                ]
              },
              {
                "number": "670",
                "paragraphs": [
                  "يوقع البطائق رقم 2 والبطائق رقم 3 كاتب الضبط الذي تولى تحريرها، ويؤشر عليها وكيل الملك أو القاضي المكلف بمركز السجل العدلي الوطني ويضع عليها طابعه."
                ]
              }
            ]
          },
          {
            "name": "الباب الرابع",
            "title": "تعديل السجل العدلي",
            "articles": [
              {
                "number": "671",
                "paragraphs": [
                  "يمكن أن تجري المطالبة بتصحيح بيان مضمن في السجل العدلي، إما من الشخص الذي يوجد في بطاقته رقم 1 البيان المطلوب تصحيحه وإما تلقائيا من النيابة العامة."
                ]
              },
              {
                "number": "672",
                "paragraphs": [
                  "يقدم الطلب في شكل مقال إلى رئيس المحكمة التي أصدرت المقرر.",
                  "يطلع رئيس المحكمة النيابة العامة على المقال ويكلف، عند الاقتضاء، قاضيا بتقديم تقرير في الموضوع.",
                  "يمكن للهيئة المعروض عليها المقال أن تقوم أو تأمر بالقيام بجميع إجراءات التحقيق التي تراها ضرورية، بما في ذلك الأمر بإحضار الشخص الذي أشار مقدم المقال إلى أن العقوبة صدرت في حقه.",
                  "تجري المناقشات ثم يصدر المقرر في غرفة المشورة."
                ]
              },
              {
                "number": "673",
                "paragraphs": [
                  "إذا رفض الطلب، حكم على الطالب بأداء المصاريف.",
                  "إذا قبل الطلب أمرت الهيئة بأن يثبت مقررها في طرة وثيقة المقرر المشار إليه في طلب التصحيح، ويوجه ملخص هذا المقرر إلى مركز السجل العدلي بقصد تعديل البطاقة رقم 1، مع مراعاة البند رقم 3 من المادة 663 أعلاه.",
                  "يتحمل المصاريف الشخص الذي كان سببا في الاتهام الخاطئ وذلك إذا استدعي إلى الجلسة، فإن لم يستدع أو كان معسرا تحملت الخزينة المصاريف."
                ]
              },
              {
                "number": "674",
                "paragraphs": [
                  "تطبق الإجراءات المنصوص عليها في المادة 672 في حالة حدوث نزاع بشأن رد الاعتبار بحكم القانون، أو إذا طرأت صعوبات حول تفسير عفو شامل."
                ]
              }
            ]
          },
          {
            "name": "الباب الخامس",
            "title": "التبادل الدولي للبطائق رقم 1",
            "articles": [
              {
                "number": "675",
                "paragraphs": [
                  "يحرر نظير من البطاقة رقم 1 بشأن كل عقوبة سالبة للحرية أو بالغرامة تصدر من أجل جناية أو جنحة ضد أجنبي ينتمي لأحد الأقطار المبرم معها التبادل الدولي.",
                  "يوجه هذا النظير إلى وزير العدل قصد إرساله بالطريقة الدبلوماسية، ما لم تنص الاتفاقيات على طريقة أخرى."
                ]
              },
              {
                "number": "676",
                "paragraphs": [
                  "يوجه وزير العدل إلى مركز السجل العدلي الوطني أو المركز المحلي المختص ما يتوصل به من السلطات الأجنبية من المعلومات عن أحكام بالإدانة.",
                  "تقوم هذه المعلومات مقام البطاقة رقم 1، وتحفظ في السجل العدلي إما بأصلها وإما بتضمين محتوياتها في إحدى المطبوعات القانونية الشكل."
                ]
              },
              {
                "number": "677",
                "paragraphs": [
                  "يجب أن يضمن في البطائق رقم 2 المخصصة للقضاة والسلطات العسكرية بيان الأحكام الصادرة بالإدانة الموجهة في شأنها الإشعارات المنصوص عليها في المادة السابقة.",
                  "لا يشار إلى هذه الإشعارات في البطائق الحاملة رقم 3."
                ]
              }
            ]
          },
          {
            "name": "الباب السادس",
            "title": "أحكام خاصة ببطائق الأشخاص الاعتبارية",
            "articles": [
              {
                "number": "678",
                "paragraphs": [
                  "تهدف مجموعة بطائق الأشخاص الاعتبارية إلى جمع المعلومات المنصوص عليها في المادة 681 بعده، المتعلقة بالعقوبات أو التدابير الصادرة سواء في حق الأشخاص الاعتبارية أو في حق الأشخاص الذاتيين الذين يسيرونها."
                ]
              },
              {
                "number": "679",
                "paragraphs": [
                  "يتعين وضع بطاقة رقم 1 لكل حكم بعقوبة جبائية ضد شخص اعتباري صادر عن محكمة زجرية أو إدارية.",
                  "يتعين وضع بطاقة رقم 1 لكل حكم بعقوبة زجرية يصدر على شخص اعتباري.",
                  "يتعين وضع بطاقة رقم 1 لكل تدبير من التدابير وكل إغلاق ولو كان جزئيا أو مؤقتا وكل تدبير يقضي بالمنع من حق أو بسقوطه أو انعدام أهلية أو أي تدبير يحد من أحد الحقوق، وكل مصادرة تطال شخصا اعتباريا ولو كانت نتيجة لعقوبة حكم بها على شخص ذاتي مسير له.",
                  "يتعين وضع بطاقة رقم 1 للأحكام بالتصفية القضائية وسقوط الأهلية التجارية.",
                  "يتعين وضع بطاقة رقم 1 للأحكام الصادرة بمعاقبة مسيري الأشخاص الاعتبارية، ولو بصفة شخصية، في قضايا مخالفات التشريع الجبائي والجمركي والاقتصادي أو من أجل مخالفة قانون الصرف، وكذا الأحكام الصادرة بسبب ارتكابهم لجنايات أو جنح السرقة أو النصب أو خيانة الأمانة أو الشيك بدون مؤونة أو التزوير أو استعماله أو اختلاس الأموال العامة أو الغش وبصفة عامة كل جريمة تتعلق بالأموال.",
                  "يشار في السجل العدلي للأشخاص الاعتبارية ومسيريها إلى التغييرات اللاحقة المنصوص عليها في المادة 661 أعلاه.",
                  "تسري في حقها مقتضيات المادة 663 أعلاه."
                ]
              },
              {
                "number": "680",
                "paragraphs": [
                  "إذا صدرت عقوبة على شخص اعتباري أو على شخص ذاتي بصفته مسيرا لشخص اعتباري، وضعت إذ ذاك:",
                  "1- بطاقة رقم 1 خاصة بالشخص الاعتباري؛",
                  "2- بطاقة رقم 1 خاصة لكل واحد من المسيرين لشؤون الشخص الاعتباري المزاولين لمهامهم في يوم ارتكاب الجريمة.",
                  "غير أنه لا يشار إلى العقوبات والتدابير الصادرة في حق الشخص الاعتباري في البطاقة رقم 3 الخاصة بمسيريه."
                ]
              },
              {
                "number": "681",
                "paragraphs": [
                  "إذا صدرت عقوبة بصفة شخصية على أحد مسيري شخص اعتباري من أجل الجرائم المنصوص عليها في البند الخامس من المادة 679 أعلاه فتوضع:",
                  "1- بطاقة رقم 1 خاصة في اسم هذا المسير؛",
                  "2- بطاقة رقم 1 خاصة في اسم الشخص الاعتباري.",
                  "غير أنه لا يشار إلى العقوبات والتدابير الصادرة في حق مسير الشخص الاعتباري في البطاقة رقم 3 الخاصة بهذا الشخص الاعتباري."
                ]
              },
              {
                "number": "682",
                "paragraphs": [
                  "يتعين على كل هيئة قضائية أو كل سلطة أصدرت إحدى العقوبات أو التدابير المقررة في المادة 679 أعلاه، أن تشعر بها خلال أجل خمسة عشر يوما مركز السجل العدلي الوطني بوزارة العدل."
                ]
              },
              {
                "number": "683",
                "paragraphs": [
                  "يجب أن يبين في كل بطاقة تتعلق بشخص اعتباري اسم الشخص الاعتباري ومقره الاجتماعي ونوعه القانوني وتاريخ ارتكاب الجريمة وتاريخ العقوبة المحكوم بها أو التدابير المتخذة وكذلك نوعها وأسبابها.",
                  "يجب أن تثبت فيها بأحرف بارزة أسماء مسيري الشخص الاعتباري في يوم ارتكاب الجريمة أو ارتكاب الأفعال المؤدية إلى اتخاذ التدبير."
                ]
              },
              {
                "number": "684",
                "paragraphs": [
                  "يتعين أن يبين في كل بطاقة رقم 1 تتعلق بشخص ذاتي يسير شخصا اعتباريا هوية هذا الشخص وتاريخ ارتكاب الجريمة وتاريخ العقوبة المحكوم بها أو التدبير المتخذ وكذلك نوعهما وأسبابهما.",
                  "يجب أن يثبت فيها بأحرف بارزة اسم الشخص الاعتباري الذي يعتبر الشخص الذاتي من بين مسيريه والمهمة المنوطة به داخل هذا الشخص الاعتباري."
                ]
              },
              {
                "number": "685",
                "paragraphs": [
                  "تحفظ البطائق الخاصة بالأشخاص الاعتبارية من جهة والبطائق المتعلقة بمسيريها من جهة أخرى حسب الصنف المنتمية إليه وفقا للترتيب الأبجدي.",
                  "وإذا تعددت البطائق الخاصة بشخص اعتباري أو بشخص ذاتي مسير لشخص اعتباري، وجب ترتيبها حسب الأقدمية."
                ]
              },
              {
                "number": "686",
                "paragraphs": [
                  "يمكن أن تسلم البطاقة رقم 2 المتعلقة بشخص اعتباري أو بمسير شخص اعتباري لمن يأتي ذكرهم:",
                  "قضاة النيابة العامة وقضاة التحقيق والمدير العام للأمن الوطني والقيادة العليا للدرك الملكي ورؤساء مختلف المحاكم والهيئات القضائية والإدارات العمومية، خاصة منها المكلفة بالإشراف على المهن المختلفة؛",
                  "رؤساء المحاكم التجارية والقضاة المكلفين بالسجل التجاري عند تقديم طلبات الإدراج في السجل؛",
                  "مجلس القيم المنقولة فيما يخص الأشخاص الاعتبارية الخاضعة لمراقبته.",
                  "يمكن أن تسلم البطاقة لسائر الإدارات العمومية للدولة والجماعات المحلية التي تتلقى عروضا تتعلق بالتزامات أو سمسرة أشغال أو سمسرة صفقات عمومية.",
                  "تسلم البطائق رقم 3 طبقا لمقتضيات المادة 668 أعلاه."
                ]
              }
            ]
          }
        ]
      },
      {
        "name": "القسم الثالث",
        "title": "رد الاعتبار",
        "chapters": [
          {
            "name": "الباب الأول",
            "title": "أحكام عامة",
            "articles": [
              {
                "number": "687",
                "paragraphs": [
                  "يحق لكل شخص صدر في حقه مقرر قضائي من أجل جناية أو جنحة، الحصول على رد الاعتبار.",
                  "يمحو رد الاعتبار بالنسبة للمستقبل، الآثار الناتجة عن العقوبة وحالات فقدان الأهلية المترتبة عنها.",
                  "يرد الاعتبار إما بقوة القانون أو بمقرر قضائي."
                ]
              }
            ]
          },
          {
            "name": "الباب الثاني",
            "title": "رد الاعتبار بقوة القانون",
            "articles": [
              {
                "number": "688",
                "paragraphs": [
                  "يكتسب المحكوم عليه رد الاعتبار بقوة القانون ما لم يصدر ضده داخل الآجال المحددة فيما بعد أي حكم جديد بعقوبة سالبة للحرية من أجل جناية أو جنحة.",
                  "فيما يخص العقوبات بالغرامة، بعد انتهاء أجل ستة أشهر تحسب من يوم أدائها أو من يوم انتهاء الإكراه البدني أو انصرام أمد التقادم؛",
                  "فيما يخص العقوبة الوحيدة الصادرة بالحبس لمدة لا تتجاوز ستة أشهر بعد انتهاء أجل سنتين إما من يوم انتهاء العقوبة المنفذة على المحكوم عليه وإما من يوم انصرام أجل التقادم؛",
                  "فيما يخص العقوبة الوحيدة بالحبس لمدة لا تتجاوز سنتين أو فيما يخص عدة عقوبات لا يتجاوز مجموعها سنة واحدة، بعد انتهاء أجل أربع سنوات تبتدئ حسبما هو منصوص عليه في البند 2 أعلاه؛",
                  "فيما يخص العقوبة الوحيدة بالحبس لمدة تتجاوز سنتين من أجل جنحة أو فيما يخص عقوبات متعددة يتجاوز مجموعها سنة واحدة من أجل جنح، بعد انصرام أجل خمس سنوات تحسب بنفس الطريقة؛",
                  "فيما يخص العقوبة الجنائية الوحيدة أو العقوبات الجنائية المتعددة، بعد انصرام أجل عشر سنوات ابتداء من يوم انقضاء آخر عقوبة أو انصرام أمد تقادمها؛",
                  "فيما يخص العقوبات الجنائية المحكوم بها بصفة أصلية من غير العقوبات السالبة للحرية أو الغرامة، بعد انتهاء أجل خمس سنوات، إما من تاريخ انتهاء تنفيذها وإما من يوم انصرام أمد تقادمها.",
                  "في حالة الحكم بعقوبة مزدوجة بالغرامة والعقوبة السالبة للحرية، يحتسب الأجل الساري في العقوبة السالبة للحرية من أجل رد الاعتبار.",
                  "إذا تم إدماج عقوبات بمقتضى حكم اعتبرت – لتطبيق المقتضيات الواردة بهذه المادة – بمثابة عقوبة واحدة.",
                  "يعادل الإسقاط الكلي أو الجزئي للعقوبة بطريق العفو، تنفيذ هذه العقوبة كليا أو جزئياً."
                ]
              },
              {
                "number": "689",
                "paragraphs": [
                  "يرد الاعتبار كذلك بقوة القانون لكل محكوم عليه بعقوبة حبس أو غرامة مع إيقاف التنفيذ، وذلك بعد انتهاء فترة اختبار مدتها سنة ما لم يقع إلغاء إيقاف التنفيذ، تحسب من التاريخ الذي أصبحت فيه العقوبة مكتسبة لقوة الشيء المقضي به.",
                  "في حالة ازدواجية العقوبة بالغرامة النافذة والعقوبة السالبة للحرية الموقوفة التنفيذ، يحتسب الأجل الساري على الحبس الموقوف لرد الاعتبار."
                ]
              },
              {
                "number": "1-689",
                "paragraphs": [
                  "يتولى رئيس كتابة الضبط تنفيذ رد الاعتبار القانوني تلقائيا بعد استطلاع رأي النيابة العامة.",
                  "ولهذه الغاية، يتم إعداد قوائم سنوية بالبطائق التي استوفت العقوبات المضمنة بها للمدد المحددة في المادتين 688 و689 أعلاه.",
                  "كما يتم الاستغلال المعلوماتي لقاعدة بيانات السجل العدلي في رد الاعتبار القانوني تلقائيا في حالة توفرها."
                ]
              }
            ]
          },
          {
            "name": "الباب الثالث",
            "title": "رد الاعتبار القضائي",
            "articles": [
              {
                "number": "690",
                "paragraphs": [
                  "يكون رد الاعتبار قضائيا بمقرر يصدره قاضي تطبيق العقوبات.",
                  "يجب أن يكون طلب رد الاعتبار شاملا لمجموع المقررات القاضية بعقوبات نافذة لم يسبق محوها، لا عن طريق رد اعتبار سابق ولا عن طريق العفو العام."
                ]
              },
              {
                "number": "691",
                "paragraphs": [
                  "لا يمكن أن يطلب رد الاعتبار من القضاء، إلا المحكوم عليه أو ممثله القانوني إذا كان محجوراً عليه أو شخصاً اعتباريا.",
                  "في حالة وفاة المحكوم عليه، يمكن لزوجه أو أصوله أو فروعه تتبع الطلب الذي سبق أن تقدم به المتوفى ويمكنهم أن يتقدموا بالطلب مباشرة داخل أجل ثلاث سنوات من تاريخ الوفاة، ويمدد هذا الأجل لغاية نهاية السنة الموالية للأجل المعتمد عليه لحساب المدة المشار إليها في المادة 693 من هذا القانون، إذا طرأت الوفاة قبل مرور المدة القانونية اللازمة لطلب رد الاعتبار."
                ]
              },
              {
                "number": "692",
                "paragraphs": [
                  "لا يمكن طلب رد الاعتبار قبل انصرام أجل سنتين.",
                  "غير أن هذا الأجل يخفض إلى سنة واحدة إذا كانت العقوبة الصادرة من أجل جنحة غير عمدية، أو عقوبة زجرية أخرى صادرة بصفة أصلية من غير العقوبات السالبة للحرية.",
                  "إذا تعلق الأمر بعقوبة الغرامة فقط، فإنه يمكن طلب رد الاعتبار بمجرد أدائها.",
                  "يرفع هذا الأجل إلى أربع سنوات في حق المحكوم عليه بعقوبة جنائية.",
                  "يبتدئ سريان الأجل من يوم الإفراج بالنسبة للمحكوم عليه بعقوبة سالبة للحرية، ومن يوم الأداء في حق المحكوم عليه بغرامة، ومن يوم انتهاء تنفيذ العقوبات الزجرية الصادرة بصفة أصلية من غير العقوبات السالبة للحرية أو الغرامة.",
                  "وفي حالة الحكم بعقوبة مزدوجة بالغرامة والعقوبة السالبة للحرية، يحتسب الأجل الساري في العقوبة السالبة للحرية فقط.",
                  "في حالة الحكم بعقوبة مزدوجة بالغرامة وعقوبة زجرية أخرى غير العقوبة السالبة للحرية، يحسب الأجل الساري للعقوبة الزجرية."
                ]
              },
              {
                "number": "693",
                "paragraphs": [
                  "لا يقبل من المحكوم عليه الذي يوجد في حالة العود إلى الجريمة ولا من المحكوم عليه الذي صدر في حقه حكم بعقوبة جديدة سالبة للحرية بعد رد الاعتبار إليه، تقديم طلب رد الاعتبار إلا بعد مرور أجل أربع سنوات من يوم الإفراج عنه.",
                  "غير أنه إذا كانت العقوبة الجديدة عقوبة جنائية، رفعت فترة الاختبار إلى ست سنوات."
                ]
              },
              {
                "number": "694",
                "paragraphs": [
                  "يجب على المحكوم عليه باستثناء الحالة المنصوص عليها في المادة 695 بعده، أن يثبت أداء المصاريف القضائية والغرامة والتعويض أو يثبت إعفاءه من أدائها."
                ]
              },
              {
                "number": "695",
                "paragraphs": [
                  "لا يخضع رد الاعتبار لأي شرط يتعلق بالأجل أو بتنفيذ العقوبة إذا أدى المحكوم عليه بعد ارتكابه الجريمة خدمات جليلة للبلاد مخاطرا بحياته. وفي هذه الحالة يمكن رد الاعتبار للمحكوم عليه ولو لم يثبت أداء المصاريف القضائية أو الغرامة أو التعويض.",
                  "لا يخضع رد الاعتبار لأي شرط يتعلق بالأجل بالنسبة للمحكوم عليهم الذين نفذوا عقوباتهم السالبة للحرية وحصلوا على شهادة من الإدارة المكلفة بالسجون تشهد على حسن سلوكهم خلال مدة قضاء العقوبة وبمشاركتهم في برامج إعادة الإدماج وحصولهم على تكوين مهني أو حرفي أو دراسي يؤهلهم للاندماج في المجتمع ولاسيما الحصول على عمل."
                ]
              },
              {
                "number": "696",
                "paragraphs": [
                  "يقدم المحكوم عليه طلبا برد الاعتبار لوكيل الملك بمحل إقامته الحالي أو بآخر موطن له بالمغرب إذا كان يقيم بالخارج ويبين بدقة في هذا الطلب: تاريخ المقرر الصادر في حقه والمحكمة التي صدر عنها، والأماكن التي أقام بها المحكوم عليه منذ الإفراج عنه.",
                  "غير أنه إذا كان المحكوم عليه شخصا اعتباريا، فإن طلب رد الاعتبار يقدمه ممثله القانوني لوكيل الملك بالمقر الاجتماعي للشخص الاعتباري، أو لوكيل الملك بمقر المحكمة التي أصدرت الحكم ويثبت فيه بدقة: تاريخ المقرر القضائي الصادر في حق الشخص الاعتباري والمحكمة التي صدر عنها، وكل نقل للمقر الاجتماعي للشخص الاعتباري منذ صدور الحكم."
                ]
              },
              {
                "number": "697",
                "paragraphs": [
                  "يطلب وكيل الملك شهادات من ولاة أو عمال الأقاليم أو العمالات أو المفوضين من قبلهم بالأماكن التي أقام بها المحكوم عليه، ويتعين أن تحتوي على البيانات الآتية: مدة إقامة المحكوم عليه بكل مكان، وسيرته أثناء هذه الإقامة، ووسائل معيشته خلال نفس المدة.",
                  "علاوة على ذلك، يمكن لوكيل الملك أن يأمر بإجراء بحث تقوم به مصالح الدرك أو الشرطة بالأماكن التي أقام بها المحكوم عليه."
                ]
              },
              {
                "number": "698",
                "paragraphs": [
                  "يسعى وكيل الملك للحصول على نسخة من الأحكام أو القرارات الصادرة بالعقوبة.",
                  "ملخص سجل الاعتقال في المؤسسات السجنية التي قضى بها المحكوم عليه مدة عقوبته، ورأي المدير أو رئيس المؤسسة السجنية حول سلوك المحكوم عليه خلال مدة الاعتقال.",
                  "البطاقة رقم 2 من السجل العدلي."
                ]
              },
              {
                "number": "699",
                "paragraphs": [
                  "يوجه وكيل الملك طلب رد الاعتبار مقرونا برأيه والوثائق المشار إليها في المادتين 697 و698 أعلاه إلى قاضي تطبيق العقوبات للبت فيه طبقا للقانون.",
                  "يمكن لطالب رد الاعتبار أن يعرض مباشرة على قاضي تطبيق العقوبات المعروض عليه الطلب سائر الوثائق التي يراها مفيدة."
                ]
              },
              {
                "number": "700",
                "paragraphs": [
                  "يبت قاضي تطبيق العقوبات في الطلب بناء على ملتمسات النيابة العامة، وبعد الاستماع، عند الاقتضاء، إلى الطرف الذي يعنيه الأمر أو إلى محاميه بعد استدعائهما بصفة قانونية."
                ]
              },
              {
                "number": "701",
                "paragraphs": [
                  "في حالة رفض طلب رد الاعتبار، لا يمكن تقديم طلب جديد ولو في الحالة المنصوص عليها في المادة 695 أعلاه إلا بعد انصرام أجل ستة أشهر تحسب من تاريخ هذا الرفض، ما لم يكن الرفض بسبب عدم استيفاء الآجال المنصوص عليها في المادة 692 أعلاه.",
                  "وفي جميع الأحوال يمكن تقديم الطلب مجددا بمجرد استيفاء المدد المنصوص عليها قانونا."
                ]
              },
              {
                "number": "702",
                "paragraphs": [
                  "تقع الإشارة إلى القرار الصادر برد الاعتبار بطرة المقررات الصادرة بالعقوبة وفي السجل العدلي.",
                  "لا يمكن في هذه الحالة أن يشار إلى العقوبة بالبطاقة رقم 3 من السجل العدلي، ولا يشار إليها إلا في البطاقة رقم 2 المسلمة للقضاة من أجل تطبيق مقتضيات المادة 693 أعلاه.",
                  "يمكن لمن رد له الاعتبار أن يحصل على نسخة من القرار الصادر برد الاعتبار وملخص من السجل العدلي دون مصاريف."
                ]
              }
            ]
          }
        ]
      }
    ]
  }