{
    "name": "الكتاب الأول",
    "title": "التحري عن الجرائم ومعاينتها",
    "sections": [
      {
        "name": "القسم الأول",
        "title": "السلطات المكلفة بالتحري عن الجرائم",
        "chapters": [
          {
            "name": "الباب الأول",
            "title": "سرية البحث والتحقيق",
            "branches": [
              {
                "name": "الفرع الأول",
                "title": "أحكام عامة",
                "articles": [
                  {
                    "number": "15",
                    "paragraphs": [
                      "تكون المسطرة التي تجرى أثناء البحث والتحقيق سرية.",
                      "كل شخص يساهم في إجراء هذه المسطرة ملزم بالحفاظ على سرية البحث والتحقيق تحت طائلة العقوبات المقررة في مجموعة القانون الجنائي.",
                      "غير أنه يجوز للنيابة العامة، عند الاقتضاء، إطلاع الرأي العام على القضية والإجراءات المتخذة فيها ومستجداتها ومآلها، دون تقييم الاتهامات الموجهة إلى الأشخاص المشتبه فيهم والمتهمين.",
                      "دون الإخلال بمهام الاتصال والتواصل التي تباشرها الإدارات والمصالح والسلطات العمومية المعنية، يمكن للنيابة العامة أن تأذن للشرطة القضائية بنشر بلاغات حول القضايا المسجلة دون الكشف عن هويات المشتبه فيهم أو المساس بحياتهم الخاصة.",
                      "يتم تعيين قاض أو أكثر للنيابة العامة يتولى مهام ناطق رسمي للمحكمة للتواصل مع الرأي العام.",
                      "لا يعد إفشاء لسرية البحث والتحقيق نشر الأسماء والصور والرسوم التقريبية للمشتبه فيهم أو المتهمين الفارين من العدالة.",
                      "تراعى في كل الأحوال قرينة البراءة وحماية المعطيات ذات الطابع الشخصي."
                    ]
                  },
                  {
                    "number": "16",
                    "paragraphs": [
                      "يمارس مهام الشرطة القضائية القضاة والضباط والموظفون والأعوان المبينون في هذا القسم.",
                      "يسير وكيل الملك أعمال الشرطة القضائية في دائرة نفوذه."
                    ]
                  },
                  {
                    "number": "17",
                    "paragraphs": [
                      "توضع الشرطة القضائية في دائرة نفوذ كل محكمة استئناف تحت سلطة الوكيل العام للملك ومراقبة الغرفة الجنحية بمحكمة الاستئناف المشار إليها في الفرع الخامس من هذا الباب.",
                      "تعمل الشرطة القضائية تحت سلطة النيابة العامة وقضاة التحقيق كل فيما يخصه، فيما يتعلق بالأبحاث والتحريات عن الجرائم وضبط مرتكبيها وفي كل الإجراءات المنصوص عليها في القانون.",
                      "يتلقى ضباط الشرطة القضائية التعليمات، فيما يتعلق بمهامهم القضائية، من السلطات المشار إليها في الفقرة الثانية أعلاه."
                    ]
                  },
                  {
                    "number": "18",
                    "paragraphs": [
                      "يعهد إلى الشرطة القضائية تبعا للبيانات المقررة في هذا القسم بالتثبت من وقوع الجرائم وجمع الأدلة عنها والبحث عن مرتكبيها.",
                      "تقوم بتنفيذ أوامر وإنابات قضاء التحقيق وأوامر النيابة العامة."
                    ]
                  },
                  {
                    "number": "19",
                    "paragraphs": [
                      "تضم الشرطة القضائية بالإضافة إلى الوكيل العام للملك لدى محكمة النقض والمحامين العامين التابعين له، والوكيل العام للملك ووكيل الملك ونوابهما، وقاضي التحقيق، بوصفهم ضباطا سامين للشرطة القضائية:",
                      "أولا: ضباط الشرطة القضائية؛",
                      "ثانيا: ضباط الشرطة القضائية المكلفين بالأحداث؛",
                      "ثالثا: أعوان الشرطة القضائية؛",
                      "رابعا: الموظفون والأعوان الذين ينيط بهم القانون بعض مهام الشرطة القضائية."
                    ]
                  }
                ]
              },
              {
                "name": "الفرع الثاني",
                "title": "ضباط الشرطة القضائية",
                "articles": [
                  {
                    "number": "20",
                    "paragraphs": [
                      "يحمل صفة ضابط للشرطة القضائية:",
                      "- المدير العام للأمن الوطني وولاة الأمن والمراقبون العامون للشرطة وعمداء الشرطة وضباطها؛",
                      "- المدير العام لإدارة مراقبة التراب الوطني وولاة الأمن والمراقبون العامون للشرطة وعمداء الشرطة وضباطها بهذه الإدارة، فيما يخص الجرائم المنصوص عليها في المادة 108 من هذا القانون وكذا الجرائم المرتبطة بها أو غير القابلة للتجزئة؛",
                      "- ضباط الدرك الملكي وذوو الرتب فيه وكذا الدركيون الذين يتولون قيادة فرقة أو مركز للدرك الملكي طيلة مدة هذه القيادة؛",
                      "- الباشوات والقواد وخلفاء القواد، بمختلف درجاتهم ومهامهم.",
                      "يمكن تخويل صفة ضابط للشرطة القضائية:",
                      "- لمفتشي الشرطة التابعين للمديرية العامة للأمن الوطني أو المديرية العامة لمراقبة التراب الوطني، ممن قضوا على الأقل ثلاث سنوات بهذه الصفة بقرار مشترك لرئيس النيابة العامة ووزير الداخلية؛",
                      "- للدركيين الذين قضوا على الأقل ثلاث سنوات من الخدمة بالدرك الملكي وعينوا اسميا بقرار مشترك لرئيس النيابة العامة والسلطة الحكومية المكلفة بإدارة الدفاع الوطني."
                    ]
                  },
                  {
                    "number": "21",
                    "paragraphs": [
                      "يباشر ضباط الشرطة القضائية السلطات المحددة في المادة 18 أعلاه.",
                      "يتلقون الشكايات والوشايات ويجرون الأبحاث التمهيدية، طبقا للشروط المنصوص عليها في الباب الثاني من القسم الثاني من الكتاب الأول من هذا القانون.",
                      "غير أنه إذا تعلق الأمر بوشايات مجهولة المصدر، فإنه يتعين قبل مباشرة الأبحاث بشأنها الحصول على إذن من النيابة العامة المختصة.",
                      "يمارس ضباط الشرطة القضائية السلطات المخولة لهم بمقتضى الباب الأول من القسم الثاني من الكتاب الأول من هذا القانون في حالة التلبس بجناية أو جنحة.",
                      "يتعين عليهم الاستعانة بمترجم، إذا كان الشخص المستمع إليه يتحدث لغة أو لهجة لا يحسنها ضابط الشرطة القضائية، أو يستعينون بكل شخص يحسن التخاطب مع المعني بالأمر إذا كان أصما أو أبكما، ويشار إلى هوية المترجم أو الشخص المستعان به بالمحضر ويمضي عليه.",
                      "يحق لهم أن يلتمسوا مباشرة مساعدة القوة العمومية لتنفيذ مهامهم.",
                      "يمكن لضباط الشرطة القضائية، عند الضرورة، الاستعانة بالضباط والموظفين ذوي الاختصاص العاملين بالإدارات والهيئات التي يتبعون لها إداريا، مع مراعاة الفقرة 9 من المادة 24 أدناه، كما يمكنهم في إطار الأبحاث القضائية التي يقومون بها توجيه طلبات بإذن من النيابة العامة المختصة للإدارات والأشخاص الاعتبارية الخاضعة للقانون العام أو الخاص قصد تمكينهم من المعطيات الضرورية لسير الأبحاث."
                    ]
                  },
                  {
                    "number": "22",
                    "paragraphs": [
                      "يمارس ضباط الشرطة القضائية اختصاصاتهم في نطاق الحدود الترابية التي يزاولون فيها وظائفهم.",
                      "يمكنهم في حالة الاستعجال أو إذا استدعت ضرورة البحث ذلك، أن يمارسوا مهامهم في جميع أنحاء المملكة إذا طلبت منهم ذلك السلطة القضائية أو العمومية.",
                      "يتعين إشعار النيابة العامة المختصة مكانيا بهذا الانتقال، كما يتعين أن يتم تنفيذ الإجراءات بحضور ضابط شرطة مختص مكانيا.",
                      "يمارس ضباط الشرطة القضائية في هذه الحالة كافة الصلاحيات التي يخولها لهم القانون.",
                      "يمكن، عند الضرورة أو في حالة الاستعجال أو مخافة اندثار الأدلة، تكليف ضابط الشرطة القضائية المختص مكانيا باتخاذ إجراءات من أعمال البحث التي يتعذر على ضابط الشرطة القضائية المكلف بالبحث إجراءها وإنجاز محضر بشأنها، وذلك بعد إشعار الجهة القضائية التي تشرف على البحث وكذلك النيابة العامة التي سيجري البحث في دائرة نفوذها.",
                      "إذا تعلق الأمر بانتقال ضباط شرطة قضائية يشمل اختصاصهم أكثر من دائرة قضائية، تعين عليهم إشعار الجهة القضائية التي تشرف على البحث وكذلك النيابة العامة التي انتقلوا لإجراء البحث في دائرتها. كما يمكنهم الاستعانة بضابط شرطة قضائية أو أكثر مختص مكانيا.",
                      "في كل دائرة حضرية مقسمة إلى دوائر للشرطة، يمتد اختصاص ضباط الشرطة القضائية الممارسين لمهامهم في إحدى هذه الدوائر إلى مجموع الدائرة.",
                      "إذا حدث لأحد هؤلاء الضباط مانع، يكلف ضابط من أي دائرة مجاورة للقيام مقامه.",
                      "يجب إخبار وكيل الملك والوكيل العام للملك المختص، بكل تغيير يطرأ تنفيذا لمقتضيات الفقرات السابقة."
                    ]
                  },
                  {
                    "number": "22-1",
                    "paragraphs": [
                      "يمكن إنشاء فرق وطنية أو جهوية للشرطة القضائية بمقتضى قرار مشترك لرئيس النيابة العامة والسلطة الحكومية المشرفة إداريا على الفرقة.",
                      "تخضع هذه الفرق لتسيير النيابة العامة التي تشرف على البحث.",
                      "يمكن للنيابة العامة إذا اقتضت ضرورة البحث أو طبيعة الجريمة، أن تعهد بالبحث إلى فرقة مشتركة تتألف من ضباط للشرطة القضائية ينتمون لجهات إدارية مختلفة يرأسها ضابط للشرطة القضائية تعينه النيابة العامة المختصة لهذا الغرض."
                    ]
                  },
                  {
                    "number": "23",
                    "paragraphs": [
                      "يجب على ضباط الشرطة القضائية أن يحرروا محاضر بما أنجزوه من عمليات وأن يخبروا وكيل الملك أو الوكيل العام للملك المختص فورا بما يصل إلى علمهم من جنايات وجنح.",
                      "يجب على ضباط الشرطة القضائية، بمجرد انتهاء عملياتهم، أن يوجهوا مباشرة إلى وكيل الملك أو الوكيل العام للملك أصول المحاضر التي يحررونها مرفقة بنسختين منها مشهود بمطابقتهما للأصل، وكذا جميع الوثائق والمستندات المتعلقة بها.",
                      "توضع الأشياء المحجوزة رهن إشارة وكيل الملك أو الوكيل العام للملك.",
                      "يجب أن تشير المحاضر إلى أن لمحررها صفة ضابط الشرطة القضائية."
                    ]
                  },
                  {
                    "number": "24",
                    "paragraphs": [
                      "المحضر في مفهوم المادة 23 أعلاه هو كل وثيقة تحرر على دعامة ورقية أو إلكترونية من لدن ضابط الشرطة القضائية أو تحت إشرافه أثناء ممارسة مهامه، ويضمنها ما عاينه أو ما تلقاه من تصريحات أو ما قام به من عمليات ترجع لاختصاصه.",
                      "دون الإخلال بالبيانات المشار إليها في مواد أخرى من هذا القانون أو في نصوص خاصة أخرى، يتضمن المحضر خاصة اسم محرره وصفته ومكان عمله وتوقيعه، ويشار فيه إلى تاريخ وساعة إنجاز الإجراء وساعة تحرير المحضر إذا كانت تخالف ساعة إنجاز الإجراء.",
                      "يتضمن محضر الاستماع هوية الشخص المستمع إليه ورقم بطاقة هويته عند الاقتضاء، وتصريحاته والأجوبة التي يرد بها عن أسئلة ضابط الشرطة القضائية، وإذا تعلق الأمر بشخص أجنبي يشار أيضا في المحضر إلى هويته بالحروف اللاتينية وإلى المترجم الذي تمت الاستعانة به عند الاقتضاء.",
                      "إذا تعلق الأمر بمشتبه فيه، يتعين على ضابط الشرطة القضائية إشعاره بالأفعال المنسوبة إليه.",
                      "يقرأ المصرح تصريحاته أو تتلى عليه، ويشار إلى ذلك بالمحضر، ثم يدون ضابط الشرطة القضائية الإضافات أو التغييرات أو الملاحظات التي يبديها المصرح، أو يشير إلى عدم وجودها.",
                      "يوقع المصرح إلى جانب ضابط الشرطة القضائية على المحضر عقب التصريحات وبعد الإضافات، ويدون اسمه بخط يده. وإذا كان لا يحسن الكتابة أو التوقيع يضع بصمته، ويشار إلى ذلك في المحضر.",
                      "يصادق ضابط الشرطة القضائية والمصرح على التشطيبات والإحالات.",
                      "يتضمن المحضر كذلك الإشارة إلى رفض التوقيع أو الإبصام أو عدم استطاعته، مع بيان أسباب ذلك.",
                      "من أجل ضرورة المعالجة المعلوماتية للمحاضر، يحدد شكل المحضر بقرار مشترك لوزير العدل والسلطة الحكومية المشرفة إداريا على محرر المحضر بعد استطلاع رأي رئيس النيابة العامة.",
                      "يمكن لهذا الغرض أن يكون المحضر مذيلًا بالتوقيع الإلكتروني أو الرقمي لمحرره أو الشخص المستمع إليه."
                    ]
                  }
                ]
              },
              {
                "name": "الفرع الثالث",
                "title": "أعوان الشرطة القضائية",
                "articles": [
                  {
                    "number": "25",
                    "paragraphs": [
                      "أعوان الشرطة القضائية هم:",
                      "أولا: موظفو المصالح العاملة للشرطة بالمديرية العامة للأمن الوطني الذين ليست لهم صفة ضابط الشرطة القضائية؛",
                      "ثانيا: موظفو المصالح العاملة بالمديرية العامة لمراقبة التراب الوطني الذين ليست لهم صفة ضابط الشرطة القضائية؛",
                      "ثالثا: الدركيون الذين ليست لهم صفة ضابط الشرطة القضائية."
                    ]
                  },
                  {
                    "number": "26",
                    "paragraphs": [
                      "تناط بأعوان الشرطة القضائية المهام التالية:",
                      "أولا: مساعدة ضباط الشرطة القضائية في مباشرة مهامهم؛",
                      "ثانيا: إخبار رؤسائهم المباشرين بجميع الجرائم التي تبلغ إلى علمهم؛",
                      "ثالثا: جمع كل المعلومات المؤدية إلى العثور على مرتكبيها، وفقا لأوامر رؤسائهم ونظام الهيئة التي ينتمون إليها."
                    ]
                  }
                ]
              },
              {
                "name": "الفرع الرابع",
                "title": "الموظفون والأعوان المكلفون ببعض مهام الشرطة القضائية",
                "articles": [
                  {
                    "number": "27",
                    "paragraphs": [
                      "يمارس موظفو وأعوان الإدارات والمرافق العمومية الذين تسند إليهم بعض مهام الشرطة القضائية بموجب نصوص خاصة، هذه المهام حسب الشروط وضمن الحدود المبينة في هذه النصوص."
                    ]
                  },
                  {
                    "number": "28",
                    "paragraphs": [
                      "يجوز للوالي أو العامل، في حالة الاستعجال، عند ارتكاب جرائم تمس أمن الدولة الداخلي أو الخارجي، أن يقوم شخصيا بالإجراءات الضرورية للتثبت من ارتكاب الجرائم المبينة أعلاه أو أن يأمر كتابة ضباط الشرطة القضائية المختصين بالقيام بذلك، ما لم يخبر بإحالة القضية إلى السلطة القضائية.",
                      "يجب على الوالي أو العامل، في حالة استعماله لهذا الحق، أن يخبر بذلك فورا ممثل النيابة العامة لدى المحكمة المختصة، وأن يتخلى له عن القضية خلال الأربع والعشرين ساعة الموالية للشروع في العمليات، ويوجه إليه جميع الوثائق، ويقدم له جميع الأشخاص الذين ألقي عليهم القبض.",
                      "يجب على كل ضابط من ضباط الشرطة القضائية تلقى أمرا بالتسخير من الوالي أو العامل عملا بالمقتضيات أعلاه، وعلى كل موظف بلغ إليه أمر القيام بحجز عملا بنفس المقتضيات، أن يمتثل لتلك الأوامر وأن يخبر بذلك فورا ممثل النيابة العامة المشار إليه في الفقرة السابقة.",
                      "إذا تبين للنيابة العامة أن القضية من اختصاص المحكمة العسكرية، تحيل الوثائق إلى الوكيل العام للملك لدى المحكمة العسكرية، وتأمر فورا عند الاقتضاء بتقديم الأشخاص الملقى عليهم القبض إلى السلطة المختصة."
                    ]
                  }
                ]
              },
              {
                "name": "الفرع الخامس",
                "title": "مراقبة أعمال الشرطة القضائية",
                "articles": [
                  {
                    "number": "29",
                    "paragraphs": [
                      "تراقب الغرفة الجنحية بمحكمة الاستئناف أعمال ضباط الشرطة القضائية عندما تكون صادرة عنهم بهذه الصفة."
                    ]
                  },
                  {
                    "number": "30",
                    "paragraphs": [
                      "يحيل الوكيل العام للملك لدى محكمة الاستئناف إلى الغرفة الجنحية بمحكمة الاستئناف كل إخلال ينسب لضابط من ضباط الشرطة القضائية أثناء قيامه بمهامه."
                    ]
                  },
                  {
                    "number": "31",
                    "paragraphs": [
                      "تأمر الغرفة الجنحية بمحكمة الاستئناف، بعد إحالة القضية إليها وتقديم الوكيل العام للملك لملتمساته الكتابية، بإجراء بحث وتستمع لأقوال ضابط الشرطة القضائية المنسوب إليه الإخلال.",
                      "يجب أن يستدعى ضابط الشرطة القضائية للاطلاع على ملفه المفتوح له بالنيابة العامة لمحكمة الاستئناف داخل أجل لا يقل عن خمسة عشر يوما من تاريخ التوصل بالاستدعاء.",
                      "يمكنه اختيار محام لمساعدته."
                    ]
                  },
                  {
                    "number": "32",
                    "paragraphs": [
                      "يمكن للغرفة الجنحية لدى محكمة الاستئناف، بصرف النظر عن العقوبات التأديبية التي قد يتخذها في حقه رؤساؤه الإداريون، أن تصدر في حق ضابط الشرطة القضائية إحدى العقوبات التالية:",
                      "- توجيه ملاحظات؛",
                      "- التوقيف المؤقت عن ممارسة مهام الشرطة القضائية لمدة لا تتجاوز سنة واحدة؛",
                      "- التجريد النهائي من مهام الشرطة القضائية.",
                      "يمكن الطعن بالنقض في قرار الغرفة الجنحية، وفقا للشروط والكيفيات العادية."
                    ]
                  },
                  {
                    "number": "33",
                    "paragraphs": [
                      "إذا ارتأت الغرفة الجنحية أن ضابط الشرطة القضائية ارتكب جريمة، أمرت علاوة على ما هو منصوص عليه في المادة 32 أعلاه بإحالة الملف إلى الوكيل العام للملك لاتخاذ ما يراه ملائما."
                    ]
                  },
                  {
                    "number": "34",
                    "paragraphs": [
                      "تبلغ المقررات المتخذة ضد ضباط الشرطة القضائية بناء على المقتضيات السابقة، إلى علم السلطات التي ينتمون إليها بمبادرة من الوكيل العام للملك."
                    ]
                  },
                  {
                    "number": "35",
                    "paragraphs": [
                      "تطبق مقتضيات هذا الفرع على جميع الموظفين وأعوان الإدارات والمرافق العمومية، الذين تخولهم نصوص خاصة بعض مهام الشرطة القضائية، عندما يمارسون هذه المهام، حسب الشروط وضمن الحدود المبينة في هذه النصوص."
                    ]
                  }
                ]
              }
            ]
          },
          {
            "name": "الباب الثالث",
            "title": "النيابة العامة",
            "branches": [
              {
                "name": "الفرع الأول",
                "title": "أحكام عامة",
                "articles": [
                  {
                    "number": "36",
                    "paragraphs": [
                      "تتولى النيابة العامة إقامة وممارسة الدعوى العمومية ومراقبتها وتطالب بتطبيق القانون، ولها أثناء ممارسة مهامها الحق في تسخير القوة العمومية مباشرة."
                    ]
                  },
                  {
                    "number": "37",
                    "paragraphs": [
                      "تمثل النيابة العامة لدى كل محكمة زجرية وتحضر مناقشات هيئات الحكم، ويجب النطق بجميع المقررات بحضورها.",
                      "تقوم النيابة العامة بإشعار الوكيل القضائي للمملكة بالمتابعات المقامة في حق القضاة أو الموظفين أو الأعوان التابعين للسلطة أو القوة العمومية، وتشعر كذلك الإدارة التي ينتمون إليها.",
                      "تسهر النيابة العامة على تنفيذ المقررات القضائية."
                    ]
                  },
                  {
                    "number": "38",
                    "paragraphs": [
                      "يجب على النيابة العامة أن تقدم ملتمسات كتابية، طبقا للتعليمات التي تتلقاها، ضمن الشروط المنصوص عليها في المادة 51-2 أدناه، وهي حرة في تقديم الملاحظات الشفهية التي ترى أنها ضرورية لفائدة العدالة."
                    ]
                  }
                ]
              },
              {
                "name": "الفرع الثاني",
                "title": "وكيل الملك",
                "articles": [
                  {
                    "number": "39",
                    "paragraphs": [
                      "يمثل وكيل الملك شخصيا، أو بواسطة نوابه، النيابة العامة في دائرة نفوذ المحكمة الابتدائية المعين بها، ويمارس الدعوى العمومية تحت مراقبة الوكيل العام للملك إما تلقائيا أو بناء على شكاية أي شخص متضرر.",
                      "يمارس وكيل الملك سلطته على نوابه، وله أثناء مزاولة مهامه الحق في تسخير القوة العمومية مباشرة.",
                      "يجب عليه أن يخبر الوكيل العام للملك بالجنايات التي تبلغ إلى علمه وكذا بمختلف الأحداث والجرائم الخطيرة أو التي من شأنها أن تخل بالأمن العام."
                    ]
                  },
                  {
                    "number": "40",
                    "paragraphs": [
                      "يتلقى وكيل الملك المحاضر والشكايات والوشايات ويتخذ بشأنها ما يراه ملائما، مع مراعاة مقتضيات المادة 83 من هذا القانون.",
                      "غير أنه إذا تعلق الأمر بوشايات مجهولة المصدر، فإنه يتعين قبل الإذن بمباشرة الأبحاث بشأنها القيام بالتحريات الأولية للتأكد من جديتها.",
                      "يباشر بنفسه أو يأمر بمباشرة الإجراءات الضرورية للبحث عن مرتكبي المخالفات للتشريع الجنائي، ويصدر الأمر بضبطهم وتقديمهم ومتابعتهم.",
                      "يمكن لوكيل الملك، لضرورة البحث، إذا عرضت عليه مسألة تقنية أو فنية أن يستعين بذوي الخبرة والمعرفة. ويمكن بصفة خاصة أن يأمر بإجراء خبرة لتحديد فصيلة البصمات البيولوجية والجينية للأشخاص المشتبه فيهم الذين توجد قرائن على تورطهم في ارتكاب إحدى الجرائم.",
                      "يمكنه أن يطلب بواسطة إنابة قضائية من أي نيابة عامة أخرى القيام بما يراه لازما من أعمال البحث، مع مراعاة وحدة الأبحاث والتحريات التي تباشرها الفرق الوطنية والفرق الجهوية للشرطة القضائية.",
                      "يحق لوكيل الملك، لضرورة تطبيق مسطرة التسليم، إصدار أوامر دولية بالبحث وإلقاء القبض.",
                      "كما له أن يأمر بنشر برقيات البحث على الصعيد الوطني في حق الأشخاص المشتبه في ارتكابهم جنحا معاقب عليها بعقوبات حبسية أو لضرورة تنفيذ مقررات قضائية بعقوبات سالبة للحرية أو في إطار الإكراه البدني.",
                      "تلغى برقية البحث بقوة القانون بمجرد إلقاء القبض على الشخص المبحوث عنه أو تقادم الجرائم أو العقوبات المنشورة بسببها، وتسهر النيابة العامة، تلقائيا أو بناء على طلب من له مصلحة في ذلك، على تنفيذ هذه المقتضيات بعد التحقق من شروط إلغاء برقية البحث، ويتم إشعار الشرطة القضائية المعنية بالإلغاء.",
                      "يحيل ما يتلقاه من محاضر وشكايات ووشايات وما يتخذه من إجراءات بشأنها، إلى هيئات التحقيق أو إلى هيئات الحكم المختصة أو يأمر بحفظها بقرار يمكن دائما التراجع عنه.",
                      "يقدم لتلك الهيئات ملتمسات بقصد القيام بإجراءات التحقيق.",
                      "يحق لوكيل الملك أن يأمر، بمناسبة سير البحث، بوضع المشتبه فيه تحت المراقبة القضائية وفق الضوابط المحددة في المادة 161 وما يليها من هذا القانون.",
                      "يقوم وكيل الملك بإشعار المحامي، وعند الاقتضاء الضحية أو المشتكي، بالمآل وبالإجراءات المتخذة في الشكايات داخل أجل أقصاه خمسة عشر يوما من تاريخ اتخاذ القرار.",
                      "يتعين لهذه الغاية على المحامين، وعند الاقتضاء على الضحايا والمشتكين، أن يضمنوا شكاياتهم أرقام الهاتف الخاصة بهم أو عناوينهم الإلكترونية بالإضافة إلى عناوين إقامتهم، ويتعين أيضا الإدلاء بنفس المعطيات في محاضر الاستماع إلى الضحايا والمشتكين.",
                      "يتعين على وكيل الملك إذا قرر حفظ الشكاية، أن يخبر المشتكي أو دفاعه بذلك خلال خمسة عشر يوما تبتدئ من تاريخ اتخاذه قرار الحفظ.",
                      "يمكن التظلم من قرار الحفظ المتخذ من طرف وكيل الملك أو أحد نوابه أمام الوكيل العام للملك لدى محكمة الاستئناف التي يتبع لها ترابيا.",
                      "يطالب وكيل الملك بتطبيق العقوبات والتدابير الوقائية وتدابير الحراسة المؤقتة وتدابير الحماية والتهذيب في حق الأحداث المقررة في القانون، ويقدم باسم القانون جميع المطالب التي يراها صالحة، وعلى المحكمة أن تشهد بها عليه بتضمينها في محضرها وأن تبت في شأنها.",
                      "يستعمل عند الاقتضاء وسائل الطعن ضد ما يصدر من مقررات وفق الشروط والإجراءات المحددة قانونا."
                    ]
                  },
                  {
                    "number": "40-1",
                    "paragraphs": [
                      "يجوز لوكيل الملك، إذا تعلق الأمر بانتزاع حيازة بعد تنفيذ مقرر قضائي، أن يأمر باتخاذ أي إجراء تحفظي يراه ملائما لحماية الحيازة وإرجاع الحالة إلى ما كانت عليه. ويقبل هذا الأمر التنفيذ فورا على أن يعرض الأمر على المحكمة أو هيئة التحقيق التي رفعت إليها القضية أو التي سترفع إليها لتأييده أو تعديله أو إلغائه.",
                      "يحق له إذا تعلق الأمر بجريمة من الجرائم التي تمس بحق الملكية العقارية، أن يتقدم بطلب إلى رئيس المحكمة الابتدائية لإصدار أمر بعقل العقار المرتبط بالفعل الجرمي في إطار الأوامر المبنية على طلب، ويقبل هذا الأمر الطعن بالاستئناف داخل أجل ثمانية أيام من تاريخ تبليغه، ولا يوقف الطعن وأجله التنفيذ.",
                      "لا يقبل القرار الصادر عن محكمة الاستئناف أي طعن.",
                      "يترتب عن الأمر الصادر بالعقل منع التصرف في العقار طيلة مدة سريان مفعوله، ويكون كل تصرف بعوض أو بدون عوض مع وجود العقل باطلا وعديم الأثر، ما لم يتم رفع العقل من طرف رئيس المحكمة بصفته قاضيا للمستعجلات بناء على طلب من النيابة العامة أو من له مصلحة.",
                      "يجوز لوكيل الملك في حالة عدم وجود منازعة جدية أو عدم توفر وسائل إثبات كافية أن يأمر برد الأشياء والأدوات ووسائل النقل أو الإنتاج التي ضبطت أثناء البحث لمن له الحق فيها مع تكليفه عند الاقتضاء بحراستها واتخاذ كافة التدابير لمنع تفويتها ما لم تكن لازمة لسير الدعوى أو خطيرة.",
                      "يسهر على تنفيذ أوامر قاضي التحقيق وقضاء الأحداث ومقررات هيئات الحكم.",
                      "يحق له كلما تعلق الأمر بجنحة يعاقب عليها بسنتين حبسا أو أكثر، إذا اقتضت ذلك ضرورة البحث، سحب جواز سفر الشخص المشتبه فيه وإغلاق الحدود في حقه لمدة لا تتجاوز شهرا واحدا. ويمكن تمديد هذا الأجل إلى غاية انتهاء البحث، إذا كان الشخص المعني بالأمر هو المتسبب في تأخير إتمامه.",
                      "يمكن لوكيل الملك تمديد الأجل المشار إليه في الفقرة السابعة من هذه المادة مرتين لمدة شهر واحد إذا اقتضت ضرورة البحث ذلك، كلما تعلق الأمر بالجرائم المنصوص عليها في المادة 108 من هذا القانون.",
                      "ينتهي مفعول إجراءي إغلاق الحدود وسحب جواز السفر في كل الأحوال، بإحالة القضية على هيئة الحكم أو التحقيق أو باتخاذ قرار بحفظ القضية، ويوضع حد لإغلاق الحدود ويرد جواز السفر إلى المعني بالأمر فور انتهاء مفعول الإجراءين بقوة القانون.",
                      "يسهر وكيل الملك على تنفيذ هذين الإجراءين.",
                      "يأمر وكيل الملك بإجراء بحث مالي موازي في الجرائم التي يشتبه في كونها تدر عائدات مالية لتحديد الأموال والممتلكات والمتحصلات ومصدرها وتاريخ تملكها وعلاقتها بالجريمة. وله أن يأمر بحجز جميع الأموال والممتلكات التي يشتبه في كونها متحصلة من الجريمة حتى وإن كانت بيد شخص آخر مع مراعاة حقوق الغير حسن النية.",
                      "لا يمكن أن يشمل الحجز الأشياء والأموال والممتلكات التي لا علاقة لها بالجريمة ولا سيما الأجور والمعاشات المكتسبة قانونا والتركات والأموال المكتسبة قبل تاريخ ارتكاب الجريمة والتي لم يثبت أن لها علاقة بها. ويتعين على وكيل الملك اتخاذ كافة الإجراءات والتدابير اللازمة لمنع تأثير الإجراءات المتعلقة بحجز الأموال أو تجميد الحسابات أو عقل الممتلكات على الأنشطة الاقتصادية والاجتماعية المرتبطة بها، وكذا على الوضع القانوني للأشخاص، سواء كانوا أشخاصا ذاتيين أو اعتباريين.",
                      "يمكن لوكيل الملك تلقائيا أو بناء على طلب ممن له المصلحة في ذلك أن يأمر بمقرر معلل، برفع الحجز أو التجميد أو العقل عن الأشياء والأموال والممتلكات التي ثبت أن لا علاقة لها بالجريمة أو أنها تتعلق بحقوق الغير حسن النية.",
                      "يتعين على وكيل الملك أن يصدر قراره بشأن طلب رفع الحجز أو التجميد داخل أجل عشرة أيام من تاريخ تقديم الطلب، مع إشعار صاحبه بذلك. ويحق لهذا الأخير أن يطعن في قرار وكيل الملك أمام رئيس المحكمة في حالة رفض الطلب أو في حالة انصرام أجل عشرة أيام من تاريخ تقديمه دون صدور قرار عن وكيل الملك.",
                      "يقدم الطعن إلى كتابة النيابة العامة المختصة، ويجب على هذه الأخيرة إحالة الملف على رئيس المحكمة مشفوعا برأي النيابة العامة داخل أجل ثلاثة أيام من تاريخ التصريح بالطعن.",
                      "ويبت رئيس المحكمة داخل أجل عشرة أيام من تاريخ إيداعه بكتابة الضبط، ولا يقبل القرار الصادر في هذا الشأن أي طعن."
                    ]
                  },
                  {
                    "number": "41",
                    "paragraphs": [
                      "يعتبر الصلح بديلا عن الدعوى العمومية إذا توفرت شروط إقامتها، ولا يمس بقرينة البراءة.",
                      "يمكن للمتضرر أو للمشتكى به أو لكليهما، قبل إقامة الدعوى العمومية، أن يطلب من وكيل الملك تضمين الصلح الحاصل بينهما في محضر.",
                      "يمكن لوكيل الملك إذا بدت له أدلة كافية لإقامة الدعوى العمومية وقبل تحريكها، أن يقترح الصلح على الطرفين ويسعى إلى تحقيقه بينهما أو يمهلهما لإجرائه.",
                      "كما يمكن لوكيل الملك أن يقترح الصلح بالوساطة على الطرفين قبل تحريك الدعوى العمومية، تلقائيا أو بناء على طلب من أحدهما، يعهد به إلى وسيط أو أكثر يقترحه الأطراف أو يختاره وكيل الملك أو يعهد به إلى محامي الطرفين، ويمكنه أيضا أن يستعين بخدمات مكتب المساعدة الاجتماعية بالمحكمة."
                    ]
                  },
                  {
                    "number": "41-1",
                    "paragraphs": [
                      "لا يمكن سلوك مسطرة الصلح إلا إذا تعلق الأمر بجنحة يعاقب عليها بسنتين حبسا أو أقل وبغرامة لا يتجاوز حدها الأقصى مائة ألف درهم أو بإحدى هاتين العقوبتين فقط، أو بجنحة من الجنح المنصوص عليها في الفصول 401 و404 (البند 1) و425 و426 و441 (الفقرة الثانية) و445 و1-447 و2-447 و3-447 و505 و517 و520 و523 و524 و525 و526 و538 و540 و542 و547 و549 (البندين الأخيرين) و553 (الفقرة الأولى) و571 من مجموعة القانون الجنائي، والمادة 316 من مدونة التجارة، أو إذا نص القانون صراحة على ذلك بالنسبة لجرائم أخرى.",
                      "إذا تراضى الطرفان على الصلح، فإنه يحرر محضر بذلك بحضورهما وحضور محاميهما عند الاقتضاء، ما لم يتنازلا أو يتنازل أحدهما عن ذلك، ويوقع إلى جانبهما وكيل الملك.",
                      "يتضمن محضر الصلح ما اتفق عليه الطرفان، وعند الاقتضاء أداء المشتكى به غرامة لا تتجاوز نصف الحد الأقصى للغرامة المقررة قانونا للجريمة.",
                      "إذا لم يحضر المتضرر أمام وكيل الملك، وتبين من وثائق الملف وجود تنازل مكتوب صادر عنه، أو في حالة عدم وجود مشتك، يمكن لوكيل الملك أن يقترح على المشتكى به أو المشتبه فيه صلحا يتمثل في أداء غرامة لا تتجاوز نصف الحد الأقصى للغرامة المقررة للجريمة أو إصلاح الضرر الناتج عن أفعاله، وفي حالة موافقته، يحرر وكيل الملك محضرا يتضمن ما تم الاتفاق عليه، ويوقع وكيل الملك والمعني بالأمر على المحضر.",
                      "يتحقق وكيل الملك من تنفيذ اتفاق الصلح.",
                      "توقف مسطرة الصلح في الحالتين المشار إليهما في هذه المادة إقامة الدعوى العمومية. ويمكن لوكيل الملك إقامتها في حالة عدم تنفيذ الالتزامات التي تعهد بها المشتكى به أو إذا ظهرت عناصر جديدة تمس الدعوى العمومية، ما لم تكن هذه الأخيرة قد سقطت بأحد أسباب السقوط.",
                      "تتوقف مدة تقادم الدعوى العمومية بكل إجراء يرمي إلى إجراء الصلح أو إلى تنفيذه."
                    ]
                  },
                  {
                    "number": "42",
                    "paragraphs": [
                      "يجب على كل سلطة منتصبة وعلى كل موظف بلغ إلى علمه أثناء ممارسته لمهامه ارتكاب جريمة، أن يخبر بذلك فورا وكيل الملك أو الوكيل العام للملك وأن يوجه إليه جميع ما يتعلق بالجريمة من معلومات ومحاضر ووثائق."
                    ]
                  },
                  {
                    "number": "43",
                    "paragraphs": [
                      "يجب أيضا على كل من شاهد ارتكاب جريمة تمس بالأمن العام أو بحياة شخص أو أمواله أن يبلغ وكيل الملك أو الوكيل العام للملك أو الشرطة القضائية.",
                      "إذا كان الضحية امرأة أو قاصرا أو شخصا مسنا أو في وضعية إعاقة، تبلغ أي سلطة قضائية أو إدارية مختصة."
                    ]
                  },
                  {
                    "number": "44",
                    "paragraphs": [
                      "يرجع الاختصاص المحلي إما لوكيل الملك في مكان ارتكاب الجريمة، وإما لوكيل الملك في محل إقامة أحد الأشخاص المشتبه في مشاركته في ارتكابها، وإما لوكيل الملك في مكان إلقاء القبض على أحد هؤلاء الأشخاص ولو تم إلقاء القبض لسبب آخر، وإما لوكيل الملك الذي توجد في دائرة نفوذه المؤسسة السجنية المعتقل بها أحد الأشخاص المشار إليهم في هذه المادة.",
                      "إذا تعلق الأمر بشخص اعتباري، فإن الاختصاص المحلي يرجع لوكيل الملك الذي يوجد في دائرة نفوذه مكان ارتكاب الجريمة أو المقر الاجتماعي للشخص الاعتباري.",
                      "إذا تعلق الأمر بأشخاص ذاتيين مع أشخاص اعتباريين، فإن الاختصاص المحلي يرجع لوكيل الملك المختص بالنظر في دعوى الأشخاص الذاتيين."
                    ]
                  },
                  {
                    "number": "45",
                    "paragraphs": [
                      "يسير وكيل الملك في دائرة نفوذ محكمته أعمال ضباط الشرطة القضائية ويقوم بتنقيطهم في نهاية كل سنة.",
                      "يوجه وكيل الملك لائحة التنقيط إلى الوكيل العام للملك قصد إبداء وجهة نظره وإحالتها على السلطة المشرفة إداريا على ضباط الشرطة القضائية. ويؤخذ هذا التنقيط بعين الاعتبار من أجل التقييم العام للمعني بالأمر.",
                      "تحدد معايير تنقيط ضباط الشرطة القضائية بقرار لرئيس النيابة العامة بعد استطلاع رأي الجهة المشرفة إداريا عليهم.",
                      "يقوم الوكيل العام للملك لدى محكمة الاستئناف بتنقيط ضباط الفرقة الوطنية أو الجهوية للشرطة القضائية التي يقع بدائرته مقرها. ويمكن لهذه الغاية لجميع الوكلاء العامين للملك أن يرفعوا إليه تلقائيا ملاحظاتهم حول أداء ضباط الفرقة الذين سبق أن أجروا أبحاثا تحت إشرافهم خلال السنة.",
                      "يسهر وكيل الملك على احترام إجراءات الحراسة النظرية وآجالها وعلى مباشرتها في الأماكن المعدة لهذه الغاية الموجودة في دائرة نفوذه. كما يسهر على احترام التدابير الكفيلة باحترام أنسنة ظروف الاعتقال.",
                      "يتعين عليه أن يقوم بزيارة هذه الأماكن في أي وقت شاء ومتى دعت الضرورة لذلك، دون أن تقل هذه الزيارة عن مرتين في الشهر، وعليه أيضا مراقبة سجلات الحراسة النظرية.",
                      "ويتعين عليه كذلك أن يقوم بهذه الزيارة أو يكلف أحد نوابه بذلك إذا بلغ باعتقال تعسفي أو عمل تحكمي أو ادعاء التعذيب.",
                      "يحرر تقريرا بمناسبة كل زيارة يقوم بها يضمنه ملاحظاته وما يعاينه من إخلالات، ويرفعه إلى الوكيل العام للملك.",
                      "يتخذ الوكيل العام للملك التدابير والإجراءات الكفيلة بوضع حد للإخلالات ويرفع تقريرا بذلك إلى رئيس النيابة العامة."
                    ]
                  },
                  {
                    "number": "46",
                    "paragraphs": [
                      "إذا حدث لوكيل الملك مانع فيخلفه نائبه، وإذا تعدد النواب فيخلفه النائب المعين من قبله.",
                      "إذا تغيب جميع ممثلي النيابة العامة أو حدث لهم مانع، فإن الوكيل العام للملك ينتدب أحد نوابه أو أحد قضاة النيابة العامة بالدائرة القضائية لمحكمة الاستئناف ليقوم بجميع اختصاصات النيابة العامة مؤقتا، إن اقتضت ضرورة العمل ذلك، على أن يشعر بذلك رئيس النيابة العامة فورا."
                    ]
                  },
                  {
                    "number": "47",
                    "paragraphs": [
                      "إذا تعلق الأمر بالتلبس بجنحة طبقا للمادة 56 أدناه، فإن وكيل الملك يقوم باستنطاق المشتبه فيه. ويمكنه مع مراعاة مقتضيات المادة 74 أدناه أن يصدر أمرا بالإيداع في السجن، إذا كانت الجنحة يعاقب عليها بالحبس.",
                      "يستعين وكيل الملك بترجمان أو بكل شخص يحسن التخاطب أو التفاهم مع من يقع استنطاقه عند الاقتضاء.",
                      "إذا صدر الأمر بالإيداع في السجن، فإن القضية تحال إلى أول جلسة مناسبة تعقدها المحكمة الابتدائية، حسب الشروط المنصوص عليها في المادة 385 من هذا القانون.",
                      "في حالة عدم إصدار أمر بالإيداع في السجن، فإن وكيل الملك يحيل القضية إلى المحكمة إما طبقا للفقرة السابقة أو طبقا للشروط المحددة في الكتاب الثاني من هذا القانون المتعلق بالحكم في الجرائم."
                    ]
                  },
                  {
                    "number": "47-1",
                    "paragraphs": [
                      "يمكن لوكيل الملك في غير حالة التلبس بجنحة، إذا تبين له أن تدابير المراقبة القضائية المنصوص عليها في المادة 161 من هذا القانون غير كافية، أو أن مثول المشتبه فيه أمام المحكمة في حالة سراح من شأنه التأثير على حسن سير العدالة، أن يطبق في حقه المسطرة المنصوص عليها في المادة 47 أعلاه في حالة توفر أحد الأسباب التالية:",
                      "1- إذا اعترف بالأفعال المكونة لجريمة يعاقب عليها بالحبس أو ظهرت علامات أو أدلة قوية على ارتكابه لها أو مشاركته فيها، ولا تتوفر فيه ضمانات كافية للحضور؛",
                      "2- إذا ظهر أنه خطير على النظام العام أو على سلامة الأشخاص أو الأموال؛",
                      "3- إذا كان الأمر يتعلق بأفعال خطيرة، أو إذا كان حجم الضرر الذي أحدثته الجريمة جسيما؛",
                      "4- إذا كانت الوسيلة المستعملة في ارتكاب الفعل خطيرة.",
                      "وفي جميع الحالات يعلل وكيل الملك قراره."
                    ]
                  },
                  {
                    "number": "47-2",
                    "paragraphs": [
                      "يمكن للمتهم أو لدفاعه الطعن في الأمر بالإيداع في السجن الصادر عن وكيل الملك بمقتضى المادتين 47 و47-1 أعلاه، أمام هيئة الحكم التي ستبت في القضية، وفي حالة تعذر ذلك أمام هيئة للحكم تتألف من ثلاثة قضاة تتشكل لهذه الغاية، إلى غاية اليوم الموالي لصدور الأمر المذكور.",
                      "يتم هذا الطعن في صيغة تصريح يقدم إلى كتابة الضبط التي تبلغه فورا إلى وكيل الملك.",
                      "يكون التصريح صحيحا إذا تلقته كتابة الضبط للمؤسسة السجنية التي يجب عليها أن تقيده حالا في سجل خاص، وعلى رئيس المؤسسة أن يقوم بتوجيه هذا التصريح إلى كتابة الضبط بالمحكمة فورا ويشعر النيابة العامة بذلك.",
                      "تتم الإحالة فورا إلى هيئة الحكم المشار إليها في الفقرة الأولى من هذه المادة، ويتعين عليها أن تبت في الطعن داخل أجل يوم واحد من تاريخ إحالته إليها. ويمدد هذا الأجل إلى أول يوم عمل إذا صادف يوم عطلة.",
                      "يبقى المعني بالأمر في حالة اعتقال إلى حين بت الهيئة المذكورة.",
                      "تتحقق الهيئة من توفر الشروط التي استند إليها الأمر بالإيداع والمنصوص عليها في المادتين 47 و47-1 أعلاه، وتأمر في حالة عدم توفرها برفع حالة الاعتقال بمقتضى مقرر قضائي مستقل.",
                      "يكون هذا المقرر قابلا للطعن بالاستئناف من طرف النيابة العامة أو المتهم بحسب الأحوال داخل أجل أربع وعشرين ساعة. ولا يحول الحكم بالرفض دون تقديم طلب الإفراج المؤقت لاحقا.",
                      "إذا قدمت النيابة العامة استئنافها يبقى المتهم في حالة اعتقال إلى أن يبت في هذا الاستئناف. تحال نسخة طبق الأصل من وثائق الملف، وبأي وسيلة اتصال أو وسيلة تقنية تترك أثرا كتابيا، على غرفة الجنح الاستئنافية خلال اليوم الموالي لصدور المقرر، وتبت هذه الأخيرة داخل أجل أربع وعشرين ساعة من يوم التوصل بملف الطعن.",
                      "تبت المحكمة في الطلبات المقدمة وفق هذه المادة دون حاجة لحضور المتهم.",
                      "لا يكون للاستئناف ولا للمسطرة الموالية أي أثر موقف على سير الدعوى العمومية، وتتابع المحكمة مناقشتها في الجوهر."
                    ]
                  }
                ]
              },
              {
                "name": "الفرع الثالث",
                "title": "اختصاصات الوكيل العام للملك لدى محكمة الاستئناف",
                "articles": [
                  {
                    "number": "48",
                    "paragraphs": [
                      "يمثل النيابة العامة أمام محكمة الاستئناف الوكيل العام للملك شخصيا بوصفه رئيسا للنيابة العامة أو بواسطة نوابه.",
                      "إذا حدث للوكيل العام للملك مانع، فيخلفه نائب الوكيل العام للملك المعين من قبله."
                    ]
                  },
                  {
                    "number": "49",
                    "paragraphs": [
                      "يتولى الوكيل العام للملك السهر على تطبيق القانون الجنائي في مجموع دائرة نفوذ محكمة الاستئناف.",
                      "يمارس سلطته على جميع قضاة النيابة العامة التابعين لدائرة نفوذه وكذا على ضباط وأعوان الشرطة القضائية وعلى الموظفين القائمين بمهام الشرطة القضائية استنادا إلى المادة 17 أعلاه.",
                      "وله أثناء ممارسة مهامه، الحق في تسخير القوة العمومية مباشرة.",
                      "يتلقى الشكايات والوشايات والمحاضر الموجهة إليه ويتخذ بشأنها ما يراه ملائما من الإجراءات أو يرسلها مرفقة بتعليماته إلى وكيل الملك المختص.",
                      "غير أنه إذا تعلق الأمر بوشايات مجهولة المصدر، فإنه يتعين قبل الإذن بمباشرة الأبحاث بشأنها القيام بالتحريات الأولية للتأكد من جديتها.",
                      "يقوم بإشعار المحامي، وعند الاقتضاء الضحية أو المشتكي، بالمآل وبالإجراءات المتخذة في الشكايات بما فيها قرار الحفظ، داخل أجل أقصاه خمسة عشر يوما من تاريخ اتخاذ القرار.",
                      "يتعين لهذه الغاية على المحامين، وعند الاقتضاء على الضحايا والمشتكين، أن يضمنوا شكاياتهم أرقام الهاتف الخاصة بهم أو عناوينهم الإلكترونية بالإضافة إلى عناوين إقامتهم، ويتعين أيضا الإدلاء بنفس المعطيات في محاضر الاستماع إليهم.",
                      "يمكن التظلم من قرار الحفظ المتخذ من طرف الوكيل العام للملك أو أحد نوابه أمام الوكيل العام للملك لدى محكمة النقض بصفته رئيسا للنيابة العامة.",
                      "يباشر الوكيل العام للملك أو يأمر بمباشرة الإجراءات الضرورية للبحث عن مرتكبي الجنايات وضبطهم وتقديمهم ومتابعتهم.",
                      "يمكن للوكيل العام للملك لضرورة البحث إذا ما عرضت عليه مسألة تقنية أو فنية أن يستعين بذوي الخبرة والمعرفة. ويمكنه بصفة خاصة أن يأمر بإجراء خبرة لتحديد فصيلة البصمات البيولوجية والجينية للأشخاص المشتبه فيهم الذين توجد قرائن على تورطهم في ارتكاب إحدى الجرائم.",
                      "يمكن للوكيل العام للملك أن يطلب بواسطة إنابة قضائية من أي نيابة عامة أخرى، القيام بما يراه لازما من أعمال البحث، مع مراعاة وحدة الأبحاث والتحريات التي تباشرها الفرق الوطنية والفرق الجهوية للشرطة القضائية.",
                      "يحيل الوكيل العام للملك ما يتلقاه من محاضر وشكايات ووشايات وما يتخذه من إجراءات، إلى هيئات التحقيق أو هيئات الحكم المختصة، أو يأمر بحفظها بقرار يمكن دائما التراجع عنه.",
                      "يقدم لتلك الهيئات ملتمسات بقصد القيام بإجراءات التحقيق.",
                      "يحق للوكيل العام للملك أن يأمر بمناسبة سير البحث بوضع المشتبه فيه تحت المراقبة القضائية وفقا للضوابط المنصوص عليها في المادة 161 وما يليها من هذا القانون.",
                      "خلافا للقواعد المنظمة للاختصاص النوعي، يمكن للوكيل العام للملك كلما تعلق الأمر بجناية وكان الضرر الناجم عنها محدودا، أو كانت قيمة الحق المعتدى عليه بسيطة، أن يحيل القضية إلى وكيل الملك المختص لإجراء المتابعة بشأنها بوصفها جنحة، وتتقيد المحكمة التي تحال عليها القضية بمناقشتها وفق الوصف المحدد في المتابعة بعد التحقق من توفر الشرطين المتعلقين بحجم الضرر الناجم وقيمة الحق المعتدى عليه.",
                      "يحق للوكيل العام للملك لضرورة تطبيق مسطرة تسليم المجرمين إصدار أوامر دولية بالبحث وإلقاء القبض. كما له أن يأمر بنشر برقيات البحث على الصعيد الوطني في حق الأشخاص المشتبه في ارتكابهم جرائم أو لضرورة تنفيذ مقررات قضائية بعقوبات سالبة للحرية.",
                      "تلغى برقيات البحث بقوة القانون بمجرد إلقاء القبض على الشخص المبحوث عنه أو تقادم الجرائم أو العقوبات المنشورة بسببها، وتسهر النيابة العامة على تنفيذ هذه المقتضيات بعد التحقق من شروط إلغاء برقية البحث، ويتم إشعار الشرطة القضائية المعنية بالإلغاء.",
                      "يطالب الوكيل العام للملك بتطبيق العقوبات والتدابير الوقائية وتدابير الحماية والتهذيب في حق الأحداث المقررة في القانون ويقدم جميع المطالب التي يراها صالحة، وعلى محكمة الاستئناف أن تشهد بها عليه بتضمينها في محضرها وأن تبت بشأنها.",
                      "يستعمل عند الاقتضاء وسائل الطعن ضد ما يصدر من مقررات وفق الشروط والإجراءات المحددة قانونا."
                    ]
                  },
                  {
                    "number": "1-49",
                    "paragraphs": [
                      "يجوز للوكيل العام للملك، إذا تعلق الأمر بانتزاع حيازة بعد تنفيذ مقرر قضائي، أن يأمر باتخاذ أي إجراء تحفظي يراه ملائما لحماية الحيازة وإرجاع الحالة إلى ما كانت عليه، على أن يعرض هذا الأمر على المحكمة أو هيئة التحقيق التي رفعت إليها القضية أو التي سترفع إليها لتأييده أو تعديله أو إلغائه.",
                      "يحق له إذا تعلق الأمر بجريمة من الجرائم التي تمس بحق الملكية العقارية، أن يتقدم بطلب إلى الرئيس الأول لمحكمة الاستئناف لإصدار أمر بعقل العقار، ويقبل هذا الأمر الطعن بالاستئناف أمام غر��ة المشورة داخل أجل ثمانية أيام من تاريخ تبليغه، ولا يوقف الطعن وأجله التنفيذ.",
                      "لا يقبل القرار الصادر عن غرفة المشورة أي طعن.",
                      "يترتب عن الأمر الصادر بالعقل منع التصرف في العقار طيلة مدة سريان مفعوله، ويكون كل تصرف بعوض أو بدون عوض مع وجود العقل باطلا وعديم الأثر، ويمكن رفعه أمام المحكمة التي أمرت به في إطار القضاء الاستعجالي بناء على طلب من النيابة العامة أو من له مصلحة.",
                      "يجوز له في حالة عدم وجود منازعة جدية أو عدم توفر وسائل إثبات كافية أن يأمر برد الأشياء والأدوات ووسائل النقل أو الإنتاج التي ضبطت أثناء البحث لمن له الحق فيها مع تكليفه عند الاقتضاء بحراستها واتخاذ كافة التدابير لمنع تفويتها ما لم تكن لازمة لسير الدعوى أو خطيرة.",
                      "يسهر على تنفيذ أوامر قاضي التحقيق والمستشار المكلف بالأحداث والمقررات القضائية لهيئات الحكم.",
                      "يحق له إذا تعلق الأمر بجناية أو جنحة مرتبطة بها يعاقب عليها القانون بسنتين حبسا أو أكثر، إذا اقتضت ذلك ضرورة البحث، سحب جواز سفر الشخص المشتبه فيه وإغلاق الحدود في حقه لمدة لا تتجاوز شهرا واحدا. ويمكن تمديد هذا الأجل إلى غاية انتهاء البحث إذا كان الشخص المعني بالأمر هو المتسبب في تأخير إتمامه.",
                      "يمكن للوكيل العام للملك تمديد الأجل المشار إليه في الفقرة السابقة مرتين لمدة شهر واحد إذا اقتضت ضرورة البحث ذلك كلما تعلق الأمر بالجرائم المنصوص عليها في المادة 108 من هذا القانون.",
                      "إذا تعلق الأمر بجرائم إرهابية، فإن مدة سحب جواز سفر الشخص المشتبه فيه وإغلاق الحدود في حقه تكون ستة أشهر قابلة للتمديد مرة واحدة، ويمكن تمديد هذا الأجل إلى غاية انتهاء البحث إذا كان الشخص المعني هو المتسبب في تأخير إتمامه.",
                      "ينتهي مفعول إجراءي إغلاق الحدود وسحب جواز السفر في كل الأحوال بإحالة القضية على هيئة الحكم أو التحقيق المختصة أو باتخاذ قرار بحفظ القضية، ويوضع حد لإغلاق الحدود ويرد جواز السفر إلى المعني بالأمر فور انتهاء مفعول الإجراءين بقوة القانون.",
                      "يسهر الوكيل العام للملك على تنفيذ هذين الإجراءين.",
                      "تطبق مقتضيات المادة 73 أدناه إذا تعلق الأمر بالتلبس بالجناية والجنح المرتبطة بها.",
                      "يأمر الوكيل العام للملك بإجراء بحث مالي موازي في الجرائم التي يشتبه في كونها تدر عائدات مالية لحصر الأموال والممتلكات والمتحصلات وتحديد مصدرها وتاريخ تملكها وعلاقتها بالجريمة. وله أن يأمر بحجز جميع الأموال والممتلكات التي يشتبه في كونها متحصلة من الجريمة حتى وإن كانت بيد شخص آخر مع مراعاة حقوق الغير حسن النية.",
                      "لا يمكن أن يشمل الحجز الأشياء والأموال والممتلكات التي لا علاقة لها بالجريمة ولاسيما الأجور والمعاشات المكتسبة قانونا والتركات والأموال المكتسبة قبل تاريخ ارتكاب الجريمة والتي لم يثبت أن لها علاقة بها، ويتعين على الوكيل العام للملك اتخاذ كافة الإجراءات والتدابير اللازمة لمنع تأثير الإجراءات المتعلقة بحجز الأموال أو تجميد الحسابات أو عقل الممتلكات على الأنشطة الاقتصادية والاجتماعية المرتبطة بها، وكذا على الوضع القانوني للأشخاص، سواء كانوا أشخاصا ذاتيين أو اعتباريين.",
                      "يمكن للوكيل العام للملك تلقائيا أو بناء على طلب ممن له المصلحة في ذلك أن يأمر بمقرر معلل، برفع الحجز أو التجميد أو العقل عن الأشياء والأموال والممتلكات التي ثبت أن لا علاقة لها بالجريمة أو أنها تتعلق بحقوق الغير حسن النية.",
                      "يتعين على الوكيل العام للملك أن يصدر قراره بشأن طلب رفع الحجز أو التجميد داخل أجل عشرة أيام من تاريخ تقديم الطلب، مع إشعار صاحبه بذلك، ويحق لهذا الأخير أن يطعن في قرار الوكيل العام للملك أمام الرئيس الأول لمحكمة الاستئناف في حالة رفض الطلب أو في حالة انصرام أجل عشرة أيام من تاريخ تقديمه دون صدور قرار عن الوكيل العام للملك.",
                      "يقدم الطعن إلى كتابة النيابة العامة المختصة، ويجب على هذه الأخيرة إحالة الملف على الرئيس الأول مشفوعا برأي النيابة العامة داخل أجل ثلاثة أيام من تاريخ التصريح بالطعن.",
                      "ويبت الرئيس الأول داخل أجل عشرة أيام من تاريخ إيداعه بكتابة الضبط، ولا يقبل القرار الصادر في هذا الشأن أي طعن."
                    ]
                  },
                  {
                    "number": "50",
                    "paragraphs": [
                      "يختص الوكيل العام للملك محليا، طبقا لمقتضيات المادة 44 من هذا القانون."
                    ]
                  }
                ]
              },
              {
                "name": "الفرع الرابع",
                "title": "الوكيل العام للملك لدى محكمة النقض",
                "articles": [
                  {
                    "number": "51",
                    "paragraphs": [
                      "يمثل النيابة العامة أمام محكمة النقض الوكيل العام للملك لدى محكمة النقض شخصيا أو بواسطة المحامي العام الأول أو المحامين العامين.",
                      "يمارس الوكيل العام للملك سلطته على المحامي العام الأول وعلى جميع المحامين العامين التابعين لمحكمة النقض.",
                      "إذا حدث للوكيل العام للملك لدى محكمة النقض مانع، فيخلفه المحامي العام الأول، كما يمكن أن يخلفه أحد المحامين العامين المعينين من قبله.",
                      "يمارس الوكيل العام للملك الطعون المخولة له بموجب التشريع الجاري به العمل.",
                      "يمارس كذلك كل المهام والاختصاصات المخولة له بمقتضى هذا القانون أو بمقتضى نصوص أخرى."
                    ]
                  }
                ]
              },
              {
                "name": "الفرع الخامس",
                "title": "السياسة الجنائية",
                "articles": [
                  {
                    "number": "1-51",
                    "paragraphs": [
                      "يقصد بالسياسة الجنائية ذلك الجزء من السياسات العمومية التي تشمل قواعد وتدابير تتخذها الدولة في مجال مكافحة الجريمة والوقاية منها.",
                      "يشرف رئيس النيابة العامة على تنفيذ السياسة الجنائية التي يضعها المشرع، ويبلغ مضامينها للوكلاء العامين للملك لدى محاكم الاستئناف الذين يسهرون على تنفيذها داخل الدوائر القضائية التابعة لنفوذهم وفقا للضوابط المحددة في القانون.",
                      "كما يشرف رئيس النيابة العامة على تنفيذ مضامين وتوجهات السياسة الجنائية المرتبطة بالسياسات العمومية التي تضعها الحكومة ويبلغها إليه وزير العدل.",
                      "يضمن رئيس النيابة العامة الإجراءات والتدابير المتخذة لتنفيذ السياسة الجنائية في التقرير الذي يعده في إطار المادة 110 من القانون التنظيمي رقم 100.13 المتعلق بالمجلس الأعلى للسلطة القضائية."
                    ]
                  },
                  {
                    "number": "2-51",
                    "paragraphs": [
                      "يرأس الوكيل العام للملك لدى محكمة النقض النيابة العامة، ويمارس سلطته على جميع قضاتها في كافة محاكم المملكة.",
                      "يتولى رئيس النيابة العامة السهر على تطبيق التشريع الجنائي في مجموع إقليم المملكة.",
                      "يجب على الوكلاء العامين للملك ووكلاء الملك أن يخبروا رئيس النيابة العامة بما بلغ إلى علمهم من الجرائم الخطيرة أو الأحداث التي من شأنها أن تخل بالأمن العام أو التي تستأثر باهتمام الرأي العام.",
                      "يوجه رئيس النيابة العامة التعليمات القانونية الكتابية إلى الوكلاء العامين للملك ووكلاء الملك، ويبلغهم ما يصل إلى علمه من مخالفات للتشريع الجنائي، كما يمكن أن يأمرهم بتحريك الدعوى العمومية بشأنها أو أن يرفعوا إلى المحكمة المختصة ما يراه ملائما من ملتمسات كتابية."
                    ]
                  },
                  {
                    "number": "3-51",
                    "paragraphs": [
                      "في إطار المساهمة في رسم توجهات السياسة الجنائية، يتولى المرصد الوطني للإجرام المحدث لدى السلطة الحكومية المكلفة بالعدل جمع ومعالجة الإحصاءات الجنائية ودراسة وتحليل الظواهر الإجرامية واقتراح الحلول الكفيلة للتصدي للجريمة والوقاية منها.",
                      "ولهذه الغاية، يطلب المرصد من السلطات القضائية والأمنية والإدارية مده بالمعطيات الإحصائية والمعلومات والوثائق الضرورية ذات الصلة بالمهام المسندة إليه دون المساس بسرية البحث والتحقيق.",
                      "يساعد المرصد الجهات المشار إليها أعلاه على وضع قواعد بيانات والبرمجيات الملائمة للمعطيات الإحصائية التي يحتاجها."
                    ]
                  }
                ]
              }
            ]
          },
          {
            "name": "الباب الرابع",
            "title": "القضاة المكلفون بالتحقيق",
            "articles": [
              {
                "number": "52",
                "paragraphs": [
                  "يعين القضاة المكلفون بالتحقيق في المحاكم الابتدائية ومحاكم الاستئناف من بين قضاة الحكم والمستشارين لمدة ثلاث سنوات قابلة للتجديد من قبل المجلس الأعلى للسلطة القضائية باقتراح من رئيس المحكمة الابتدائية أو الرئيس الأول لمحكمة الاستئناف، حسب الحالة.",
                  "يمكن خلال هذه المدة إعفاؤهم من مهامهم بنفس الكيفية.",
                  "يباشر القضاة المكلفون بالتحقيق مهامهم وفق ما هو منصوص عليه في القسم الثالث بعده.",
                  "لا يمكن لقضاة التحقيق، تحت طائلة البطلان، أن يشاركوا في إصدار حكم في القضايا الزجرية التي سبق أن أحيلت إليهم بصفتهم قضاة مكلفين بالتحقيق."
                ]
              },
              {
                "number": "53",
                "paragraphs": [
                  "إذا لم يوجد في المحكمة عدد كاف من القضاة المكلفين بالتحقيق وحال مانع مؤقت دون ممارستهم لمهامهم، فيمكن لرئيسها، بناء على طلب من النيابة العامة، وفي انتظار زوال المانع أو صدور قرار التعيين، أن يعين أحد قضاة أو مستشاري المحكمة لممارسة هذه المهام."
                ]
              },
              {
                "number": "54",
                "paragraphs": [
                  "لا يمكن لقاضي التحقيق إجراء تحقيق إلا بناء على ملتمس محال إليه من النيابة العامة، أو بناء على شكاية مرفقة بتنصيب المشتكي طرفا مدنيا.",
                  "يحق له عند ممارسته لمهامه أن يسخر القوة العمومية مباشرة.",
                  "يقوم قاضي التحقيق بتفقد المعتقلين الاحتياطيين مرة كل شهر على الأقل."
                ]
              },
              {
                "number": "55",
                "paragraphs": [
                  "يختص قاضي التحقيق محليا، طبقا لمقتضيات المادة 44 من هذا القانون."
                ]
              }
            ]
          }
        ]
      },
      {
        "name": "القسم الثاني",
        "title": "إجراءات البحث",
        "chapters": [
          {
            "name": "الباب الأول",
            "title": "حالة التلبس بالجنايات والجنح",
            "articles": [
              {
                "number": "56",
                "paragraphs": [
                  "تتحقق حالة التلبس بجناية أو جنحة:",
                  "أولاً: إذا ضبط الفاعل أثناء ارتكابه الجريمة أو على إثر ارتكابها؛",
                  "ثانياً: إذا كان الفاعل ما زال مطارداً بصياح الجمهور على إثر ارتكابها؛",
                  "ثالثاً: إذا وجد الفاعل بعد مرور وقت قصير على ارتكاب الفعل حاملاً أسلحة أو أشياء يستدل معها أنه شارك في الفعل الإجرامي، أو وجد عليه أثر أو علامات تثبت هذه المشاركة.",
                  "يعد بمثابة تلبس بجناية أو جنحة، ارتكاب جريمة داخل منزل في ظروف غير الظروف المنصوص عليها في الفقرات السابقة إذا التمس مالك أو ساكن المنزل من النيابة العامة أو من ضابط للشرطة القضائية معاينتها."
                ]
              },
              {
                "number": "57",
                "paragraphs": [
                  "يجب على ضابط الشرطة القضائية الذي أشعر بحالة تلبس بجنحة أو جناية أن يخبر بها النيابة العامة فوراً وأن ينتقل في الحال إلى مكان ارتكابها لإجراء المعاينات المفيدة.",
                  "وعليه أن يحافظ على الأدلة القابلة للاندثار وعلى كل ما يمكن أن يساعد على إظهار الحقيقة وأن يحجز الأسلحة والأدوات التي استعملت في ارتكاب الجريمة أو التي كانت معدة لارتكابها وكذا جميع ما قد يكون ناتجاً عن هذه الجريمة.",
                  "يعرض الأشياء المحجوزة على الأشخاص المشتبه في مشاركتهم في الجناية أو الجنحة قصد التعرف عليها.",
                  "ينجز ضابط الشرطة القضائية بعد إشعار النيابة العامة بحثاً مالياً موازياً لتحديد الأشياء والأموال والممتلكات والمتحصلات ومصدرها وتاريخ تملكها وعلاقتها بالجريمة، ويمكن له أن يحجزها بناء على إذن كتابي من النيابة العامة المختصة متى نتج عن البحث المالي الموازي قرائن كافية على أنها من عائدات الجريمة، حتى وإن كانت بيد شخص آخر مع مراعاة حقوق الغير حسن النية.",
                  "لا يمكن أن ينصب الحجز على الأشياء والأموال والممتلكات التي لا علاقة لها بالجريمة ولاسيما الأجور والمعاشات المستحقة قانوناً والتركات والأموال المكتسبة قبل تاريخ ارتكاب الجريمة والتي لم يثبت أن لها علاقة بها.",
                  "يتولى ضابط الشرطة القضائية البحث عن الآثار والمعالم المتخلفة من الجريمة ويقوم برفعها باعتماد الوسائل التقنية والفنية التي يستلزمها هذا الإجراء. كما يقوم برفع الآثار الرقمية وحجز التسجيلات السمعية البصرية من مكان ارتكاب الجريمة، وله أن يستعين بأشخاص مؤهلين لذلك. كما يمكنه أن يطلب إجراء خبرات عليها وعلى بقية أدوات الجريمة والأشياء التي تم العثور عليها وحجزها بمكان ارتكاب الجريمة أو لدى المشتبه فيهم بارتكابها أو لدى الأشخاص الموجودين بمكان ارتكاب الجريمة أو المشتبه في وجودهم بهذا المكان."
                ]
              },
              {
                "number": "58",
                "paragraphs": [
                  "يمنع على كل شخص غير مؤهل قانوناً أن يغير حالة المكان الذي وقعت فيه الجريمة، أو أن يقوم بإزالة أي شيء منه قبل القيام بالعمليات الأولية للبحث القضائي، وذلك تحت طائلة غرامة تتراوح بين 1.200 و10.000 درهم.",
                  "غير أنه يسمح، بصفة استثنائية، بهذه التغييرات أو هذه الإزالات إذا كانت تفرضها ضرورة المحافظة على السلامة أو الصحة العمومية أو تقديم الإسعافات للضحايا.",
                  "إذا كان القصد من محو الأثر أو إزالة الأشياء هو عرقلة سير العدالة، تكون العقوبة هي الحبس من ثلاثة أشهر إلى ثلاث سنوات وغرامة من 3.000 درهم إلى 12.000 درهم."
                ]
              },
              {
                "number": "59",
                "paragraphs": [
                  "إذا كان نوع الجناية أو الجنحة مما يمكن إثباته بحجز أوراق ووثائق أو أشياء أخرى في حوزة أشخاص يشتبه أنهم شاركوا في الجريمة، أو يحوزون مستندات أو وثائق أو معطيات أو أدوات أو برامج معلوماتية أو أشياء أخرى تتعلق بالأفعال الإجرامية، فإن ضابط الشرطة القضائية ينتقل فوراً إلى منزل هؤلاء الأشخاص ليجري فيه طبقاً للشروط المحددة في المادتين 60 و62 تفتيشاً يحرر محضراً بشأنه.",
                  "وفيما عدا حالات المس بأمن الدولة أو إذا تعلق الأمر بجريمة إرهابية، لا يحق إلا لضابط الشرطة القضائية ومعه الأشخاص المشار إليهم في المادة 60 بعده وحدهم الاطلاع على الأوراق أو المستندات أو الوثائق أو المعطيات أو الأدوات أو البرامج المعلوماتية أو الأشياء الأخرى قبل القيام بحجزها.",
                  "يجري التفتيش في جميع الأماكن والمنقولات التي يمكن أن يعثر بها على مستندات أو وثائق أو معطيات أو أدوات أو برامج معلوماتية أو أشياء أخرى مفيدة في إظهار الحقيقة.",
                  "يتم إجراء تفتيش رقمي بالأجهزة المعلوماتية والأدوات الإلكترونية كلما دعت ضرورة البحث ذلك، وحجز جميع البيانات والأدلة الإلكترونية والآثار الرقمية المفيدة في إظهار الحقيقة بما فيها تلك التي تم فك تشفيرها أو استرجاعها بعد حذفها.",
                  "يمكن، بإذن من النيابة العامة المختصة، أن تكون الأجهزة المعلوماتية ودعامات التخزين المحجوزة موضوع خبرة تقنية من قبل المختبرات المتخصصة في تحليل الآثار الرقمية من أجل استخراج البيانات والأدلة الإلكترونية والآثار الرقمية ذات الصلة بالجرائم موضوع البحث، وذلك بعد الحصول على إذن الولوج طواعية من قبل المشتبه فيه، أو باستعمال برامج معلوماتية تمكن من فك تشفير هذه الأجهزة أو استرجاع البيانات التي تم حذفها.",
                  "إذا تعين إجراء التفتيش في أماكن معدة لاستعمال مهني يشغلها شخص يلزمه القانون بكتمان السر المهني، فعلى ضابط الشرطة القضائية أن يشعر النيابة العامة المختصة وأن يتخذ مسبقاً جميع التدابير لضمان احترام السر المهني.",
                  "إذا كان التفتيش أو الحجز سيجري بمكتب محام، يتولى القيام به قاض من قضاة النيابة العامة بمحضر نقيب المحامين أو من ينوب عنه أو بعد إشعاره بأي وسيلة من الوسائل الممكنة.",
                  "يتم حجز المعطيات والبرامج المعلوماتية الضرورية لإظهار الحقيقة بوضع الدعامات المادية المتضمنة لهذه المعلومات أو بأخذ نسخ منها، بحضور الأشخاص الذين حضروا التفتيش، ويوضع ما تم حجزه رهن إشارة العدالة.",
                  "لا يحجز ضابط الشرطة القضائية إلا المستندات أو الوثائق أو المعطيات أو الأدوات أو البرامج المعلوماتية أو الأشياء الأخرى المفيدة في إظهار الحقيقة.",
                  "يمكن بعد موافقة النيابة العامة حجز كل شيء يتم العثور عليه عرضاً خلال التفتيش وله علاقة بجريمة أخرى.",
                  "يمكن لضباط الشرطة القضائية، بمناسبة إجراء تفتيش وفقاً للشروط المنصوص عليها في هذا القانون، الولوج إلى المعطيات المفيدة في البحث الجاري والمخزنة بنظام معلوماتي يوجد بالمكان الذي يجري فيه التفتيش أو بنظام معلوماتي آخر متصل به.",
                  "تخزن المعطيات التي تم الولوج إليها وفقاً للفقرات السابقة على أي دعامة إلكترونية أو يتم حجز هذه الدعامة ووضعها في غلاف أو وعاء أو كيس ويختم عليها ضابط الشرطة القضائية وفقاً للشروط المنصوص عليها في هذه المادة.",
                  "يمكن لضابط الشرطة القضائية انتداب أي شخص مختص لمساعدته للولوج للمعطيات المذكورة.",
                  "يمكن للوكيل العام للملك أو وكيل الملك، كل فيما يخصه، أن يأمر بالحذف النهائي للمعطيات أو البرامج المعلوماتية الأصلية من الدعامة المادية التي لم توضع رهن إشارة المحكمة بعد أخذ نسخة منها إذا كانت حيازتها أو استعمالها غير مشروع أو كانت تشكل خطراً على أمن الأفراد أو الممتلكات أو منافية للأخلاق العامة. كما يمكن لهما أن يأمرا بإيقاف بث أو حجب نشر معطيات رقمية يشكل مضمونها جريمة، ويحرر محضر بالحذف أو الحجب أو بإيقاف البث يضاف إلى المسطرة.",
                  "تحصى المستندات أو الوثائق أو المعطيات أو الأدوات أو البرامج المعلوماتية أو الأشياء الأخرى المحجوزة فوراً وتلف أو توضع في غلاف أو وعاء أو كيس ويختم عليها ضابط الشرطة القضائية. وإذا استحال ذلك، فإن ضابط الشرطة القضائية يختم عليها بطابعه.",
                  "إذا تعذر إحصاء الأشياء المحجوزة على الفور، فإن ضابط الشرطة القضائية يختم عليها مؤقتاً إلى حين إحصائها والختم النهائي عليها.",
                  "تتم هذه الإجراءات بحضور الأشخاص الذين حضروا التفتيش، ويحرر ضابط الشرطة القضائية محضراً بما قام به من عمليات."
                ]
              },
              {
                "number": "60",
                "paragraphs": [
                  "مع مراعاة مقتضيات المادة 59 أعلاه، تطبق الأحكام التالية:",
                  "أولا: إذا كان التفتيش سيجري بمنزل شخص يشتبه في مشاركته في الجريمة، وجب أن يتم التفتيش بحضور هذا الشخص أو ممثله، فإن تعذر ذلك وجب على ضابط الشرطة القضائية أن يستدعي شاهدين لحضور التفتيش من غير الموظفين الخاضعين لسلطته؛",
                  "ثانيا: إذا كان التفتيش سيجرى في منزل شخص من الغير يحتمل أن يكون في حيازته مستندات أو وثائق أو معطيات أو أدوات أو برامج معلوماتية أو أشياء أخرى لها علاقة بالأفعال الإجرامية، فإنه يجب حضور هذا الشخص لعملية التفتيش، وإذا تعذر ذلك وجب أن يجري التفتيش طبقا لمقتضيات البند الأول من هذه المادة.",
                  "تحضر هذا التفتيش في جميع الأحوال امرأة ينتدبها ضابط الشرطة القضائية لتفتيش النساء في الأماكن التي يوجدن بها.",
                  "وفي جميع الأحوال، يتعين على ضابط الشرطة القضائية اتخاذ الإجراءات المناسبة لإبعاد القاصرين عن حضور عملية التفتيش ما لم يكن القاصر معنيا بالجريمة، وفي هذه الحالة يتعين أن يتم التفتيش بحضور وليه القانوني، وإذا تعذر ذلك، فإنه يجب على ضابط الشرطة القضائية أن يستدعي شاهدين لحضور التفتيش من غير الموظفين الخاضعين لسلطته؛",
                  "ثالثا: يمكن لضابط الشرطة القضائية أن يستدعي أي شخص لسماعه، إذا تبين له أن بوسع هذا الشخص أن يمده بمعلومات حول الأفعال أو المستندات أو الوثائق أو المعطيات أو الأدوات أو البرامج المعلوماتية أو الأشياء الأخرى المحجوزة، وأن يرغمه على الحضور في حالة امتناعه بعد إذن النيابة العامة؛",
                  "رابعا: توقع أو تبصم محاضر العمليات من طرف الأشخاص الذين أجري التفتيش بمنازلهم أو من يمثلهم أو الشاهدين، أو يشار في المحضر إلى امتناعهم عن التوقيع أو الإبصام أو تعذرهما مع بيان سبب ذلك."
                ]
              },
              {
                "number": "1-60",
                "paragraphs": [
                  "يجوز لضابط الشرطة القضائية عند الاقتضاء أن يقوم بإجراء تفتيش جسدي على الأشخاص المشار إليهم في المادتين 59 و60 أعلاه بواسطة أشخاص من جنسهم، وفي ظروف تصان فيها كرامتهم."
                ]
              },
              {
                "number": "61",
                "paragraphs": [
                  "كل إبلاغ أو إفشاء لوثيقة وقع الحصول عليها من تفتيش إلى شخص ليست له صلاحية قانونية للاطلاع عليها، يتم دون موافقة المشتبه فيه أو ذوي حقوقه أو الموقع على الوثيقة أو ممن وجهت إليه، ولو كان ذلك لفائدة البحث، يعاقب عليه بالعقوبات المقررة في مجموعة القانون الجنائي."
                ]
              },
              {
                "number": "62",
                "paragraphs": [
                  "لا يمكن الشروع في تفتيش المنازل أو معاينتها قبل الساعة السادسة صباحا وبعد الساعة التاسعة ليلا، إلا إذا طلب ذلك رب المنزل أو وجهت استغاثة من داخله أو لضبط شخص مبحوث عنه بموجب مذكرة بحث وطنية أو أمر دولي بإلقاء القبض، أو في الحالات الاستثنائية التي ينص عليها القانون.",
                  "غير أن العمليات التي ابتدأت في ساعة قانونية يمكن مواصلتها دون توقف.",
                  "لا تطبق هذه المقتضيات إذا تعين إجراء التفتيش في محلات يمارس فيها عمل أو نشاط ليلي بصفة معتادة.",
                  "إذا تعلق الأمر بجريمة إرهابية واقتضت ذلك ضرورة البحث أو حالة الاستعجال القصوى أو إذا كان يخشى اندثار الأدلة فإنه يمكن الشروع في تفتيش المنازل أو معاينتها بصفة استثنائية قبل الساعة السادسة صباحا أو بعد التاسعة ليلا بإذن كتابي من النيابة العامة."
                ]
              },
              {
                "number": "63",
                "paragraphs": [
                  "يعمل بالإجراءات المقررة في المواد 59 و60 و1-60 و62 أعلاه تحت طائلة بطلان الإجراء المعيب وما قد يترتب عنه من إجراءات."
                ]
              },
              {
                "number": "64",
                "paragraphs": [
                  "إذا تعين القيام بمعاينات لا تقبل التأخير، فلضابط الشرطة القضائية أن يستعين بأي شخص مؤهل لذلك، على أن يعطي رأيه بما يمليه عليه شرفه وضميره."
                ]
              },
              {
                "number": "1-64",
                "paragraphs": [
                  "يمكن، بإذن كتابي من النيابة العامة المختصة، لضابط الشرطة القضائية أن ينتدب أي شخص أو مؤسسة عامة أو خاصة أو أي إدارة عمومية يحوزون معطيات مفيدة في البحث، بما في ذلك المعطيات المخزنة في أي نظام للمعالجة الآلية للمعطيات أو أي نظام معلوماتي آخر، من أجل مده وباستعجال بتلك المعطيات، ولو في شكل إلكتروني.",
                  "لا يمكن بأي حال من الأحوال أن يواجه ضابط الشرطة القضائية بواجب الحفاظ على السر المهني.",
                  "كما يمكن لضابط الشرطة القضائية، ووفق نفس الشكليات، أن يطلب من أي مستغل لشبكة عامة أو مصلحة للاتصالات المشار إليها في القانون المتعلق بالبريد والمواصلات، أن يضع رهن إشارته جميع المعطيات الكفيلة بإظهار الحقيقة، والتي تم الاطلاع عليها من قبل المشتبه فيه مستعمل الخدمات.",
                  "يعاقب بغرامة من 10.000 إلى 50.000 درهم كل من رفض دون عذر مقبول الاستجابة للانتداب الموجه إليه من قبل ضابط الشرطة القضائية.",
                  "يتعين وضع المعطيات المطلوبة رهن إشارة ضابط الشرطة القضائية بصفة استعجالية في أجل أقصاه أسبوع من تاريخ التوصل بالانتداب."
                ]
              },
              {
                "number": "65",
                "paragraphs": [
                  "يمكن لضابط الشرطة القضائية أن يمنع أي شخص مفيد في التحريات من الابتعاد عن مكان وقوع الجريمة إلى أن تنتهي تحرياته.",
                  "يجب على كل شخص ظهر من الضروري معاينة هويته أو التحقق منها، بناء على طلب من ضابط الشرطة القضائية، أن يمتثل للعمليات التي يستلزمها هذا التدبير.",
                  "يعاقب كل من خالف مقتضيات الفقرتين الأولى والثانية من هذه المادة بغرامة من 2.000 إلى 5.000 درهم.",
                  "يجرى التحقق من الهوية طبقا للمقتضيات المنصوص عليها في الباب الرابع من هذا القسم."
                ]
              },
              {
                "number": "66",
                "paragraphs": [
                  "يمكن لضابط الشرطة القضائية أن يحتفظ بشخص أو عدة أشخاص تحت الحراسة النظرية ليكونوا رهن إشارته، إذا وجدت أسباب للاشتباه في ارتكابهم أو محاولة ارتكابهم جناية أو جنحة يعاقب عليها بالحبس، وذلك لمدة لا تتجاوز ثمان وأربعين ساعة تحتسب ابتداء من ساعة إيقافهم، وتشعر النيابة العامة فورا بذلك.",
                  "لا تحتسب ضمن مدة الحراسة النظرية المدة اللازمة لنقل الشخص المشتبه فيه، إذا تم إيقافه خارج الدائرة القضائية التي يعمل بها ضابط الشرطة القضائية الذي احتفظ به تحت الحراسة النظرية، غير أن هذه المدة تخصم من مدة تنفيذ العقوبة في حالة الحكم على المعني بالأمر بعقوبة سالبة للحرية.",
                  "يقوم ضابط الشرطة القضائية الذي أوقف المشتبه فيه في الحالة المشار إليها في الفقرة الثانية أعلاه، بتحرير محضر يشير فيه إلى ساعة وتاريخ ومكان وظروف الإيقاف، ويضم إلى أصل محضر البحث.",
                  "لا يحتسب كذلك ضمن مدة الحراسة النظرية الوقت الذي يقضيه المعني بالأمر في العلاج، ولو كان خاضعا للمراقبة الأمنية، وفي هذه الحالة تخصم هذه المدة من مدة تنفيذ العقوبة في حالة الحكم على المعني بالأمر بعقوبة سالبة للحرية."
                ]
              },
              {
                "number": "1-66",
                "paragraphs": [
                  "الحراسة النظرية تدبير استثنائي لا يلجأ إليه إلا إذا تبين أنه ضروري لأحد الأسباب التالية:",
                  "1- الحفاظ على الأدلة والحيلولة دون تغيير معالم الجريمة؛",
                  "2- القيام بالأبحاث والتحريات التي تستلزم حضور أو مشاركة المشتبه فيه؛",
                  "3- وضع المشتبه فيه رهن إشارة العدالة والحيلولة دون فراره؛",
                  "4- الحيلولة دون ممارسة أي ضغط على الشهود أو الضحايا أو أسرهم أو أقاربهم؛",
                  "5- منع المشتبه فيه من التواطؤ مع الأشخاص المساهمين أو المشاركين في الجريمة؛",
                  "6- وضع حد للاضطراب الذي أحدثه الفعل بسبب خطورته أو ظروف ارتكابه أو الوسيلة التي استعملت في ارتكابه، أو أهمية الضرر الناتج عنه، أو بالنظر لخطورة المشتبه فيه.",
                  "يجب على النيابة العامة التأكد من تحقق الأسباب المذكورة."
                ]
              },
              {
                "number": "2-66",
                "paragraphs": [
                  "يجب أن تنفذ الحراسة النظرية في ظروف تضمن احترام كرامة الشخص والحقوق المخولة له قانونا. وإذا تطلب الأمر اتخاذ تدابير أمنية يتعين التقيد بما هو ضروري.",
                  "تتحمل ميزانية الدولة نفقات التغذية المقدمة للأشخاص الموضوعين تحت الحراسة النظرية، وتحدد بنص تنظيمي قواعد نظام التغذية وكيفيات تقديم الوجبات الغذائية.",
                  "يتعين على ضابط الشرطة القضائية بعد التأكد من هوية الشخص الذي ألقي عليه القبض أو تم وضعه تحت الحراسة النظرية إخباره فورا وبكيفية يفهمها، بدواعي إيقافه وبحقوقه، ومن بينها حقه في التزام الصمت بشأن الأفعال موضوع إيقافه.",
                  "لا يعتبر الصمت اعترافا ضمنيا بما هو منسوب للشخص الموضوع تحت الحراسة النظرية.",
                  "يمكن لضرورة البحث تمديد مدة الحراسة النظرية أربعا وعشرين ساعة لمرة واحدة بإذن كتابي معلل من النيابة العامة.",
                  "إذا تعلق الأمر بالمس بأمن الدولة الداخلي أو الخارجي، فإن مدة الحراسة النظرية تكون ستا وتسعين ساعة قابلة للتمديد مرة واحدة لنفس المدة، بناء على إذن كتابي معلل من النيابة العامة.",
                  "إذا تعلق الأمر بجريمة إرهابية، فإن مدة الحراسة النظرية تكون ستا وتسعين ساعة قابلة للتمديد مرتين لمدة ست وتسعين ساعة في كل مرة، بناء على إذن كتابي معلل من النيابة العامة.",
                  "يحق للشخص الذي ألقي القبض عليه أو وضع تحت الحراسة النظرية الاستفادة من مساعدة قانونية، ومن إمكانية الاتصال بأحد أقربائه أو محاميه بالهاتف أو بأي وسيلة متاحة، وكذا الحق في طلب تعيين محام في إطار المساعدة القضائية.",
                  "تقوم الشرطة القضائية فورا بإشعار المحامي المعين. وإذا طلب المعني بالأمر تعيين محام في إطار المساعدة القضائية تقوم الشرطة القضائية فورا بإشعار النقيب الذي يتولى تعيين هذا المحامي.",
                  "يتم الاتصال بالمحامي ابتداء من الساعة الأولى لوضع المعني بالأمر تحت الحراسة النظرية، ويمكن لممثل النيابة العامة كلما تعلق الأمر بجريمة إرهابية أو بالجرائم المنصوص عليها في المادة 108 واقتضت ضرورة البحث ذلك، أن يؤخر بصفة استثنائية اتصال المحامي بموكله بناء على طلب من ضابط الشرطة القضائية على ألا تتجاوز مدة التأخير نصف المدة الأصلية للحراسة النظرية.",
                  "يتم الاتصال بالمحامي لمدة لا تتجاوز ثلاثين دقيقة تحت مراقبة ضابط الشرطة القضائية في ظروف تكفل سرية المقابلة.",
                  "يرفع ضابط الشرطة القضائية عقب كل ترخيص بالاتصال تقريرا في هذا الشأن إلى النيابة العامة ويشار إلى ذلك في المحضر."
                ]
              },
              {
                "number": "3-66",
                "paragraphs": [
                  "ينجز في الجنايات والجنح المعاقب عليها قانونا بخمس سنوات فأكثر تسجيل سمعي بصري للمشتبه فيه الموضوع تحت الحراسة النظرية أثناء قراءة تصريحاته المضمنة في المحضر ولحظة توقيعه أو إبصامه عليه أو رفضه.",
                  "تحدد بنص تنظيمي كيفيات إجراء التسجيل السمعي البصري.",
                  "يمكن للمحكمة كلما اقتضى الأمر المطالبة بمحتوى التسجيل الذي يحتفظ به طبقا لأحكام المادة 113 من هذا القانون."
                ]
              },
              {
                "number": "4-66",
                "paragraphs": [
                  "يحق للمحامي بعد إذن من النيابة العامة المختصة حضور عملية الاستماع للمشتبه فيه من طرف الشرطة القضائية إذا تعلق الأمر بالأحداث أو بذوي العاهات المنصوص عليهم في البند 1 من المادة 316 من هذا القانون.",
                  "يتعين في هذه الحالة إشعار المشتبه فيه بهذا الحق قبل الاستماع إليه مع الإشارة إلى ذلك في المحضر.",
                  "يمنع على المحامي إخبار أي كان بما راج خلال جلسة الاستماع تحت طائلة تطبيق مقتضيات الفقرة الثانية من المادة 15 من هذا القانون."
                ]
              },
              {
                "number": "5-66",
                "paragraphs": [
                  "يجب مسك سجل ترقم صفحاته وتذيل بتوقيع وكيل الملك في كل الأماكن التي يمكن أن يوضع فيها الأشخاص تحت الحراسة النظرية.",
                  "تقيد في هذا السجل هوية الشخص الموضوع تحت الحراسة النظرية وسبب ذلك وساعة بداية الحراسة النظرية وساعة نهايتها ومدة الاستنطاق وأوقات الراحة والحالة البدنية والصحية للشخص الموقوف والتغذية المقدمة له.",
                  "يجب أن يوقع في هذا السجل الشخص الذي وضع تحت الحراسة النظرية وضابط الشرطة القضائية بمجرد انتهائها، وإذا كان ذلك الشخص غير قادر على التوقيع أو البصم أو رفض القيام به يشار إلى ذلك في السجل.",
                  "يجب أن يعرض هذا السجل على وكيل الملك للاطلاع عليه ومراقبته والتأشير عليه مرة في كل شهر على الأقل.",
                  "تنقل محتويات السجل فورا إلى سجل إلكتروني وطني وجهوي للحراسة النظرية، ويتم الاطلاع على هذا السجل من قبل رئيس النيابة العامة والسلطات القضائية المختصة والجهات المخول لها قانونا بذلك.",
                  "تقوم النيابة العامة بمراقبة الوضع تحت الحراسة النظرية، ويمكن لها أن تأمر في أي وقت بوضع حد لها أو بمثول الشخص الموضوع تحت الحراسة النظرية أمامها."
                ]
              },
              {
                "number": "67",
                "paragraphs": [
                  "يجب على كل ضابط من ضباط الشرطة القضائية أن يبين في محضر الاستماع لأي شخص وضع تحت الحراسة النظرية يوم وساعة إيقافه ويوم وساعة وضع ورفع الحراسة النظرية أو تقديمه إلى الجهة القضائية المختصة.",
                  "يجب أن تذيل هذه البيانات، إما بتوقيع الشخص المعني بالأمر أو ببصمه وإما بالإشارة إلى رفضه ذلك أو استحالته مع بيان أسباب الرفض أو الاستحالة.",
                  "يجب تضمين بيانات مماثلة في السجل المنصوص عليه في المادة 5-66 أعلاه.",
                  "يقوم ضابط الشرطة القضائية بإشعار عائلة الموقوف أو أي شخص يعنيه ذلك ما لم يعترض هذا الأخير صراحة، وذلك فور اتخاذ قرار وضعه تحت الحراسة النظرية بالهاتف أو بأي وسيلة أخرى متاحة، ويشير في المحضر إلى الاسم الشخصي والعائلي وصفة الشخص الذي تم إشعاره والوسيلة المستعملة في ذلك وتاريخ وساعة الإشعار، كما يضمنه تصريحات الموقوف في حالة اعتراضه على إشعار عائلته.",
                  "يتعين عليه أن يوجه يوميا إلى النيابة العامة لائحة الأشخاص الذين تم وضعهم تحت الحراسة النظرية خلال الأربع وعشرين ساعة السابقة.",
                  "يتعين على ضابط الشرطة القضائية إخضاع الشخص الموضوع تحت الحراسة النظرية لفحص طبي بعد إشعار النيابة العامة، إذا لاحظ عليه مرضا أو علامات أو آثارا تستدعي ذلك، يجريه طبيب مؤهل لممارسة مهام الطب الشرعي أو طبيب آخر في حالة تعذر ذلك.",
                  "يشار إلى هذا الإجراء بالمحضر وبسجل الحراسة النظرية، ويضاف التقرير الطبي المنجز إلى المحضر المحال إلى النيابة العامة."
                ]
              },
              {
                "number": "68",
                "paragraphs": [
                  "يمكن لضباط الشرطة القضائية العاملين بالهيئات والمصالح التي تمسك دفتر التصريحات، عند الاقتضاء، أو لأسباب معللة أن يستعملوا هذا الدفتر لتدوين التصريحات وكذا العمليات التي أنجزوها في إطار الأبحاث القضائية.",
                  "ويتعين في هذه الحالة أن يضمنوا في هذا الدفتر البيانات والتوقيعات المشار إليها في المادة 67 أعلاه.",
                  "تدرج بيانات مماثلة في المحضر الذي يوجه إلى السلطات القضائية المختصة.",
                  "توضع دفاتر التصريحات رهن إشارة السلطات القضائية المختصة كلما طلبتها."
                ]
              },
              {
                "number": "69",
                "paragraphs": [
                  "يحرر ضابط الشرطة القضائية فورا المحاضر التي أنجزها طبقا للمواد من 57 إلى 67 أعلاه ويوقع على كل ورقة من أوراقها."
                ]
              },
              {
                "number": "70",
                "paragraphs": [
                  "تسري مقتضيات المواد من 57 وما بعدها إلى المادة 69 على قضايا التلبس بالجنح في جميع الأحوال التي ينص فيها القانون على عقوبة الحبس."
                ]
              },
              {
                "number": "71",
                "paragraphs": [
                  "يستلزم حضور ممثل النيابة العامة في حال وقوع جناية أو جنحة تخلي ضابط الشرطة عن العملية.",
                  "ويتولى القاضي المذكور كل أعمال الشرطة القضائية المنصوص عليها في هذا الباب، ويمكنه أيضا أن يكلف أي ضابط للشرطة القضائية لمواصلة العمليات."
                ]
              },
              {
                "number": "72",
                "paragraphs": [
                  "يجوز لممثل النيابة العامة أثناء قيامه بالإجراءات كما هو منصوص عليه في هذا الباب، أن ينتقل كلما استلزمت ذلك ضرورة البحث إلى دوائر نفوذ المحاكم المجاورة للمحكمة التي يمارس فيها مهامه، شريطة أن يخبر بذلك مسبقا النيابة العامة لدى المحكمة التي سينتقل إليها، ويبين سبب هذا التنقل بالمحضر.",
                  "علاوة على ذلك، يجب على وكيل الملك أن يخبر بتنقله الوكيل العام للملك الذي يتبع لدائرة نفوذه."
                ]
              },
              {
                "number": "73",
                "paragraphs": [
                  "إذا تعلق الأمر بالتلبس بجناية طبقا لمقتضيات المادة 56 من هذا القانون، ولم تكن الجريمة من الجرائم التي يكون التحقيق فيها إلزاميا طبقا لمقتضيات المادة 83 بعده، استفسر الوكيل العام للملك أو أحد نوابه المعين من قبله المشتبه فيه عن هويته وأجرى استنطاقه بعد إشعاره أن من حقه تنصيب محام عنه حالا، وإلا عين له تلقائيا من طرف رئيس غرفة الجنايات أثناء المحاكمة في إطار المساعدة القضائية.",
                  "يحق للمحامي أن يحضر هذا الاستنطاق كما يحق له، بعد الانتهاء منه، أن يلتمس إجراء فحص طبي على موكله، وأن يدلي نيابة عنه بوثائق أو إثباتات كتابية، وله حق طرح الأسئلة وإبداء الملاحظات، ويمكنه أيضا أن يعرض تقديم كفالة مالية أو شخصية مقابل إطلاق سراحه، وتطبق عندئذ المقتضيات المتعلقة بالكفالة المشار إليها في المادة 1-74 أدناه.",
                  "يستعين الوكيل العام للملك بترجمان أو بكل شخص يحسن التخاطب أو التفاهم مع من يقع استنطاقه عند الاقتضاء.",
                  "إذا ظهر أن القضية جاهزة للحكم، أصدر الوكيل العام للملك أمرا بوضع المتهم رهن الاعتقال وأحاله على غرفة الجنايات داخل أجل خمسة عشر يوما على الأكثر.",
                  "غير أنه يمكن للوكيل العام للملك عند الاقتضاء إحالة المتهم إلى المحكمة في حالة سراح، ويمكنه أن يأمر بإخضاعه لواحد أو أكثر من تدابير المراقبة القضائية المنصوص عليها في المادة 161 من هذا القانون.",
                  "يقوم الوكيل العام للملك بتتبع تنفيذ التدابير المتخذة وفقا للفقرة السابقة وطبقا لما هو منصوص عليه في المواد من 162 إلى 3-174 من هذا القانون.",
                  "إذا ظهر أن القضية غير جاهزة للحكم، التمس إجراء تحقيق فيها.",
                  "يجب على الوكيل العام للملك إذا طلب منه إجراء فحص طبي من طرف المشتبه فيه أو دفاعه أو عاين بنفسه آثارا تبرر ذلك أن يخضع المشتبه فيه لذلك الفحص، يجريه طبيب مؤهل لممارسة مهام الطب الشرعي أو طبيب آخر في حالة تعذر ذلك.",
                  "إذا تعلق الأمر بحدث يحمل آثارا ظاهرة للعنف أو إذا اشتكى من وقوع عنف عليه، يجب على ممثل النيابة العامة وقبل الشروع في الاستنطاق إحالته على فحص يجريه طبيب مؤهل لممارسة مهام الطب الشرعي أو طبيب آخر في حالة تعذر ذلك، وفي جميع الأحوال تستكمل إجراءات الاستنطاق بعد إجراء الفحص الطبي.",
                  "يمكن أيضا لمحامي الحدث أن يطلب إجراء الفحص المشار إليه في الفقرة السابقة.",
                  "لا يعتد باعتراف المتهم المدون في محضر الشرطة القضائية في حالة رفض إجراء الفحص الطبي إذا كان قد طلبه المتهم الذي يحمل آثارا ظاهرة للعنف أو دفاعه وفقا للفقرات الثامنة والتاسعة والعاشرة من هذه المادة."
                ]
              },
              {
                "number": "1-73",
                "paragraphs": [
                  "يمكن للوكيل العام للملك في غير حالة التلبس بجناية، إذا تبين له أن تدابير المراقبة القضائية غير كافية، أو أن مثول المتهم أمام المحكمة في حالة سراح من شأنه أن يؤثر على حسن سير العدالة، أن يصدر أمرا بإيداع المتهم في السجن وفقا للمسطرة المنصوص عليها في المادة 73 أعلاه، إذا توفر سبب أو أكثر من الأسباب المنصوص عليها في المادة 1-47 من هذا القانون."
                ]
              },
              {
                "number": "2-73",
                "paragraphs": [
                  "يمكن الطعن في الأمر بالإيداع في السجن الصادر عن الوكيل العام للملك أمام غرفة الجنايات الابتدائية إلى غاية نهاية اليوم الموالي لصدوره، ويمدد هذا الأجل إلى أول يوم عمل إذا صادف يوم عطلة.",
                  "يتم الطعن في صيغة تصريح يقدم إلى كتابة الضبط التي تبلغه فورا للوكيل العام للملك.",
                  "يكون التصريح صحيحا إذا تلقته كتابة الضبط بالمؤسسة السجنية التي يجب عليها أن تقيده حالا في سجل خاص، وعلى رئيس المؤسسة أن يقوم بتوجيه التصريح إلى كتابة الضبط بالمحكمة فورا ويشعر النيابة العامة بذلك.",
                  "تتم إحالة الملف فورا على غرفة الجنايات الابتدائية التي تبت في الطعن داخل أجل يوم واحد من تاريخ إحالة الطعن إليها ولو في غياب الأطراف، ويمدد هذا الأجل إلى أول يوم عمل إذا صادف يوم عطلة.",
                  "يبقى المعني بالأمر في حالة اعتقال إلى حين بت الغرفة المذكورة، ولا يحول رفض الطعن دون تقديم طلب الإفراج المؤقت لاحقا.",
                  "تتحقق الغرفة من توفر الشروط التي استند إليها الأمر بالإيداع والمنصوص عليها في المادتين 1-47 و73 أعلاه، وتأمر في حالة عدم توفرها برفع حالة الاعتقال بمقتضى مقرر مستقل يقبل الطعن بالاستئناف داخل أجل أربع وعشرين ساعة، ولا يحول رفض الطعن دون تقديم طلب الإفراج المؤقت لاحقا.",
                  "يحال الملف عند الطعن بالاستئناف على غرفة الجنايات الاستئنافية داخل أجل أربع وعشرين ساعة، وتبت هذه الأخيرة وفق الشروط المشار إليها في الفقرات أعلاه داخل أجل ثمان وأربعين ساعة.",
                  "يبقى المتهم رهن الاعتقال بعد استئناف النيابة العامة إلى حين بت الغرفة، ولا يقبل قرارها أي طعن."
                ]
              },
              {
                "number": "74",
                "paragraphs": [
                  "إذا تعلق الأمر بحالة تلبس بجنحة معاقب عليها بالحبس أو بإحدى الحالات المنصوص عليها في المادة 1-47 أعلاه، يقوم وكيل الملك أو أحد نوابه باستفسار المشتبه فيه عن هويته ويجري استنطاقه عن الأفعال المنسوبة إليه بعد إشعاره بأن من حقه تنصيب محام عنه حالا، ثم يتخذ في حقه تدبيرا أو أكثر من تدابير المراقبة القضائية المنصوص عليها في المادة 161 من هذا القانون، وإذا تبين له أن تدابير المراقبة القضائية غير كافية، يأمر بإيداعه في السجن.",
                  "يقوم وكيل الملك بتنفيذ وتتبع تدابير المراقبة القضائية المتخذة وفقا للفقرة السابقة وطبقا لما هو منصوص عليه في المواد من 162 إلى 3-174 من هذا القانون."
                ]
              },
              {
                "number": "1-74",
                "paragraphs": [
                  "يحق للمحامي أن يحضر الاستنطاق المشار إليه في المادة 74 أعلاه، كما يحق له بعد انتهاء الاستنطاق أن يلتمس إجراء فحص طبي على موكله، وأن يدلي نيابة عنه بوثائق أو إثباتات كتابية، وله حق طرح الأسئلة وإبداء الملاحظات والإدلاء بالوثائق الضرورية، كما يمكنه أن يعرض تقديم كفالة مالية أو شخصية مقابل إطلاق سراحه.",
                  "يراعى في تقدير الكفالة المالية، عند الاقتضاء، مقتضيات المادة 184 من هذا القانون، ويحدد مقرر النيابة العامة بكل دقة المبلغ المخصص لضمان حضور المتهم.",
                  "تضمن النيابة العامة مقرر تحديد الكفالة في سجل خاص وتودع بالملف نسخة من المقرر ومن وصل إيداع المبلغ.",
                  "تطبق على إيداع الكفالة واستردادها ومصادرتها مقتضيات المواد من 185 إلى 188 من هذا القانون.",
                  "يستعين وكيل الملك، عند الاقتضاء، بترجمان أو بكل شخص يحسن التخاطب أو التفاهم مع من يقع استنطاقه.",
                  "إذا صدر الأمر بالإيداع في السجن، فإن القضية تحال إلى أول جلسة تعقدها المحكمة الابتدائية، طبقا للشروط المنصوص عليها في المادة 385 من هذا القانون.",
                  "يجب على وكيل الملك إذا طلب منه إجراء فحص طبي أو عاين بنفسه آثارا تبرر ذلك أن يخضع المشتبه فيه لذلك الفحص، يجريه طبيب مؤهل لممارسة مهام الطب الشرعي أو طبيب آخر في حالة تعذر ذلك.",
                  "إذا تعلق الأمر بحدث يحمل آثارا ظاهرة للعنف أو إذا اشتكى حدث من وقوع عنف عليه، فإنه يجب على ممثل النيابة العامة وقبل الشروع في الاستنطاق إحالته على فحص يجريه طبيب مؤهل لممارسة مهام الطب الشرعي أو طبيب آخر في حالة تعذر ذلك، وفي جميع الأحوال تستكمل إجراءات الاستنطاق بعد إجراء الفحص الطبي.",
                  "يمكن أيضا لمحامي الحدث أن يطلب إجراء الفحص المشار إليه في الفقرة السابقة.",
                  "يكون اعتراف المتهم المدون في محضر الشرطة القضائية باطلا، في حالة رفض إجراء الفحص الطبي إذا كان قد طلبه المتهم أو دفاعه وفقا للفقرات السابقة."
                ]
              },
              {
                "number": "2-74",
                "paragraphs": [
                  "إذا أخل المتهم بالالتزامات المفروضة عليه تنفيذا للمراقبة القضائية بمقتضى الأمر الصادر وفقا للمادتين 73 و74 أعلاه، دون أن يدلي بمبرر مقبول، فإنه يمكن لرئيس الهيئة القضائية المعروض عليها الملف، أن يأمر في أي مرحلة من مراحل المحاكمة، بناء على ملتمس النيابة العامة، بإيداعه في السجن."
                ]
              },
              {
                "number": "75",
                "paragraphs": [
                  "إذا حضر قاضي التحقيق بمكان وقوع الجناية أو الجنحة المتلبس بها، فإن الوكيل العام للملك أو وكيل الملك وضباط الشرطة القضائية يتخلون له عن القضية بقوة القانون.",
                  "يقوم قاضي التحقيق في هذه الحالة بجميع أعمال ضباط الشرطة القضائية المنصوص عليها في هذا الباب، وله أن يأمر أيا من ضباط الشرطة القضائية بمتابعة العمليات.",
                  "يرسل قاضي التحقيق إلى الوكيل العام للملك أو وكيل الملك بمجرد انتهاء تلك العمليات جميع وثائق البحث ليقرر بشأنها ما يقتضيه الأمر.",
                  "خلافا لمقتضيات المادة 90 بعده، إذا حل بالمكان الوكيل العام للملك أو وكيل الملك وقاضي التحقيق في آن واحد، فلممثل النيابة العامة أن يلتمس مباشرة تحقيق إعدادي يكلف بإجرائه قاضي التحقيق الحاضر."
                ]
              },
              {
                "number": "76",
                "paragraphs": [
                  "يحق في حالة التلبس بجناية أو جنحة يعاقب عليها بالحبس لكل شخص ضبط الفاعل وتقديمه إلى أقرب ضابط للشرطة القضائية."
                ]
              },
              {
                "number": "77",
                "paragraphs": [
                  "يتعين على ضابط الشرطة القضائية الذي أشعر بالعثور على جثة شخص مات بسبب عنف أو غيره، وظل سبب موته غير معروف أو يحيط به شك، أن يخبر بذلك فورا النيابة العامة، وأن ينتقل في الحال إلى مكان العثور على الجثة ويجري المعاينات الأولى.",
                  "يمكن لضابط الشرطة القضائية بعد موافقة السلطات القضائية المختصة انتداب طبيب مؤهل لممارسة مهام الطب الشرعي أو طبيب آخر في حالة تعذر ذلك من أجل الانتقال إلى مكان الجريمة والقيام بالمعاينات وأخذ العينات الضرورية.",
                  "ينجز الطبيب تقريرا مفصلا يتضمن معايناته والخلاصات التي توصل إليها، يضم إلى وثائق الملف.",
                  "يسلم الطبيب تقريره فور إنجازه إلى السلطات القضائية المختصة أو بإذن منها إلى ضابط الشرطة القضائية المنتدب من قبلها.",
                  "يمكن لممثل النيابة العامة أو قاضي التحقيق، حسب الحالة، أن ينتقل إلى مكان العثور على الجثة إذا رأى ضرورة لذلك، وأن يستعين بأشخاص لهم كفاءة لتحديد ظروف الوفاة، أو أن يختار من بين ضباط الشرطة القضائية من ينوب عنه للقيام بنفس المهمة.",
                  "يؤدي الأشخاص الذين تستعين بهم النيابة العامة اليمين كتابة على إبداء رأيهم بما يمليه عليهم الشرف والضمير، ما لم يكونوا مسجلين في لائحة الخبراء المحلفين لدى المحاكم.",
                  "يمكن لممثل النيابة العامة أو قاضي التحقيق، حسب الحالة، أيضا انتداب طبيب مؤهل لممارسة مهام الطب الشرعي أو طبيب آخر في حالة تعذر ذلك لأخذ العينات والكشف عن أسباب الوفاة وملابساتها."
                ]
              }
            ]
          },
          {
            "name": "الباب الثاني",
            "title": "البحث التمهيدي",
            "articles": [
              {
                "number": "78",
                "paragraphs": [
                  "يقوم ضباط الشرطة القضائية بأبحاث تمهيدية، بناء على تعليمات النيابة العامة أو تلقائيا.",
                  "يسير هذه العمليات وكيل الملك أو الوكيل العام للملك كل فيما يخصه.",
                  "يمكن للنيابة العامة أن تأذن لضباط الشرطة القضائية باستقدام كل شخص بواسطة القوة العمومية إذا لم يمتثل لاستدعاء سابق وجه إليه.",
                  "ينجز ضابط الشرطة القضائية بعد إشعار النيابة العامة بحثا ماليا موازيا لتحديد الأشياء والأموال والممتلكات والمتحصلات ومصدرها وتاريخ تملكها وعلاقتها بالجريمة، ويمكن له أن يحجزها بناء على إذن كتابي من النيابة العامة المختصة متى نتج عن البحث المالي الموازي قرائن كافية على أنها من عائدات الجريمة، حتى وإن كانت بيد شخص آخر مع مراعاة حقوق الغير حسن النية.",
                  "لا يمكن أن ينصب الحجز على الأشياء والأموال والممتلكات التي لا علاقة لها بالجريمة، ولاسيما الأجور والمعاشات المستحقة قانونا والتركات والأموال المكتسبة قبل تاريخ ارتكاب الجريمة والتي لم يثبت أن لها علاقة بها."
                ]
              },
              {
                "number": "79",
                "paragraphs": [
                  "لا يمكن دخول المنازل وتفتيشها وحجز ما بها من أدوات الاقتناع دون موافقة صريحة من الشخص الذي ستجري العمليات بمنزله.",
                  "تضمن هذه الموافقة في تصريح مكتوب بخط يد المعني بالأمر، فإن كان لا يعرف الكتابة يشار إلى ذلك في المحضر كما يشار فيه إلى قبوله.",
                  "تسري في هذه الحالة مقتضيات المواد 59 و60 و62 و63 من هذا القانون.",
                  "إذا تعلق الأمر بجريمة من الجرائم المنصوص عليها في المادة 108 من هذا القانون، وامتنع الشخص الذي سيجري التفتيش أو الحجز بمنزله عن إعطاء موافقته أو تعذر الحصول عليها، فإنه يمكن إجراء العمليات المذكورة في الفقرة الأولى من هذه المادة بإذن كتابي من النيابة العامة بحضور الشخص المعني بالأمر، وفي حالة امتناعه أو تعذر حضوره فبحضور شخصين من غير مرؤوسي ضابط الشرطة القضائية."
                ]
              },
              {
                "number": "80",
                "paragraphs": [
                  "إذا تعلق الأمر بجناية أو جنحة يعاقب عليها بالحبس، وتوفر سبب من الأسباب المشار إليها في المادة 1-66 أعلاه، يمكن لضابط الشرطة القضائية أن يضع المشتبه فيه تحت الحراسة النظرية لمدة لا تتجاوز ثمان وأربعين ساعة بإذن من النيابة العامة، ويتعين لزوما تقديمه إلى وكيل الملك أو الوكيل العام للملك قبل انتهاء هذه المدة.",
                  "يمكن لوكيل الملك أو الوكيل العام للملك بعد الاستماع إلى الشخص الذي قدم إليه، أن يمنح إذنا مكتوبا بتمديد الحراسة النظرية وفقا لما هو منصوص عليه في المادة 2-66 أعلاه.",
                  "ويمكن بصفة استثنائية منح الإذن المذكور بموجب مقرر معلل بأسباب دون أن يقدم الشخص إلى النيابة العامة.",
                  "كما يمكن لوكيل الملك أو الوكيل العام للملك بغرض تمديد الحراسة النظرية الاستماع إلى الشخص المعني عن طريق تقنية الاتصال عن بعد.",
                  "يتم الوضع تحت الحراسة النظرية المنصوص عليها في هذه المادة وفقا لمقتضيات المواد 2-66 و3-66 و67 من هذا القانون."
                ]
              },
              {
                "number": "81",
                "paragraphs": [
                  "يجوز لضابط الشرطة القضائية أن يقوم بإجراء تفتيش جسدي على الأشخاص المشار إليهم في المادتين 59 و60 أعلاه بواسطة أشخاص من جنسهم، وفي ظروف تصان فيها كرامتهم."
                ]
              },
              {
                "number": "82",
                "paragraphs": [
                  "يثبت الوضع تحت الحراسة النظرية حسب الشكليات المنصوص عليها في المواد 66 ومن 1-66 إلى 5-66 و67 و68 أعلاه."
                ]
              }
            ]
          },
          {
            "name": "الباب الثالث",
            "title": "تقنيات البحث الخاصة",
            "branches": [
              {
                "name": "الفرع الأول",
                "title": "التسليم المراقب",
                "articles": [
                  {
                    "number": "1-82",
                    "paragraphs": [
                      "التسليم المراقب هو السماح بعبور شحنة غير مشروعة أو يشتبه في كونها كذلك إلى داخل المغرب أو عبره أو إلى خارجه، دون ضبطها، أو بعد سحبها أو استبدالها كليا أو جزئيا، تحت مراقبة السلطات المختصة، بقصد التعرف على الوجهة النهائية لهذه الشحنة والتحري عن جريمة والكشف عن هوية مرتكبيها والأشخاص المتورطين فيها وإيقافهم.",
                      "يراد في مدلول هذا الفرع بشحنة غير مشروعة، الأشياء أو الأموال التي تعد حيازتها جريمة، أو تكون متحصلة من جريمة أو كانت أداة في ارتكابها أو معدة لارتكابها."
                    ]
                  },
                  {
                    "number": "2-82",
                    "paragraphs": [
                      "يمنح الوكيل العام للملك لدى محكمة الاستئناف الإذن بالتسليم المراقب.",
                      "تتولى الشرطة القضائية تنفيذ الإذن المشار إليه أعلاه وتخبر الوكيل العام للملك بكل إجراء تقوم به.",
                      "يحرر ضباط الشرطة القضائية بعد انتهاء عملية التسليم المراقب محضرا أو محاضر بالإجراءات المنجزة توجه إلى النيابة العامة التي منحت الإذن.",
                      "يلتزم ضباط وأعوان الشرطة القضائية بالحفاظ على سرية الإجراءات المنصوص عليها في هذا الفرع."
                    ]
                  },
                  {
                    "number": "3-82",
                    "paragraphs": [
                      "يؤجل الوكيل العام للملك الذي منح الإذن بالتسليم المراقب اتخاذ أي إجراء من إجراءات البحث المرتبطة بعملية التسليم المراقب أو إيقاف مرتكبي الجريمة والمتورطين فيها إلى حين علمه بوصول الشحنة إلى وجهتها النهائية."
                    ]
                  }
                ]
              },
              {
                "name": "الفرع الثاني",
                "title": "الاختراق",
                "articles": [
                  {
                    "number": "1-3-82",
                    "paragraphs": [
                      "إذا اقتضت ضرورة البحث القيام بمعاينات لجريمة أو أكثر من الجرائم المنصوص عليها في المادة 108 بعده، فإنه يجوز للنيابة العامة أن تأذن تحت مراقبتها بمباشرة عملية الاختراق وفق الشروط المبينة بعده.",
                      "يمكن ضابط أو عون الشرطة القضائية المختص، تحت إشراف ومراقبة النيابة العامة، من تتبع ومراقبة الأشخاص المشتبه فيهم من خلال التظاهر أمام هؤلاء الأشخاص بأنه فاعل أو مساهم أو مشارك أو مستفيد من الأفعال الإجرامية موضوع البحث، ويمكنه لهذه الغاية استعمال هوية مستعارة، ويمكنه أيضا عند الضرورة ارتكاب إحدى الأفعال المبينة في المادة 2-3-82 بعده.",
                      "تكون عملية الاختراق موضوع محضر أو تقرير ينجز من قبل ضابط الشرطة القضائية الذي عهد إليه بتنسيق العملية، يتضمن العناصر الأساسية الضرورية لمعاينة الجرائم دون أن تعرض سلامة ضابط أو عون الشرطة القضائية منفذ العملية والأشخاص المبينين أدناه للخطر.",
                      "تكون باطلة كل عملية اختراق تتم خرقا لأحكام هذه المادة."
                    ]
                  },
                  {
                    "number": "2-3-82",
                    "paragraphs": [
                      "يمكن لضباط وأعوان الشرطة القضائية المأذون لهم من قبل النيابة العامة بتنفيذ عمليات الاختراق، القيام داخل إقليم المملكة بما يلي:",
                      "1- اكتساب أو حيازة أو نقل أو تسليم أو استلام ممتلكات أو أموال أو وثائق أو معلومات أو أشياء مجرمة أو متحصلة من ارتكاب جرائم، أو استخدمت لارتكاب جرائم أو معدة لارتكابها؛",
                      "2- استعمال وسائل قانونية أو مالية أو وسائل نقل أو تخزين أو إيواء أو حفظ أو اتصال، أو وضعها رهن إشارة الأشخاص المتورطين في هذه الجرائم؛",
                      "3- استخدام هوية أو صفة مستعارة أو الاستعانة، تحت مسؤولية ضابط الشرطة القضائية، بأي شخص مؤهل للقيام بذلك، في وسائل التواصل الإلكترونية مع واحد أو أكثر من الأشخاص الذين يشتبه في كونهم ارتكبوا أو سيرتكبون جرائم، أو القيام بواسطة هذه الهوية أو الصفة المستعارة بإحدى العمليات المشار إليها في البندين 1 و2 أعلاه، أو استخراج أو إرسال جواب على طلب صريح أو الحصول أو الاحتفاظ بمحتويات غير مشروعة مكونة للجريمة.",
                      "لا يجوز أن تشكل الأفعال المذكورة بأي حال من الأحوال تحريضا على ارتكاب الجريمة تحت طائلة بطلان عملية الاختراق والدليل المستمد منها.",
                      "إذا اقتضت ضرورة تنفيذ عملية الاختراق القيام بأعمال خارج المملكة المغربية، فإنه يجوز للنيابة العامة أن تأذن بذلك، وفق مبادئ التعاون القضائي الدولي، بعد موافقة السلطات الأجنبية المعنية.",
                      "تنفذ عمليات الاختراق التي تطلبها سلطات أجنبية وفقا لما هو منصوص عليه في المادتين 1-713 و2-713 من هذا القانون، مع احترام مقتضيات المادة 1-3-82 أعلاه، ما لم تنص اتفاقية مصادق عليها من قبل المملكة المغربية على خلاف ذلك.",
                      "يوضع الإذن المذكور وجميع المحاضر والتقارير المنجزة بهذا الشأن في ملف سري لدى النيابة العامة التي منحته."
                    ]
                  },
                  {
                    "number": "3-3-82",
                    "paragraphs": [
                      "يكون الإذن بمباشرة عملية الاختراق، تحت طائلة البطلان، مكتوبا ومعللا، ويتضمن تحديد الجريمة أو الجرائم التي تبرر اللجوء إلى هذه العملية، وهوية وصفة ضابط الشرطة القضائية الذي تتم تحت مسؤوليته.",
                      "كما يحدد المدة المأذون خلالها بمباشرة عملية الاختراق والتي لا يمكن أن تتجاوز أربعة أشهر قابلة للتمديد مرة واحدة بنفس الشروط.",
                      "يمكن للنيابة العامة التي أذنت بإنجاز العملية أن تأمر في كل حين وبقرار معلل بتعديل أو تتميم أو وقف العملية حتى قبل انتهاء المدة المحددة لها.",
                      "يمكن وضع الإذن رهن إشارة هيئة المحكمة بطلب منها لتطلع عليه وحدها عند الاقتضاء."
                    ]
                  },
                  {
                    "number": "4-3-82",
                    "paragraphs": [
                      "لا يكون مسؤولا جنائيا ضباط وأعوان الشرطة القضائية المأذون لهم بتنفيذ عملية اختراق بمناسبة مباشرتهم للعمليات المنصوص عليها في المادة 2-3-82 أعلاه.",
                      "لا يكون مسؤولا جنائيا بالنسبة للأفعال المرتبطة مباشرة بتنفيذ عملية الاختراق، كل الأشخاص الذين تمت الاستعانة بهم لإتمام عملية الاختراق، المعينون سلفا من قبل ضباط الشرطة القضائية المأذون لهم بمباشرتها إذا كانت النيابة العامة قد أشعرت بذلك."
                    ]
                  },
                  {
                    "number": "5-3-82",
                    "paragraphs": [
                      "إذا قررت النيابة العامة التي منحت الإذن وقف عملية الاختراق أو إذا انتهى الأجل المحدد من قبلها لإنجاز العملية دون أن تمدده، فإنه يجوز لضابط أو عون الشرطة القضائية منفذ العملية أن يستمر في الأفعال المبينة في المادة 2-3-82 أعلاه دون أن يكون مسؤولا جنائيا، وذلك خلال الوقت الكافي لإيقاف التدخل، متى كان ذلك ضروريا لضمان أمنه وسلامته، على ألا تتجاوز هذه المدة أربعة أشهر كحد أقصى وبإذن من الجهة التي منحت الإذن بعملية الاختراق.",
                      "تشعر النيابة العامة التي منحت الإذن باستمرار عملية الاختراق في أقرب الآجال.",
                      "إذا انتهت هذه المدة المذكورة دون أن يتمكن الضابط منفذ عملية الاختراق من إنهاء مهامه في ظروف تضمن أمنه وسلامته، فإن النيابة العامة التي منحت الإذن تقوم بتمديد هذه المدة أربعة أشهر إضافية.",
                      "يقوم ضابط الشرطة القضائية المسؤول عن عملية الاختراق بإحصاء العائدات المالية والأشياء العينية المتحصل عليها من الأفعال الإجرامية، ويحيلها إلى النيابة العامة رفقة المحضر."
                    ]
                  },
                  {
                    "number": "6-3-82",
                    "paragraphs": [
                      "يمنع الكشف عن الهوية الحقيقية لضابط أو عون الشرطة القضائية منفذ عملية الاختراق بهوية مستعارة في أية مرحلة من مراحل العملية.",
                      "دون الإخلال بالمقتضيات الجنائية الأشد، يعاقب بالحبس من سنتين إلى خمس سنوات وبغرامة من 2000 إلى 5000 درهم كل من كشف الهوية الحقيقية لضابط أو عون الشرطة القضائية منفذ عملية الاختراق بهوية مستعارة.",
                      "إذا نتج عن كشف الهوية الحقيقية لضابط أو عون الشرطة القضائية منفذ عملية الاختراق عنف أو ضرب أو جرح أو إيذاء في حقه أو في حق زوجه أو أحد أصوله أو أحد فروعه أو مكفوليه، فإن العقوبة تكون السجن من خمس إلى عشر سنوات والغرامة من 5000 إلى 10.000 درهم.",
                      "إذا نتج عن كشف الهوية فقد عضو أو بتره أو الحرمان من منفعته أو عمى أو عور أو أي عاهة دائمة أخرى في حق ضابط أو عون الشرطة القضائية منفذ عملية الاختراق أو في حق زوجه أو أحد أصوله أو أحد فروعه أو مكفوليه، فإن العقوبة تكون السجن من عشر إلى عشرين سنة والغرامة من 5000 إلى 20.000 درهم.",
                      "إذا نتج عن ذلك موت ضابط أو عون الشرطة القضائية منفذ عملية الاختراق أو زوجه أو أحد أصوله أو أحد فروعه أو مكفوليه، فإن العقوبة تكون السجن من عشر إلى خمس وعشرين سنة والغرامة من 20.000 إلى 50.000 درهم.",
                      "إذا تم كشف الهوية الحقيقية لضابط الشرطة القضائية منفذ عملية الاختراق بهوية مستعارة من قبل الشخص الذي استعان به لإتمام عملية الاختراق، تضاعف العقوبة المقررة في الفقرات السابقة من هذه المادة، وإذا تجاوز الحد الأقصى في هذه الحالة خمس وعشرين سنة فإن العقوبة تكون هي السجن المؤبد."
                    ]
                  }
                ]
              }
            ]
          },
          {
            "name": "الباب الرابع",
            "title": "التحقق من الهوية",
            "articles": [
              {
                "number": "7-3-82",
                "paragraphs": [
                  "خلافا لأي مقتضى تشريعي آخر، يجري التحقق من الهوية وفق مقتضيات هذا الباب."
                ]
              },
              {
                "number": "8-3-82",
                "paragraphs": [
                  "يمكن لضباط الشرطة القضائية، وبأمر من هؤلاء وتحت مسؤوليتهم، لأعوان الشرطة القضائية التحقق من هوية الأشخاص المشتبه في ارتكابهم أو محاولة ارتكابهم الجريمة، أو الذين يشكلون تهديدا للأشخاص أو للممتلكات أو للأمن العام، أو الذين قد يتوفرون على معلومات مفيدة للبحث في جريمة، أو موضوع أبحاث أو تدابير مأمور بها من قبل السلطات القضائية المختصة.",
                  "يحق للشخص المراد التحقق من هويته إثبات هويته بكل الوسائل المشروعة."
                ]
              },
              {
                "number": "9-3-82",
                "paragraphs": [
                  "يمكن اقتياد الشخص الذي يرفض الإدلاء بهويته أو يتعذر التعرف عليها إلى مقر الشرطة القضائية من أجل التحقق من هويته.",
                  "تستعين الشرطة القضائية بكافة العناصر التي يمكن أن تساعد على تحديد هوية الشخص بما في ذلك الاتصال بعائلته أو مشغله أو معارفه مع مراعاة مقتضيات المادة 10-3-82 بعده.",
                  "يشعر ضابط الشرطة القضائية وكيل الملك بهذا التدبير وكذا أفراد عائلة المعني بالأمر أو محاميه أو كل شخص يختاره المعني بالأمر، وإذا كان المعني بالأمر حدثا يشعر ولي أمره من اللحظة الأولى لإيقافه ويتم الاستماع إليه بحضوره.",
                  "لا يمكن أن يتجاوز إيقاف الشخص من أجل التحقق من هويته الوقت الذي تتطلبه تلك العملية، والتي يتعين ألا تتجاوز في جميع الأحوال أربع ساعات تحتسب من لحظة إيقافه، ويمكن تمديد هذه المدة عند الاقتضاء لأربع ساعات إضافية بإذن من وكيل الملك المختص.",
                  "يمكن لوكيل الملك أن يضع حدا لهذه العملية في أي لحظة."
                ]
              },
              {
                "number": "10-3-82",
                "paragraphs": [
                  "يمكن لضابط الشرطة القضائية في حالة رفض الشخص التعريف بهويته أو في حالة ما إذا أدلى بمعلومات غير صحيحة تتعلق بهويته أو تعذر التعرف عليها بوسائل أخرى، أن يقوم بعد إشعار وكيل الملك بأخذ بصمات أصابعه أو بصماته الجينية أو أخذ صوره بهدف التحقق من هويته."
                ]
              },
              {
                "number": "11-3-82",
                "paragraphs": [
                  "يحرر ضابط الشرطة القضائية محضرا رسميا يبين فيه الأسباب التي تم بموجبها مراقبة والتحقق من هوية الشخص والكيفية والشروط التي تمت بها هذه العملية، وكذا الإجراءات التي بوشرت من أجل التحقق من هويته وساعة إيقافه واقتياده إلى مركز الشرطة وساعة إطلاق سراحه أو وضعه تحت الحراسة النظرية إذا اقتضى الأمر ذلك.",
                  "يجب أن تذيل هذه البيانات إما بتوقيع الشخص المعني بالأمر أو ببصمه وإما بالإشارة إلى رفضه ذلك أو استحالته مع بيان أسباب الرفض أو الاستحالة.",
                  "يحال المحضر إلى وكيل الملك بمجرد الانتهاء من عملية التحقق من الهوية.",
                  "يتم إتلاف المحضر بعد انصرام أجل سنة من تاريخ إنجازه إذا لم يتم تسجيل أي متابعة قضائية أو لم يتم فتح بحث قضائي في مواجهة المعني بالأمر، غير أن البصمات الجينية المأخوذة طبقا لمقتضيات المادة 10-3-82 أعلاه يحتفظ بها من قبل المصالح المختصة."
                ]
              }
            ]
          }
        ]
      },
      {
        "name": "القسم الثاني مكرر",
        "title": "حماية الضحايا والشهود والخبراء والمبلغين",
        "chapters": [
          {
            "name": "الباب الأول",
            "title": "حماية الضحايا",
            "articles": [
              {
                "number": "4-82",
                "paragraphs": [
                  "يتعين إشعار الضحية المتضرر من جريمة بحقه في الانتصاب كمطالب بالحق المدني أمام قاضي التحقيق أو أمام هيئة المحكمة، كما يتعين إشعاره بالحقوق التي يخولها له القانون.",
                  "يشار إلى هذا الإشعار بالمحضر المنجز من طرف الشرطة القضائية، أو من طرف النيابة العامة في الحالة التي يمثل فيها الضحية أمامها."
                ]
              },
              {
                "number": "5-82",
                "paragraphs": [
                  "يقوم وكيل الملك أو الوكيل العام للملك أو قاضي التحقيق كل فيما يخصه باتخاذ تدابير الحماية الكفيلة بتأمين سلامة الضحية أو أفراد أسرته أو أقاربه أو ممتلكاته من كل ضرر قد يتعرض له جراء تقديم شكايته.",
                  "يمكن لهذه الغاية أن يوضع رهن إشارة الضحية رقم هاتفي خاص بالشرطة القضائية أو بالمصالح الأمنية يمكنه الاتصال به في أي وقت لطلب الحماية.",
                  "كما يمكن توفير حماية جسدية له أو لأفراد أسرته أو لأقاربه من طرف القوة العمومية.",
                  "ويمكن أيضا تغيير أماكن الإقامة وعدم إفشاء المعلومات المتعلقة بالهوية.",
                  "يمكن عرض الضحية على أنظار طبيب مختص وتخصيصه بالرعاية الاجتماعية اللازمة عند الاقتضاء.",
                  "إذا كانت تدابير الحماية المذكورة غير كافية، يمكن بقرار معلل اتخاذ أي تدبير آخر يعتبر ضمانة فعلية لفائدة مستحق الحماية.",
                  "يتمتع الضحية الشاهد أو الضحية المبلغ بتدابير الحماية المنصوص عليها في المادتين 6-82 و7-82 أدناه حسب الأحوال."
                ]
              },
              {
                "number": "1-5-82",
                "paragraphs": [
                  "إذا تعلق الأمر بجريمة الاتجار بالبشر، يجب في جميع مراحل البحث والتحقيق والمحاكمة العمل فورا على التعرف على ضحية الجريمة وهويتها وجنسيتها وسنها، ويمكن الاستعانة فيما يتعلق بالتعرف على الضحية بخدمات مكتب المساعدة الاجتماعية.",
                  "يمكن للسلطات القضائية المختصة أن تأمر بمنع المشتبه فيهم أو المتهمين من الاتصال أو الاقتراب من ضحية الاتجار بالبشر.",
                  "تأمر السلطات القضائية المختصة باتخاذ ما يلزم من تدابير لحماية سلامته وتقديم الخدمات الضرورية بما فيها المساعدات الطبية والنفسية اللازمة والإيواء والتعريف بحقوقه القانونية بلغة يفهمها وبحقه في المطالبة بالحصول على تعويض على الأضرار التي لحقت به.",
                  "يمكن لضحية الاتجار بالبشر الاستفادة من مهلة للتعافي والتفكير لا تتجاوز في جميع الأحوال ثلاثين يوما إذا توفرت أسباب جدية بكونه ضحية الفعل الجرمي المذكور، ويتعين في هذه الحالة الالتزام بعدم طرده واستفادته من الخدمات المشار إليها أعلاه ما لم يثبت أن ادعاءه غير صحيح أو أن تواجده يشكل إخلالا بالأمن أو النظام العام، ولا تحول مهلة التعافي والتفكير دون سير الإجراءات القضائية.",
                  "يمكن للسلطات القضائية المختصة الأمر بالترخيص للضحية الأجنبي بالبقاء بتراب المملكة إلى غاية انتهاء إجراءات المحاكمة.",
                  "تسري أحكام الفقرات المتعلقة بالحماية والخدمات على الشهود والخبراء والمبلغين في جريمة الاتجار بالبشر."
                ]
              },
              {
                "number": "2-5-82",
                "paragraphs": [
                  "علاوة على التدابير المنصوص عليها في المادتين 4-82 و5-82 أعلاه، تتخذ في قضايا العنف ضد النساء فورا تدابير الحماية التالية:",
                  "إرجاع المحضون مع حاضنته إلى السكن المعين له من قبل المحكمة.",
                  "إنذار المعتدي بعدم الاعتداء، في حال التهديد بارتكاب العنف، مع تعهده بعدم الاعتداء.",
                  "إشعار المعتدي بأنه يمنع عليه التصرف في الأموال المشتركة للزوجين.",
                  "إحالة الضحية على مراكز الاستشفاء قصد العلاج."
                ]
              },
              {
                "number": "3-5-82",
                "paragraphs": [
                  "يتم إشعار الضحايا لزوما من قبل الجهات القضائية المعروض عليها القضية بالحماية التي يكفلها لهم القانون.",
                  "مع مراعاة دور الخلايا المكلفة بالتكفل بالنساء والأطفال، يتولى مكتب المساعدة الاجتماعية بالمحكمة عملية الاستقبال الأولي للضحايا من النساء والأطفال بمكتب خاص مجهز بما يراعي خصوصية أوضاعهم، ويعمل على تقديم الدعم النفسي لهم والاستماع إليهم ومواكبتهم داخل المحكمة وخارجها عند الاقتضاء.",
                  "يجوز تكليف مكتب المساعدة الاجتماعية بالمحكمة من قبل القضاة، كل حسب اختصاصه، بإجراء الأبحاث الاجتماعية ذات الصلة بالاتجار بالبشر وبقضايا العنف وسوء المعاملة والاعتداءات الجنسية ضد النساء والأطفال والأشخاص في وضعية إعاقة.",
                  "يلتزم المساعدات والمساعدون الاجتماعيون بالحفاظ على السرية."
                ]
              }
            ]
          },
          {
            "name": "الباب الثاني",
            "title": "حماية الشهود والخبراء",
            "articles": [
              {
                "number": "6-82",
                "paragraphs": [
                  "يحق للشاهد أو الخبير في أي قضية، إذا ما كانت هناك أسباب جدية من شأنها أن تعرض حياته أو سلامته الجسدية أو مصالحه الأساسية أو حياة أفراد أسرته أو أقاربه أو سلامتهم الجسدية أو مصالحهم الأساسية للخطر أو لضرر مادي أو معنوي إذا ما أدلى بشهادته أو إفادته، أن يطلب من وكيل الملك أو الوكيل العام للملك أو قاضي التحقيق، حسب الأحوال، تطبيق أحد الإجراءات المنصوص عليها في البنود 6 و7 و8 من المادة 7-82 بعده، وذلك بعد بيان الأسباب المذكورة."
                ]
              },
              {
                "number": "7-82",
                "paragraphs": [
                  "يمكن لوكيل الملك أو الوكيل العام للملك أو قاضي التحقيق كل فيما يخصه، تلقائيا أو بناء على طلب، إذا تعلق الأمر بجريمة الرشوة أو استغلال النفوذ أو الاختلاس أو التبديد أو الغدر أو غسل الأموال أو الاتجار بالبشر أو إحدى الجرائم المنصوص عليها في المادة 108 من هذا القانون، أن يتخذ بقرار معلل واحدا أو أكثر من التدابير التالية لضمان حماية الشهود والخبراء:",
                  "1- الاستماع شخصيا للشاهد أو الخبير.",
                  "2- إخفاء هوية الشاهد أو الخبير في المحاضر والوثائق التي تتعلق بالقضية المطلوب فيها شهادة الشاهد أو إفادة الخبير، وذلك بشكل يحول دون التعرف على هويته الحقيقية.",
                  "3- تضمين هوية مستعارة أو غير صحيحة للشاهد أو الخبير في المحاضر والوثائق التي ستقدم أمام المحكمة بشكل يحول دون تعرف الغير على هويته الحقيقية.",
                  "4- عدم الإشارة إلى العنوان الحقيقي للشاهد أو الخبير ضمن المحاضر والوثائق التي تنجز في القضية المطلوب فيها شهادة الشاهد أو إفادة الخبير، وذلك بشكل يحول دون التعرف على عنوانه.",
                  "5- الإشارة في عنوان إقامة الشاهد أو الخبير إلى مقر الشرطة القضائية التي تم فيها الاستماع إليه أو المحكمة المختصة للنظر في القضية إذا ما كان قد استدعي أول مرة أمام قاضي التحقيق أو المحكمة.",
                  "6- وضع رهن إشارة الشاهد أو الخبير الذي يكون قد أدلى بشهادته أو إفادته رقم هاتفي خاص بالشرطة القضائية حتى يتمكن من إشعارها بالسرعة اللازمة إزاء أي فعل قد يهدد سلامته أو سلامة أسرته أو أقاربه.",
                  "7- إخضاع الهواتف التي يستخدمها الشاهد أو الخبير لرقابة السلطات المختصة بعد موافقة المعني بالأمر كتابة ضمانا لحمايته.",
                  "8- توفير حماية جسدية للشاهد أو الخبير من طرف القوة العمومية بشكل يحول دون تعرض الشاهد أو الخبير أو أحد أفراد أسرته أو أقاربه للخطر.",
                  "إذا كانت تدابير الحماية المذكورة غير كافية، يمكن بقرار معلل اتخاذ أي تدبير آخر يعتبر ضمانة فعلية لفائدة مستحق الحماية."
                ]
              },
              {
                "number": "8-82",
                "paragraphs": [
                  "إلى جانب اتخاذ أحد التدابير المنصوص عليها في البنود من 2 إلى 5 من المادة السابقة، يتعين الاحتفاظ بالهوية الحقيقية للشاهد أو الخبير في ملف خاص يوضع رهن إشارة هيئة المحكمة لتطلع عليه وحدها عند الاقتضاء.",
                  "غير أنه، إذا كان الكشف عن هوية الشخص ضروريا لممارسة حق الدفاع، جاز للمحكمة، إذا اعتبرت أن شهادة الشاهد أو إفادة الخبير أو المبلغ هي وسيلة الإثبات الوحيدة في القضية، السماح بالكشف عن هويته الحقيقية بعد موافقته، شريطة توفير تدابير الحماية الكافية له.",
                  "إذا قررت المحكمة عدم الكشف عن هوية الشخص لا تعتبر شهادة الشاهد أو إفادة الخبير أو المبلغ إلا مجرد معلومات لا تقوم بها حجة بمفردها."
                ]
              }
            ]
          },
          {
            "name": "الباب الثالث",
            "title": "حماية المبلغين",
            "articles": [
              {
                "number": "9-82",
                "paragraphs": [
                  "يحق للمبلغ الذي يقوم بإبلاغ السلطات المختصة لأسباب وجيهة وبحسن نية عن إحدى الجرائم المشار إليها في المادة 7-82 أعلاه، أن يطلب من وكيل الملك أو الوكيل العام للملك أو قاضي التحقيق كل فيما يخصه اتخاذ واحد أو أكثر من التدابير المنصوص عليها في المادة 7-82 أعلاه.",
                  "خلافا لأية مقتضيات قانونية، لا يمكن متابعة المبلغين سواء تأديبيا أو جنائيا على أساس إفشاء السر المهني، إذا كانت الجرائم المبلغ عنها تم الاطلاع عليها بمناسبة مزاولتهم لمهامهم.",
                  "يتعرض المبلغ الذي يقوم بالإبلاغ بسوء نية عن وقائع غير صحيحة لإحدى العقوبات المنصوص عليها في الفصلين 369 و370 من مجموعة القانون الجنائي."
                ]
              }
            ]
          },
          {
            "name": "الباب الرابع",
            "title": "نطاق الحماية",
            "articles": [
              {
                "number": "10-82",
                "paragraphs": [
                  "يمكن لوكيل الملك أو الوكيل العام للملك أو قاضي التحقيق كل فيما يخصه تغيير تدابير الحماية المتخذة لفائدة الضحايا أو الشهود أو الخبراء أو المبلغين أو إضافة تدبير آخر أو أكثر إليها أو إلغاؤها، تلقائيا أو بناء على طلب.",
                  "تستمر تدابير الحماية المأمور بها حتى بعد صدور الحكم إذا اقتضت الضرورة ذلك.",
                  "وفي كل الأحوال، يتعين إخبار المعني بالأمر بالتدبير المتخذ لضمان حمايته."
                ]
              }
            ]
          }
        ]
      },
      {
        "name": "القسم الثالث",
        "title": "التحقيق الإعدادي",
        "chapters": [
          {
            "name": "الباب الأول",
            "title": "أحكام عامة",
            "articles": [
              {
                "number": "83",
                "paragraphs": [
                  "يكون التحقيق في الجنايات اختياريا.",
                  "لا يكون التحقيق في الجنح إلا بنص خاص أو بصفة اختيارية في الجنح المنصوص عليها في المادة 108 من هذا القانون."
                ]
              },
              {
                "number": "84",
                "paragraphs": [
                  "يجري التحقيق بناء على ملتمس من النيابة العامة، ولو كان قاضي التحقيق يقوم بالمهام المخولة إليه في حالة التلبس.",
                  "يمكن تقديم هذا الملتمس ضد شخص معين أو مجهول.",
                  "في حالة تقديم ملتمس بإجراء تحقيق ضد مجهول، يحق لقاضي التحقيق القيام بجميع إجراءات التحقيق الإعدادي، غير أنه لا يجوز الاستماع إلى أي شخص من شأنه أن يفيد في إظهار الحقيقة إلا بصفته شاهدا، ويحق لهذا الأخير الاستعانة بمحاميه.",
                  "إذا تبين من مجريات التحقيق وجود أدلة على تورط أي شخص في الوقائع موضوع التحقيق، فلا يمكن الاستماع إليه بصفته متهما أو اتخاذ أي إجراء في حقه بهذه الصفة قبل رفع الملف إلى النيابة العامة لتقديم ملتمساتها.",
                  "يجب على قاضي التحقيق مراقبة احترام الضمانات القانونية أثناء سير إجراءات التحقيق.",
                  "لا يحق لقاضي التحقيق توجيه التهمة لأي شخص بصفته فاعلا أصليا أو مساهما أو مشاركا في الوقائع المعروضة عليه إلا بناء على ملتمس النيابة العامة.",
                  "إذا علم قاضي التحقيق بوقائع لم يشر إليها في ملتمس إجراء التحقيق، تعين عليه أن يرفع حالا إلى النيابة العامة الشكايات والمحاضر المتعلقة بها.",
                  "في حالة تقديم شكاية مرفقة بالمطالب المدنية للمشتكي، يتم الإجراء وفقا لما نصت عليه المادة 93 بعده."
                ]
              },
              {
                "number": "85",
                "paragraphs": [
                  "يقوم قاضي التحقيق، وفقا للقانون، بجميع إجراءات التحقيق التي يراها صالحة للكشف عن الحقيقة.",
                  "علاوة على الأصول تستخرج من وثائق الإجراءات نسخ مرقمة يشهد بمطابقتها للأصل كاتب الضبط أو ضابط الشرطة القضائية المنتدب بمقتضى المادة 86 الآتية بعده."
                ]
              },
              {
                "number": "86",
                "paragraphs": [
                  "إذا تعذر على قاضي التحقيق أن يقوم شخصيا ببعض إجراءات التحقيق، جاز له بصفة استثنائية أن يكلف بإنابة قضائية ضباطا للشرطة القضائية لتنفيذ هذه الإجراءات، ضمن الشروط ومع مراعاة التحفظات المنصوص عليها في المواد 189 و190 و193 بعده."
                ]
              }
            ]
          },
          {
            "name": "الباب الثاني",
            "title": "القاضي المكلف بالتحقيق",
            "articles": [
              {
                "number": "87",
                "paragraphs": [
                  "يقوم قاضي التحقيق إلزاميا في مادة الجنايات، واختياريا في مادة الجنح، بإجراء بحث حول شخصية المتهم وحالته العائلية والاجتماعية.",
                  "ويقوم قاضي التحقيق أيضا بإجراء بحث حول التدابير الكفيلة بتسهيل إعادة إدماج المتهم في المجتمع، إذا كانت سنه تقل عن عشرين سنة وكانت العقوبة المقررة لا تتجاوز خمس سنوات، وارتأى قاضي التحقيق وضع المتهم تحت الاعتقال الاحتياطي.",
                  "يمكنه أن يعهد بالإجراءات المنصوص عليها في الفقرتين أعلاه إما لضباط الشرطة القضائية أو لمكتب المساعدة الاجتماعية بالمحكمة أو لأي شخص أو مؤسسة مؤهلة للقيام بذلك.",
                  "يترتب عن هذه الأبحاث تكوين ملف خاص يضاف إلى المسطرة.",
                  "يقوم قاضي التحقيق في الجنايات والجنح التي تدر عائدات مالية بإجراء بحث مالي مواز لتحديد الأموال والممتلكات والمتحصلات ومصدرها وتاريخ تملكها وعلاقتها بالجريمة.",
                  "وله أن يأمر بحجز أو عقل أو تجميد الأموال والممتلكات التي يشتبه في كونها متحصلة من الجريمة موضوع التحقيق، حتى وإن كانت بيد شخص آخر، مع مراعاة حقوق الغير حسن النية.",
                  "لا يمكن أن يشمل الحجز الأشياء والممتلكات التي لا علاقة لها بالجريمة، ولاسيما الأجور والمعاشات المستحقة قانونا والتركات والأموال المكتسبة قبل ارتكاب الجريمة والتي لم يثبت أن لها علاقة بها.",
                  "يتعين على قاضي التحقيق اتخاذ كافة الإجراءات والتدابير اللازمة لمنع تأثير إجراءات التجميد أو العقل أو تجميد الحسابات على الأنشطة الاقتصادية والاجتماعية المرتبطة بها، وكذا على الوضع القانوني للأشخاص الذين لا علاقة لهم بالجريمة سواء كانوا أشخاصا ذاتيين أو اعتباريين.",
                  "يمكن لقاضي التحقيق بناء على طلب من يهمه الأمر، وبعد أخذ رأي النيابة العامة، أن يفرض طيلة مدة الحجز نفقة لزوج المشتبه فيه ولأصوله وفروعه ولكل شخص تجب نفقته عليه."
                ]
              },
              {
                "number": "88",
                "paragraphs": [
                  "يمكن لقاضي التحقيق أن يأمر في أي وقت باتخاذ جميع التدابير المفيدة وأن يقرر إجراء فحص طبي أو يكلف طبيبا بالقيام بفحص طبي نفساني.",
                  "يجوز له بعد تلقي رأي النيابة العامة أن يأمر بإخضاع المتهم لعلاج ضد التسمم، إذا ظهر أن هذا الأخير مصاب بتسمم مزمن ناتج عن تعاطي الكحول أو المخدرات أو المواد ذات المؤثرات العقلية.",
                  "يباشر هذا العلاج إما في المؤسسة التي يوجد فيها المتهم رهن الاعتقال وإما في مؤسسة متخصصة حسب الشروط المنصوص عليها قانونا، وتتوقف مسطرة التحقيق أثناء مدة العلاج ويحتفظ سند الاعتقال بمفعوله.",
                  "إذا طلب المتهم أو محاميه إجراء فحوص عليه أو إخضاعه للعلاج، فلا يمكن رفض الطلب إلا بأمر معلل."
                ]
              },
              {
                "number": "89",
                "paragraphs": [
                  "يمكن للنيابة العامة عند وضعها ملتمس فتح التحقيق أن تطلب من قاضي التحقيق القيام بكل إجراء مفيد لإظهار الحقيقة، وبأي إجراء ضروري للحفاظ على الأمن وخاصة وضع المتهم رهن إشارة العدالة.",
                  "يمكنها أن تطلب بملتمسات إضافية القيام بنفس الإجراءات أثناء مراحل التحقيق إلى غاية إنهائه.",
                  "ويمكنها لنفس الغاية أن تطلب تسليمها ملف الإجراءات شريطة إرجاعه إلى قاضي التحقيق في ظرف أربع وعشرين ساعة.",
                  "يتعين على قاضي التحقيق إذا ارتأى ألا موجب للقيام بالإجراءات المطلوبة من طرف النيابة العامة، أن يصدر بذلك أمرا معللا خلال الخمسة أيام الموالية لتقديم ملتمس النيابة العامة، مع مراعاة الفقرة الأخيرة من المادة 134 من هذا القانون."
                ]
              },
              {
                "number": "90",
                "paragraphs": [
                  "إذا تعدد قضاة التحقيق في محكمة واحدة، فإن للنيابة العامة أن تعين من يحقق في كل قضية على حدة."
                ]
              },
              {
                "number": "91",
                "paragraphs": [
                  "يمكن للنيابة العامة إما تلقائيا وإما بناء على طلب من الطرف المدني، كما يمكن أيضا للمتهم تقديم ملتمس معلل للغرفة الجنحية بمحكمة الاستئناف يرمي إلى سحب قضية من قاض للتحقيق وإحالتها إلى قاض آخر للتحقيق ضمانا لحسن سير العدالة.",
                  "يجب أن تبت الغرفة في الطلب داخل عشرة أيام من تاريخ توصلها به، ولا يقبل مقررها أي طعن.",
                  "ليس لهذا الملتمس أي أثر موقف لسير البحث."
                ]
              }
            ]
          },
          {
            "name": "الباب الثالث",
            "title": "تنصيب الطرف المدني",
            "articles": [
              {
                "number": "92",
                "paragraphs": [
                  "يمكن لكل شخص ادعى أنه تضرر من جناية أو جنحة قابلة للتحقيق أن ينصب نفسه طرفا مدنيا عند تقديم شكايته أمام قاضي التحقيق المختص، ما لم ينص القانون على خلاف ذلك.",
                  "تتضمن الشكاية، تحت طائلة عدم القبول، الاسم العائلي والشخصي للمشتكي ومهنته وعنوانه ورقم بطاقة هويته، ووقائع القضية وتاريخ ومكان ارتكاب الفعل، والاسم العائلي والشخصي للمتهم ومهنته وعنوانه عند الاقتضاء، والتكييف القانوني للوقائع.",
                  "ترفق الشكاية عند الاقتضاء بالأدلة والمستندات المدعمة لها.",
                  "يتم وضع الشكاية لدى الرئيس الأول أو رئيس المحكمة، كل حسب اختصاصه، الذي يعين من بين قضاة التحقيق من يتولى مباشرة إجراءات التحقيق."
                ]
              },
              {
                "number": "93",
                "paragraphs": [
                  "يأمر قاضي التحقيق بتبليغ الشكاية إلى وكيل الملك أو الوكيل العام للملك لتقديم ملتمساته.",
                  "يمكن للنيابة العامة إصدار ملتمس ضد شخص معين أو ضد شخص مجهول.",
                  "لا يمكن للنيابة العامة أن تحيل على قاضي التحقيق ملتمسات بعدم إجراء تحقيق، إلا إذا كانت الوقائع المعروضة لا تستوجب قانونا إجراء المتابعة لوجود أسباب تمس الدعوى العمومية، أو إذا كانت الوقائع لا تقبل أي تكييف جرمي حتى لو افترض وجودها، أو لم تكن الجريمة من النوع القابل للتحقيق، أو كان القانون يحدد مسطرة خاصة للمتابعة بالنظر إلى الجريمة نفسها أو إلى صفة المتهم.",
                  "إذا اتخذ قاضي التحقيق موقفا مخالفا لما التمسته النيابة العامة، فعليه أن يصدر بذلك أمرا معللا.",
                  "يمكن للنيابة العامة، في حالة تقديم شكاية لا تدعمها أسباب كافية أو لا تبررها المستندات المقدمة، أن تلتمس من قاضي التحقيق فتح تحقيق مؤقت حول أي شخص قد يكشف عنه البحث.",
                  "يمكن لقاضي التحقيق في هذه الحالة أن يستمع إلى الشخص أو الأشخاص المشار إليهم في الشكاية بصفتهم شهودا، مع مراعاة المادة 118 وإطلاع الشهود على مقتضياتها، وذلك إلى أن يتم توجيه التهم أو، عند الاقتضاء، تقديم ملتمسات جديدة ضد شخص معين."
                ]
              },
              {
                "number": "94",
                "paragraphs": [
                  "يمكن للطرف المدني أن يتقدم بطلباته بعد فتح التحقيق، وفي أية مرحلة من مراحله، وكيفما كان نوع الجريمة.",
                  "يمكن في جميع الأحوال إما للنيابة العامة أو المتهم أو أي طرف مدني آخر أن ينازع في قبول طلبات الطرف المدني.",
                  "تطبق مقتضيات الفقرة الثالثة من المادة 95 بعده إذا كان الطرف المدني هو الذي أقام الدعوى العمومية.",
                  "يبت قاضي التحقيق بأمر قضائي بعد اطلاع النيابة العامة على الملف."
                ]
              },
              {
                "number": "95",
                "paragraphs": [
                  "يمكن لقاضي التحقيق أن يحدد للطرف المدني الذي يقيم الدعوى العمومية وفقا لمقتضيات المادة 92 أعلاه، أجلا لإيداع المبلغ الذي يفترض أنه ضروري لمصاريف الدعوى والذي يكون شاملا للقسط الجزافي، مع مراعاة الإمكانيات المالية للمشتكي.",
                  "يجب على الطرف المدني، تحت طائلة عدم قبول شكايته، إيداع المبلغ داخل الأجل المحدد له، ما لم يكن مستفيدا من المساعدة القضائية أو تم منحه أجلًا إضافيا من قبل قاضي التحقيق.",
                  "إذا أقيمت الدعوى العمومية ضد موظف عمومي أو عون تابع للسلطة أو القوة العمومية، وظهر أن الدولة يمكن أن تتحمل المسؤولية المدنية من جراء أعمال تابعها، يتعين على قاضي التحقيق أن يشعر بإقامتها الوكيل القضائي للمملكة.",
                  "وإذا كانت الدعوى العمومية قد أقيمت ضد موظف للجماعات الترابية أو عضو من أعضاء مجالسها أو هيئاتها، وتبين احتمال قيام مسؤولية الجماعة الترابية عن أعمال تابعها، فإنه يتعين إشعار الوكيل القضائي للجماعات الترابية وفق الشكل المنصوص عليه في الفقرة الأولى من المادة 351 من هذا القانون."
                ]
              },
              {
                "number": "96",
                "paragraphs": [
                  "يجب على كل طرف مدني لا يقيم داخل دائرة نفوذ المحكمة التي يجري فيها التحقيق أن يختار موطنا بدائرة تلك المحكمة.",
                  "إذا لم يختر الطرف المدني موطنا، فلا يمكنه الدفع بعدم تبليغه الإجراءات التي كان يجب تبليغها إليه بمقتضى القانون."
                ]
              },
              {
                "number": "97",
                "paragraphs": [
                  "يتعين على قاضي التحقيق في حالة عدم اختصاصه، أن يصدر بعد تلقي ملتمسات النيابة العامة أمرا بإحالة الطرف المدني ليقيم دعواه أمام الهيئة القضائية المختصة بالنظر فيها."
                ]
              },
              {
                "number": "98",
                "paragraphs": [
                  "إذا صدر أمر بعدم المتابعة بعد فتح تحقيق بناء على طلب من الطرف المدني وأصبح نهائيا، فيمكن للمتهم ولكل الأشخاص المشار إليهم في الشكاية أن يطلبوا من المشتكي تعويضهم عن الضرر أمام المحكمة المدنية المختصة، دون الإخلال بحقهم في متابعته بالوشاية الكاذبة."
                ]
              }
            ]
          },
          {
            "name": "الباب الرابع",
            "title": "التنقل والتفتيش والحجز",
            "articles": [
              {
                "number": "99",
                "paragraphs": [
                  "يجوز لقاضي التحقيق أن ينتقل إلى أي مكان لإجراء المعاينات المفيدة أو للقيام بتفتيش، ويشعر بذلك النيابة العامة التي لممثلها الخيار في مرافقته.",
                  "يساعده في ذلك دائما كاتب الضبط.",
                  "يحرر قاضي التحقيق محضرا بما أنجزه من أعمال."
                ]
              },
              {
                "number": "100",
                "paragraphs": [
                  "يمكن لقاضي التحقيق بعد إخبار النيابة العامة بمحكمته أن ينتقل صحبة كاتب الضبط قصد القيام بإجراءات التحقيق خارج نفوذ المحكمة التي يمارس فيها مهامه إذا استلزمت ذلك متطلبات التحقيق.",
                  "يتعين عليه أن يشعر مقدما النيابة العامة لدى المحكمة التي سينتقل إلى دائرة نفوذها."
                ]
              },
              {
                "number": "101",
                "paragraphs": [
                  "يجري التفتيش في جميع الأماكن التي قد يعثر فيها على أشياء يكون اكتشافها مفيدا لإظهار الحقيقة.",
                  "يجب في هذه الحالة على قاضي التحقيق، تحت طائلة البطلان، أن يتقيد بمقتضيات المواد 59 و60 و62 من هذا القانون."
                ]
              },
              {
                "number": "102",
                "paragraphs": [
                  "إذا كان التفتيش سيجري في منزل المتهم في قضية تتعلق بإحدى الجرائم المنصوص عليها في المادة 108 أدناه، فإنه يجوز لقاضي التحقيق أن يباشره خارج الأوقات المحددة في المادة 62 شريطة أن يقوم به شخصيا وبحضور ممثل النيابة العامة.",
                  "يجوز لقاضي التحقيق في حالة الاستعجال القصوى وبقرار معلل إذا تعلق الأمر بالجرائم المشار إليها في الفقرة الأولى أعلاه أن ينتدب قاضيا أو ضابطا أو أكثر من ضباط الشرطة القضائية لإجراء التفتيش خارج الساعات القانونية بحضور ممثل النيابة العامة."
                ]
              },
              {
                "number": "103",
                "paragraphs": [
                  "إذا كان التفتيش سيجري في غير منزل المتهم، تعين استدعاء رب المنزل أو من يشغله لحضوره، فإن تغيب أو رفض الحضور أجري التفتيش بحضور شخصين من أقاربه أو أصهاره الموجودين بالمكان، وإذا تعذر ذلك، فيتم إجراء التفتيش بحضور شاهدين لا تربطهما علاقة التبعية بالسلطة القضائية أو الشرطة القضائية.",
                  "يجب في حالة إجراء التفتيش في أماكن يشغلها شخص يلزمه القانون بكتمان السر المهني، أن تتخذ جميع التدابير اللازمة لضمان احترام ذلك السر.",
                  "وإذا كان التفتيش أو الحجز سيجرى بمكتب محام، يتولى القيام به قاضي التحقيق أو قاض آخر ينتدبه بحضور نقيب المحامين أو من ينوب عنه أو بعد إشعاره بأي وسيلة من الوسائل الممكنة."
                ]
              },
              {
                "number": "104",
                "paragraphs": [
                  "إذا تبين أثناء التحقيق ما يستوجب البحث عن مستندات أو وثائق أو معطيات أو أدوات أو برامج معلوماتية أو أشياء أخرى، فيجب التقيد بالمقتضيات المنصوص عليها في الفقرة الثالثة من المادة 59، ويكون لقاضي التحقيق وحده أو لضابط الشرطة القضائية المنتدب من طرفه حق الاطلاع عليها قبل حجزها ما لم يتعلق الموضوع بالمس بأمن الدولة الداخلي أو الخارجي.",
                  "يجب على الفور إحصاء جميع المستندات أو الوثائق أو المعطيات أو الأدوات أو البرامج المعلوماتية أو الأشياء الأخرى المحجوزة ووضع الأختام عليها.",
                  "إذا أجري الحجز على نقود أو سبائك أو سندات أو قيم أو أوراق تجارية لم يكن الاحتفاظ بها عينا ضروريا لإظهار الحقيقة أو للمحافظة على حقوق الأطراف، فلقاضي التحقيق أن يأذن لكاتب الضبط في إيداعها إما بصندوق الإيداع والتدبير وإما في بنك المغرب.",
                  "لا يمكن فتح الأختام وفرز المستندات أو الوثائق أو المعطيات أو الأدوات أو البرامج المعلوماتية أو الأشياء الأخرى إلا بحضور المتهم مؤازرا بمحاميه أو بعد استدعائهما قانونيا، ما لم يكن المتهم في حالة فرار أو تعذر حضوره لأي سبب من الأسباب.",
                  "إذا أجري الحجز لدى الغير طبقا للمادة 103 أعلاه، فيدعى هذا الأخير لحضور العملية، ولا يمكن لقاضي التحقيق أن يبقي تحت الحجز سوى المستندات أو الوثائق أو المعطيات أو الأدوات أو البرامج المعلوماتية أو الأشياء الأخرى المفيدة لإظهار الحقيقة والتي قد يضر الكشف عنها بسير التحقيق.",
                  "يأمر قاضي التحقيق بناء على طلب من المعنيين بالأمر أن تسلم لهم في أقرب وقت نسخة من الوثائق المستمر حجزها يصادق كاتب الضبط على مطابقتها للأصل، ما لم يتعارض ذلك مع متطلبات التحقيق.",
                  "يجوز لقاضي التحقيق إذا تعلق الأمر بجريمة من الجرائم التي تمس بحق الملكية العقارية، أن يأمر بعقل العقار، ويمكن الطعن في هذا القرار أمام الغرفة الجنحية داخل أجل ثمانية أيام من تاريخ تبليغه، ولا يوقف الطعن وأجله التنفيذ.",
                  "يترتب عن الأمر الصادر بالعقل منع التصرف في العقار طيلة مدة سريان مفعوله، ويكون كل تصرف بعوض أو بدون عوض مع وجود العقل باطلا وعديم الأثر، ويبقى قاضي التحقيق مختصا لرفعه تلقائيا، أو بناء على طلب من النيابة العامة أو من له مصلحة."
                ]
              },
              {
                "number": "105",
                "paragraphs": [
                  "كل إبلاغ أو إفشاء لمستندات أو وثائق أو معطيات أو أدوات أو برامج معلوماتية أو أشياء أخرى وقع الحصول عليها من تفتيش، يتم لفائدة شخص ليست له صلاحية قانونية للاطلاع عليها دون الحصول على موافقة المشتبه فيه أو ذوي حقوقه أو الموقع عليها أو من وجهت إليه، وكل استعمال آخر لها، يعاقب عليه بالعقوبات المقررة في مجموعة القانون الجنائي."
                ]
              },
              {
                "number": "106",
                "paragraphs": [
                  "يجوز لقاضي التحقيق في حالة عدم وجود منازعة جدية أو عدم توفر وسائل إثبات كافية أن يأمر برد الأشياء والأدوات ووسائل النقل أو الإنتاج التي ضبطت أثناء البحث أو التحقيق لمن له الحق فيها، مع تكليفه عند الاقتضاء بحراستها واتخاذ كافة التدابير لمنع تفويتها، ما لم تكن لازمة لسير الدعوى أو خطيرة.",
                  "يجوز للمتهم وللطرف المدني ولكل شخص آخر يدعي أن له حقوقا على شيء محتفظ به لدى العدالة أو على أشياء أو أموال أو ممتلكات موضوع حجز أو تجميد أو عقل أن يقدم طلبا لقاضي التحقيق لاسترداده أو استرداد ثمنه إذا كان قاضي التحقيق قد قرر بيعه خشية فساده أو تلفه أو لتعذر الاحتفاظ به.",
                  "يبلغ كل طلب قدمه المتهم أو الطرف المدني أو الغير للنيابة العامة ولكل الأطراف الأخرى.",
                  "يجب على هؤلاء تقديم ملاحظاتهم داخل ثلاثة أيام من تاريخ التبليغ.",
                  "يبت قاضي التحقيق بأمر معلل داخل ثمانية أيام فيما قدم له من طلبات، وذلك بعد أخذ رأي النيابة العامة، وله أن يأمر برد الأشياء أو رفع الحجز أو التجميد أو العقل عن الأموال والممتلكات تلقائيا أو بناء على ملتمس من النيابة العامة أو بطلب ممن له مصلحة في ذلك.",
                  "يمكن للأطراف الطعن في قرار قاضي التحقيق أمام الغرفة الجنحية خلال عشرة أيام من تاريخ تبليغه، ولا يترتب عن الطعن أي تأخير في سير التحقيق.",
                  "عندما يكون الطلب صادرا عن الغير، فلمن صدر عنه أن يوجه مثل باقي الأطراف إلى الغرفة الجنحية ملاحظاته مكتوبة، لكن لا يحق له أن يطالب بوضع ملف الإجراءات رهن إشارته."
                ]
              },
              {
                "number": "107",
                "paragraphs": [
                  "يبقى قاضي التحقيق مختصا بالبت في رد الأشياء المحجوزة ولو بعد صدور قرار بعدم المتابعة.",
                  "يمكن الطعن في قراراته أمام الغرفة الجنحية بمحكمة الاستئناف وفقا لما جاء في المادة السابقة."
                ]
              }
            ]
          },
          {
            "name": "الباب الخامس",
            "title": "التقاط المكالمات والاتصالات المنجزة بوسائل الاتصال عن بعد وباقي أشكال الاتصالات الإلكترونية أو المنجزة بواسطة وسائل التكنولوجيا الحديثة",
            "articles": [
              {
                "number": "108",
                "paragraphs": [
                  "يمنع التقاط المكالمات الهاتفية أو الاتصالات المنجزة بوسائل الاتصال عن بعد وباقي أشكال الاتصالات الإلكترونية أو المنجزة بواسطة وسائل التكنولوجيا الحديثة وتسجيلها أو أخذ نسخ منها أو حجزها.",
                  "غير أنه يمكن لقاضي التحقيق إذا اقتضت ضرورة التحقيق ذلك، أن يأمر كتابة بالتقاط المكالمات الهاتفية وكافة الاتصالات المنجزة بواسطة وسائل الاتصال عن بعد وباقي أشكال الاتصالات الإلكترونية أو المنجزة بواسطة وسائل التكنولوجيا الحديثة ومراجع الدعامات المستخدمة في هذه الاتصالات وتسجيلها وأخذ نسخ منها أو حجزها.",
                  "يمكن للوكيل العام للملك تلقائيا إذا تعلق الأمر بجناية أو جنحة مرتبطة بها أو غير قابلة للتجزئة، أو بناء على ملتمس من وكيل الملك إذا تعلق الأمر بجنحة، واقتضت ذلك ضرورة البحث، أن يلتمس كتابة من الرئيس الأول لمحكمة الاستئناف إصدار أمر بالتقاط المكالمات الهاتفية أو الاتصالات المنجزة بوسائل الاتصال عن بعد وباقي أشكال الاتصالات الإلكترونية أو المنجزة بواسطة وسائل التكنولوجيا الحديثة ومراجع الدعامات المستخدمة في هذه الاتصالات وتسجيلها وأخذ نسخ منها أو حجزها، وذلك إذا كانت الجريمة موضوع البحث تمس بأمن الدولة أو جريمة إرهابية أو جريمة تتعلق بالعصابة الإجرامية، أو بالقتل أو التسميم، أو بالاختطاف وأخذ الرهائن، أو بالمخدرات والمؤثرات العقلية، أو بالأسلحة والذخيرة والمتفجرات ومعدات التدمير أو مواد متفجرة أو نووية أو بيولوجية أو كيميائية أو مشعة، أو بحماية الصحة العامة، أو جرائم غسل الأموال أو الرشوة أو استغلال النفوذ أو الغدر أو اختلاس أو تبديد المال العام، أو الجرائم الماسة بنظم المعالجة الآلية للمعطيات أو المرتكبة بالوسائل الإلكترونية، أو التعذيب أو الاتجار بالبشر أو الهجرة غير المشروعة أو الاستغلال الجنسي، أو الجرائم المرتكبة ضد الأطفال، أو جرائم التخريب أو التعييب والإتلاف أو تحويل الطائرات أو إتلافها أو إتلاف المنشآت الجوية، أو جرائم التزييف والتزوير، أو انتحال الهوية الرقمية للغير بغرض تهديد طمأنينته أو المساس بشرفه أو اعتباره، أو نقل أو بث أو نشر محتوى إلكتروني ذي طابع إباحي موجه للقاصرين، أو الجرائم الانتخابية.",
                  "غير أنه يجوز للوكيل العام للملك في حالة الاستعجال القصوى بصفة استثنائية أن يأمر كتابة بالتقاط المكالمات الهاتفية أو الاتصالات المنجزة بوسائل الاتصال عن بعد وباقي أشكال الاتصالات الإلكترونية أو المنجزة بواسطة وسائل التكنولوجيا الحديثة ومراجع الدعامات المستخدمة في هذه الاتصالات وتسجيلها وأخذ نسخ منها وحجزها، متى كانت ضرورة البحث تقتضي التعجيل خوفا من اندثار وسائل الإثبات، إذا كانت الجريمة تتعلق بإحدى الجرائم المشار إليها في الفقرة السابقة.",
                  "يجب على الوكيل العام للملك أن يشعر الرئيس الأول بالأمر الصادر عنه.",
                  "يصدر الرئيس الأول خلال أجل أربع وعشرين ساعة مقررا بتأييد أو تعديل أو إلغاء قرار الوكيل العام للملك، وفقا للشروط والكيفيات المنصوص عليها في هذه المادة وما يليها إلى المادة 114 بعده.",
                  "إذا ألغى الرئيس الأول الأمر الصادر عن الوكيل العام للملك، فإن التقاط المكالمات الهاتفية أو الاتصالات المشار إليها أعلاه يتم إيقافه على الفور، وتعتبر الإجراءات المنجزة تنفيذا للأمر الملغى كأن لم تكن.",
                  "ولا يقبل المقرر الصادر عن الرئيس الأول بشأن قرار الوكيل العام للملك أي طعن.",
                  "تتم العمليات المأمور بها طبقا لمقتضيات هذه المادة تحت سلطة ومراقبة قاضي التحقيق أو تحت سلطة ومراقبة الوكيل العام للملك حسب الأحوال.",
                  "تكون باطلة في جميع الأحوال إجراءات الالتقاط التي تتم خرقا لمقتضيات هذه المادة."
                ]
              },
              {
                "number": "109",
                "paragraphs": [
                  "يجب أن يتضمن المقرر الذي يتخذ طبقا للمادة 108 أعلاه كل العناصر التي تعرف بالمكالمات الهاتفية أو الاتصالات المنجزة بواسطة وسائل التكنولوجيا الحديثة أو بالمراسلات المراد التقاطها أو البيانات الإلكترونية المستهدفة من العملية بغرض تسجيلها أو أخذ نسخ منها أو حجزها، والجريمة التي تبرر ذلك، والمدة التي تتم فيها العملية.",
                  "لا يمكن أن تتجاوز المدة المذكورة في الفقرة الأولى من هذه المادة أربعة أشهر قابلة للتجديد مرتين ضمن نفس الشروط المشار إليها في المادة 108 أعلاه."
                ]
              },
              {
                "number": "110",
                "paragraphs": [
                  "يمكن للسلطة القضائية المكلفة بالبحث أو التحقيق، أو لضابط الشرطة القضائية الذي تعينه، أن تطلب من كل عون مختص تابع لمصلحة أو لمؤسسة موضوعة تحت سلطة أو وصاية الوزارة المكلفة بالاتصالات والمراسلات، أو من أي عون مكلف باستغلال شبكة أو مزود مسموح له بخدمات الاتصال، وضع جهاز للالتقاط."
                ]
              },
              {
                "number": "111",
                "paragraphs": [
                  "تحرر السلطة القضائية المكلفة بالبحث أو التحقيق، أو ضابط الشرطة القضائية المكلف من طرفها، محضرا عن كل عملية من عمليات التقاط الاتصالات والمراسلات المرسلة بواسطة وسائل الاتصال عن بعد وباقي أشكال الاتصالات الإلكترونية أو المنجزة بواسطة وسائل التكنولوجيا الحديثة ومراجع الدعامات المستخدمة في هذه الاتصالات وتسجيلها وأخذ نسخ منها وحجزها، ويبين في هذا المحضر تاريخ بداية العملية وتاريخ نهايتها.",
                  "توضع التسجيلات والمراسلات في وعاء أو غلاف مختوم."
                ]
              },
              {
                "number": "112",
                "paragraphs": [
                  "تنقل السلطة القضائية المكلفة بالبحث أو التحقيق أو الضابط المكلف من طرفها كتابة محتويات الاتصال المفيدة لإظهار الحقيقة التي لها علاقة بالجريمة، وتحرر محضرا عن هذا النقل يوضع في ملف القضية، ويمكن الاستعانة بذوي الاختصاص للتعرف على الرموز والألغاز.",
                  "تنقل كتابة الاتصالات والمراسلات التي تمت بلغة أجنبية إلى اللغة العربية بمساعدة ترجمان يسخر لهذا الغرض، ويؤدي اليمين كتابة على أن يترجم بأمانة وألا يفشي أسرار البحث والمراسلات، إن لم يكن مسجلا بجدول التراجمة المقبولين لدى المحاكم."
                ]
              },
              {
                "number": "113",
                "paragraphs": [
                  "يتم بمبادرة من قاضي التحقيق أو من النيابة العامة المختصة إتلاف التسجيلات والمراسلات عند انصرام أجل تقادم الدعوى العمومية أو بعد اكتساب الحكم الصادر في الدعوى قوة الشيء المقضي به.",
                  "يحرر محضر عن عملية الإتلاف يحفظ بملف القضية."
                ]
              },
              {
                "number": "114",
                "paragraphs": [
                  "يمكن، قصد القيام بعمليات التقاط الاتصالات المأذون بها وتسجيلها وأخذ نسخ منها وحجزها، الحصول على المعلومات والوثائق الضرورية للتعرف على الاتصال الذي سيتم التقاطه من أي مستغل لشبكة عامة أو مصلحة للاتصالات المشار إليها في القانون رقم 24.96 المتعلق بالبريد والمواصلات الصادر بتنفيذه الظهير الشريف رقم 1.97.162 بتاريخ 2 ربيع الثاني 1418 (7 أغسطس 1997)."
                ]
              },
              {
                "number": "115",
                "paragraphs": [
                  "دون الإخلال بالمقتضيات الجنائية الأشد، يعاقب بالحبس من شهر إلى سنة وبالغرامة من 10.000 درهم إلى 100.000 درهم أو بإحدى هاتين العقوبتين فقط كل من قام بوضع وسائل مهيأة لإنجاز التقاطات أو التقط أو بدد أو استعمل أو نشر مراسلات مرسلة بواسطة وسائل الاتصال عن بعد وباقي أشكال الاتصالات الإلكترونية أو المنجزة بواسطة وسائل التكنولوجيا الحديثة ومراجع الدعامات المستخدمة في هذه الاتصالات خلافا للمقتضيات المشار إليها في المواد السابقة.",
                  "دون الإخلال بالعقوبات الجنائية الأشد، تكون العقوبة السجن من خمس إلى عشر سنوات إذا ارتكبت الأفعال المشار إليها في الفقرة الأولى من هذه المادة لغرض إرهابي."
                ]
              },
              {
                "number": "116",
                "paragraphs": [
                  "يعاقب بنفس العقوبات كل عون من أعوان السلطة العمومية، أو أجير لدى شبكة عمومية للاتصالات أو لدى مزود بخدمات الاتصالات، قام بمناسبة ممارسة مهامه بالكشف عن وجود التقاط أو أمر أو ارتكب أو سهل التقاط أو تبديد مراسلات مرسلة بواسطة وسائل الاتصال عن بعد وباقي أشكال الاتصالات الإلكترونية أو المنجزة بواسطة وسائل التكنولوجيا الحديثة ومراجع الدعامات المستخدمة في هذه الاتصالات."
                ]
              }
            ]
          },
          {
            "name": "الباب الخامس مكرر",
            "title": "التقاط وتثبيت وبث وتسجيل الأصوات والصور والمعطيات الإلكترونية وتحديد المواقع",
            "articles": [
              {
                "number": "1-116",
                "paragraphs": [
                  "يمكن للوكيل العام للملك أو لقاضي التحقيق كل فيما يخصه، طبقا للشروط والكيفيات المنصوص عليها في المادة 108 أعلاه، أن يأذن لضباط الشرطة القضائية بموجب مقرر كتابي معلل بوضع الوسائل التقنية اللازمة لتحديد مواقع المشتبه فيهم ورصد تحركاتهم، أو بالتقاط وتثبيت وبث وتسجيل العبارات المتفوه بها من قبل شخص أو عدة أشخاص في أماكن أو وسائل نقل خاصة أو عمومية، أو بالتقاط صور لشخص أو عدة أشخاص في مكان خاص أو عام وأخذ نسخ منها أو حجزها، أو استعمال أدوات تقنية بهدف الولوج لجميع الأماكن ودون علم أو موافقة المعنيين بذلك إلى المعطيات الإلكترونية أو البيانات المخزنة أو المطلع عليها بواسطة الاتصالات الإلكترونية بمعرف شبكي الاتصال أو غيرها من الشبكات المماثلة وتسجيلها وحفظها وإرسالها بالشكل الذي كانت محفوظة عليه بالنظام المعلوماتي أو بالشكل الذي كانت تظهر عليه بشاشة مستخدم المعالجة الآلية للمعطيات أو بالشكل الذي أدخلت فيه عبر القن أو بالشكل الذي تم استبدالها أو إرسالها به بواسطة الجهاز المستخدم.",
                  "تكون الإجراءات المشار إليها في الفقرة السابقة باطلة إذا تمت خرقا لمقتضيات هذه المادة."
                ]
              },
              {
                "number": "2-116",
                "paragraphs": [
                  "يجب أن يتضمن المقرر المتخذ طبقا للمادة 1-116 أعلاه كل العناصر التي تعرف بوسائل النقل أو الأماكن أو الشخص الذي سيحمل الأجهزة التقنية للالتقاط، والجريمة التي تبرر ذلك، والمدة التي تتم فيها العملية.",
                  "لا يمكن أن تتجاوز المدة المذكورة ثلاثة أشهر قابلة للتجديد مرة واحدة.",
                  "تخضع إجراءات وضع الوسائل التقنية اللازمة لتنفيذ المقرر المتخذ طبقا للمادة 1-116 أعلاه للشروط والإجراءات المبينة في المواد من 110 إلى 113 أعلاه، وتتم تحت سلطة ومراقبة الجهة القضائية التي أمرت بها."
                ]
              },
              {
                "number": "3-116",
                "paragraphs": [
                  "يمكن للوكيل العام للملك أو لوكيل الملك أو لقاضي التحقيق لأجل وضع الوسائل التقنية اللازمة لتنفيذ المقرر المتخذ طبقا للمادة 1-116 أعلاه الإذن بالدخول إلى وسيلة النقل أو المكان الخاص، ولو خارج الساعات المحددة في المادة 62 من هذا القانون، بدون علم أو رضى مالك أو حائز وسيلة النقل أو مالك أو حائز أو محتل المكان أو كل شخص صاحب حق عليه.",
                  "إذا تعلق الأمر بوضع الوسائل التقنية المشار إليها في المادة 1-116 أعلاه بأماكن معدة لاستعمال مهني يشغلها شخص يلزمه القانون بكتمان السر المهني، فإنه يجب اتخاذ جميع التدابير اللازمة لضمان احترام السر المهني."
                ]
              },
              {
                "number": "4-116",
                "paragraphs": [
                  "يمنع وضع الوسائل التقنية المشار إليها في المادة 1-116 أعلاه بالأماكن المعدة للسكنى."
                ]
              },
              {
                "number": "5-116",
                "paragraphs": [
                  "يتم تفريغ محتوى التسجيلات والمعطيات الإلكترونية أو البيانات المخزنة أو المطلع عليها بواسطة الاتصالات الإلكترونية في محضر يضم إلى ملف القضية."
                ]
              },
              {
                "number": "6-116",
                "paragraphs": [
                  "دون الإخلال بالمقتضيات الجنائية الأشد، يعاقب بالعقوبات المقررة في الفقرة الأولى من المادة 115 أعلاه كل من قام بوضع الوسائل التقنية الواردة في هذا الباب خلافا للمقتضيات المشار إليها في المواد من 1-116 إلى 4-116 أعلاه.",
                  "دون الإخلال بالعقوبات الجنائية الأشد، تكون العقوبة السجن من خمس إلى عشر سنوات إذا ارتكبت الأفعال المشار إليها في الفقرة الأولى من هذه المادة لغرض إرهابي.",
                  "ويعاقب بالعقوبات المشار إليها في الفقرة الأولى من هذه المادة كل من قام بوضع الوسائل التقنية أو شارك في ذلك أو علم بوضعها بسبب مهنته أو وظيفته وقام بالكشف عن وجودها أو بتعطيلها أو إفسادها أو إزالتها أو أمر بذلك أو سهله خلافا للأحكام المنصوص عليها في هذا الباب."
                ]
              }
            ]
          },
          {
            "name": "الباب السادس",
            "titlle": "الاستماع إلى الشهود",
            "articles": [
              {
                "number": "117",
                "paragraphs": [
                  "يوجه قاضي التحقيق تلقائيا أو بناء على طلب من أحد الأطراف بواسطة أحد أعوان القوة العمومية استدعاء لأي شخص يرى فائدة لسماع شهادته قصد الحضور أمامه، وتسلم له نسخة من الاستدعاء.",
                  "يمكن استدعاء الشهود أيضا بواسطة الأعوان القضائيين أو برسالة مضمونة أو بالطريقة الإدارية أو بأي وسيلة اتصال أو تقنية تترك أثرا كتابيا، كما يمكنهم الحضور بمحض إرادتهم."
                ]
              },
              {
                "number": "118",
                "paragraphs": [
                  "يتعين على كل شخص استدعي لسماعه بصفته شاهدا أن يحضر ويؤدي اليمين القانونية عند الاقتضاء وأن يدلي بشهادته، وذلك تحت طائلة العقوبات المقررة في القانون.",
                  "غير أنه يمكن للشخص الموجهة ضده شكاية مرفقة بالمطالبة بالحق المدني أن يرفض سماعه بصفة شاهد، وعلى قاضي التحقيق أن يشعره بهذا الحق وأن يطلعه على الشكاية ويضمن هذا الإجراء في المحضر، وفي حالة الرفض لا يمكن سماع الشخص المذكور إلا بصفته متهما."
                ]
              },
              {
                "number": "119",
                "paragraphs": [
                  "يستمع قاضي التحقيق بمساعدة كاتب الضبط إلى كل شاهد على حدة وبدون حضور المتهم.",
                  "ولا يحول ذلك في جميع الأحوال دون الاستماع إلى الشاهد من جديد من طرف هيئة الحكم تلقائيا أو بناء على ملتمس من النيابة العامة أو بطلب من أحد الأطراف أو دفاعهم.",
                  "يحرر محضر بتصريح كل شاهد."
                ]
              },
              {
                "number": "120",
                "paragraphs": [
                  "إذا كان الشهود يتكلمون لغة أو لهجة أو لسانا يصعب فهمه على المتهمين أو الأطراف أو الشهود الآخرين أو قاضي التحقيق، فإن قاضي التحقيق يستعين إما تلقائيا وإما بناء على طلب من المتهم أو الأطراف بكل شخص قادر على الترجمة، شريطة أن يكون بالغا من العمر ثماني عشرة سنة وغير مدعو لأداء شهادته في القضية.",
                  "إذا كان الترجمان غير محلف وجب أن يؤدي أمام قاضي التحقيق يمينا على أن يترجم بأمانة.",
                  "إذا أثير أثناء القيام بالترجمة نزاع يتعلق بأمانتها، فلِقاضي التحقيق أن يقرر ما إذا كان من الملائم تعيين ترجمان آخر."
                ]
              },
              {
                "number": "121",
                "paragraphs": [
                  "توجه الأسئلة وترد الأجوبة عنها كتابة إذا كان الشاهد أصما أو أبكما، فإذا كان لا يعرف الكتابة يساعده شخص اعتاد التحدث معه، فإن لم يكن من يساعده حاضرا فأي شخص قادر على التفاهم معه، وتسري على هذا الشخص المقتضيات المنصوص عليها في الفقرتين الثانية والثالثة من المادة 120 أعلاه.",
                  "يضمن في المحضر اسم الترجمان العائلي والشخصي وسنه ومهنته ومحل سكناه واليمين التي أداها، ويوقع المحضر الترجمان نفسه أو يضع بصمته أو يشار إلى تعذر ذلك."
                ]
              },
              {
                "number": "122",
                "paragraphs": [
                  "يطلب من الشهود، قبل سماع شهادتهم حول الوقائع، أن يبينوا أسماءهم العائلية والشخصية وسنهم وحالتهم العائلية ومهنتهم ومحل سكناهم، وعند الاقتضاء قبيلتهم والفخذة التي ينتمون إليها، وما يربطهم بالأطراف من قرابة أو مصاهرة ودرجة هذه العلاقة إن وجدت، وما إذا كانوا يعملون تحت إمرة أحد الأطراف أو هم من فاقدي الأهلية.",
                  "ينص في المحضر على هذه الأسئلة والأجوبة عنها.",
                  "يجوز أن تتلى على الشهود المقتضيات الجنائية المتعلقة بالمعاقبة على شهادة الزور."
                ]
              },
              {
                "number": "123",
                "paragraphs": [
                  "يؤدي كل شاهد بعد ذلك اليمين حسب الصيغة التالية: «أقسم بالله العظيم على أن أشهد بدون حقد ولا خوف، وأن أقول الحق كل الحق، وأن لا أشهد إلا بالحق».",
                  "تسمع شهادة القاصرين الذين لم يبلغوا الثامنة عشرة من عمرهم، وكذا الأشخاص المحكوم عليهم بعقوبة جنائية، دون يمين.",
                  "يعفى أصول المتهم وفروعه وزوجه من أداء اليمين.",
                  "يستمع للضحية بصفته هذه دون أداء اليمين القانونية، للتأكد مما هو معروض على قاضي التحقيق من وقائع.",
                  "لا يعد سببا للبطلان أداء اليمين من شخص معفى منها أو فاقد الأهلية أو محروم من أداء الشهادة."
                ]
              },
              {
                "number": "124",
                "paragraphs": [
                  "يدعى الشاهد بمجرد الانتهاء من أداء شهادته إلى قراءة نصها كما نقلت عنه، فإن تمسك بما صرح به يطلب منه التوقيع وتذييل كل صفحة على حدة.",
                  "إذا كان الشاهد أميا، يتلو عليه كاتب الضبط نص الشهادة ثم يضع الشاهد بصمته على كل صفحة بدلا من تذييل الصفحات والتوقيع عليها.",
                  "إذا رفض الشاهد التوقيع أو وضع البصمة أو تعذر عليه ذلك، نص على ذلك في المحضر.",
                  "يوقع القاضي وكاتب الضبط على كل صفحة، وكذلك الترجمان إن تمت الاستعانة به."
                ]
              },
              {
                "number": "125",
                "paragraphs": [
                  "يمكن لقاضي التحقيق أن يستجوب الشاهد وأن يجري مواجهة بينه وبين شهود آخرين أو المتهمين بحضور دفاعهم ما لم يتنازلوا عن ذلك صراحة.",
                  "يمكنه أيضا إشراكهم في كل تشخيص للجريمة وفي كل العمليات المفيدة لإظهار الحقيقة."
                ]
              },
              {
                "number": "126",
                "paragraphs": [
                  "يجب ألا تتضمن المحاضر أي كتابة بين السطور، ويصادق قاضي التحقيق وكاتب الضبط والشاهد، وعند الاقتضاء الترجمان، على ما يقع من تشطيبات وما يلحق بالهامش، وفي حال عدم المصادقة عليها تعتبر كأن لم تكن.",
                  "يسري نفس الحكم على المحضر الذي لم يوقع بكيفية صحيحة وعلى الصفحات التي لم تذيل أو لم يقع بصمها من الشاهد، ما لم ينص المحضر على تعذر ذلك وفقا للمادة 121 أعلاه."
                ]
              },
              {
                "number": "127",
                "paragraphs": [
                  "يحق لكل شاهد حضر لأداء الشهادة أن يحصل بناء على طلبه على تعويض عن الحضور، وعند الاقتضاء تعويض عن الإقامة.",
                  "وله أيضا أن يسترد مصاريف السفر.",
                  "تؤدى هذه التعويضات والمصاريف فورا بعد أن يحددها قاضي التحقيق وفقا للتعريفة القانونية."
                ]
              },
              {
                "number": "128",
                "paragraphs": [
                  "إذا لم يحضر الشاهد ثم وجه إليه استدعاء ثان، إما برسالة مضمونة مع إشعار بالاستلام أو باستدعاء بلغ بصفة قانونية بواسطة عون للتبليغ أو عون قضائي أو بطريقة إدارية وبقي دون جدوى، جاز لقاضي التحقيق بناء على ملتمسات النيابة العامة أن يجبره على الحضور بواسطة القوة العمومية وأن يصدر في حقه أمرا بأداء غرامة تتراوح بين 1.200 و12.000 درهم.",
                  "غير أنه إذا حضر الشاهد فيما بعد وقدم اعتذارا أو مبررا، فيمكن لقاضي التحقيق بناء على ذلك إعفاؤه من الغرامة كليا أو جزئيا بعد تقديم ملتمس النيابة العامة.",
                  "ويمكن بناء على ملتمسات النيابة العامة إصدار نفس العقوبة على الشاهد الذي يمتنع رغم حضوره من أداء اليمين أو من الإدلاء بشهادته، ويمكن إعفاؤه من الغرامة كليا أو جزئيا إذا عدل عن امتناعه قبل انتهاء التحقيق.",
                  "وتصدر العقوبة المنصوص عليها في هذه المادة بموجب أمر قضائي غير قابل لأي طعن."
                ]
              },
              {
                "number": "129",
                "paragraphs": [
                  "تنفذ الشرطة أو الدرك الملكي بناء على تسخير موجه من قاضي التحقيق التدبير المتخذ لإجبار الشاهد المتخلف عن الحضور.",
                  "ويقدم الشاهد فورا ومباشرة إلى القاضي الذي اتخذ التدبير."
                ]
              },
              {
                "number": "130",
                "paragraphs": [
                  "يعاقب بالحبس من شهر إلى ثلاثة أشهر وبغرامة من 1.200 إلى 10.000 درهم أو بإحدى هاتين العقوبتين فقط كل شخص صرح علانية بأنه يعرف مرتكب جناية أو جنحة ورفض الجواب على الأسئلة الموجهة إليه في هذا الصدد من قاضي التحقيق."
                ]
              },
              {
                "number": "131",
                "paragraphs": [
                  "إذا كان الشاهد يقيم بالدائرة القضائية لقاضي التحقيق وادعى تعذر حضوره أمامه، فإن قاضي التحقيق ينتقل لسماع شهادته أو يصدر لهذه الغاية إنابة قضائية وفقا للشكل المنصوص عليه في المادة 189 بعده.",
                  "إذا كان الشاهد يقيم خارج الدائرة القضائية لقاضي التحقيق، فإن القاضي يطلب من نظيره بالمحكمة التي يقيم الشاهد في دائرة نفوذها أن ينتقل إلى محل إقامة الشاهد للقيام بسماع شهادته.",
                  "إذا كان الشاهد لا يقيم في المكان الموجود فيه مقر القاضي المنتدب، فيمكن للقاضي أن يكلف أحد ضباط الشرطة القضائية للقيام بسماع الشهادة.",
                  "ترسل التصريحات المتلقاة تنفيذا للفقرات السابقة مباشرة داخل ظرف مختوم إلى قاضي التحقيق المكلف بالقضية."
                ]
              },
              {
                "number": "132",
                "paragraphs": [
                  "إذا تبين لقاضي التحقيق عدم صحة ما ادعاه الشاهد من تعذر الحضور، أمكن له أن يحكم عليه بغرامة تتراوح بين 2.000 و10.000 درهم."
                ]
              },
              {
                "number": "133",
                "paragraphs": [
                  "تطبق أثناء التحقيق الإعدادي مقتضيات المادتين 326 و327 من هذا القانون فيما يتعلق بشهادة رئيس الحكومة وباقي أعضاء الحكومة وممثلي الدول الأجنبية، ومقتضيات المواد من 1-347 إلى 6-347 من هذا القانون والمتعلقة بالاستماع إلى الشهود عن طريق تقنية الاتصال عن بعد.",
                  "تطبق أيضا أثناء التحقيق الإعدادي مقتضيات القسم الثاني مكرر من الكتاب الأول من هذا القانون المتعلق بحماية الضحايا والشهود والخبراء والمبلغين."
                ]
              }
            ]
          },
          {
            "name": "الباب السابع ",
            "titlle": "استنطاق المتهم ومواجهته مع الغير",
            "articles": [
              {
                "number": "134",
                "paragraphs": [
                  "يطلب قاضي التحقيق من المتهم بمجرد مثوله الأول أمامه بيان اسمه العائلي والشخصي ونسبه وتاريخ ومكان ولادته وحالته العائلية ومهنته ومكان إقامته وسوابقه القضائية. وله عند الاقتضاء أن يأمر بكل التحريات للتحقق من هوية المتهم، بما في ذلك عرضه على مصلحة التشخيص القضائي أو إخضاعه للفحص الطبي.",
                  "يشعر القاضي المتهم فورا بحقه في اختيار محام، فإن لم يستعمل حقه في الاختيار عين له قاضي التحقيق بناء على طلبه محاميا ليؤازره في إطار المساعدة القضائية، وينص على ذلك في المحضر.",
                  "يحق للمحامي أن يحضر الاستنطاق المتعلق بالتحقيق في هوية المتهم.",
                  "يبين قاضي التحقيق للمتهم الأفعال المنسوبة إليه ويشعره بأنه حر في عدم الإدلاء بأي تصريح، ويشار إلى ذلك في المحضر.",
                  "يجب على قاضي التحقيق أن يستجيب لطلب المتهم الذي كان موضوعا تحت الحراسة النظرية أو لطلب دفاعه الرامي إلى إخضاعه لفحص طبي، ويتعين عليه أن يأمر به تلقائيا إذا لاحظ على المتهم علامات تبرر إجراءه، ويعين لهذه الغاية خبيرا في الطب.",
                  "علاوة على ذلك، ينبه القاضي المتهم إلى وجوب إخباره بكل تغيير في عنوانه، ويمكن للمتهم أن يختار محلا للمخابرة معه في دائرة نفوذ المحكمة.",
                  "إذا طالبت النيابة العامة في ملتمسها بفتح التحقيق بإصدار أمر بإيداع المتهم في السجن، وارتأى قاضي التحقيق أن لا داعي للاستجابة لهذا الطلب، فإنه يجب عليه إصدار أمر بذلك داخل أربع وعشرين ساعة، يبلغه فورا إلى النيابة العامة."
                ]
              },
              {
                "number": "135",
                "paragraphs": [
                  "يجوز لقاضي التحقيق بالرغم من مقتضيات المادة السابقة أن يقوم فورا بإجراء أي استجواب أو مواجهة إذا دعت لذلك حالة الاستعجال الناتجة إما عن ظروف شاهد يهدده خطر الموت، وإما لأن علامات موجودة أصبحت على وشك الاندثار.",
                  "يجب أن ينص في المحضر على أسباب الاستعجال."
                ]
              },
              {
                "number": "136",
                "paragraphs": [
                  "يحق للمتهم المعتقل بمجرد مثوله لأول مرة أمام قاضي التحقيق أن يتصل بحرية بمحاميه.",
                  "يمكن لقاضي التحقيق أن يأمر بمنع اتصال المتهم بالغير لمدة عشرة أيام قابلة للتجديد مرة واحدة فقط.",
                  "لا يسري المنع من الاتصال على محامي المتهم في جميع الأحوال."
                ]
              },
              {
                "number": "137",
                "paragraphs": [
                  "يمكن للطرف المدني الذي نصب نفسه بكيفية صحيحة قانونا أن يستعين بمحام بمجرد البدء في أول استماع لتصريحاته.",
                  "يستمع للمطالب بالحق المدني دون أدائه اليمين القانونية."
                ]
              },
              {
                "number": "138",
                "paragraphs": [
                  "يمكن للمتهم وللطرف المدني أثناء جميع مراحل التحقيق إخبار قاضي التحقيق باسم المحامي الذي وقع عليه اختيار كل واحد منهما."
                ]
              },
              {
                "number": "139",
                "paragraphs": [
                  "لا يجوز سماع المتهم أو الطرف المدني أو مواجهتهما في أي مرحلة إلا بحضور محامي كل منهما أو بعد استدعاء هؤلاء المحامين بصفة قانونية، ما لم يتنازل أحد الطرفين أو كلاهما صراحة عن مؤازرة الدفاع.",
                  "يستدعى المحامي عشرة أيام على الأقل قبل كل استنطاق إما برسالة مضمونة أو بإشعار يسلم إليه مقابل وصل أو بأي وسيلة اتصال أو تقنية تترك أثرا كتابيا ما لم يكن قد تم إشعاره في جلسة سابقة للتحقيق وأثبت ذلك في المحضر.",
                  "يجب أن يوضع ملف القضية ورقيا أو على دعامة إلكترونية رهن إشارة محامي المتهم ومحامي الطرف المدني قبل كل استنطاق أو استماع.",
                  "يمكن للنيابة العامة أن تقدم ما تراه ملائما من ملتمسات.",
                  "يمكن لكل من محامي المتهم ومحامي الطرف المدني الحصول على نسخة من محضر الشرطة القضائية وباقي وثائق الملف.",
                  "يجوز لقاضي التحقيق تلقائيا أو بناء على ملتمسات النيابة العامة، إذا اقتضت مصلحة التحقيق ذلك وتعلق الأمر بجرائم أمن الدولة أو الإرهاب، أن يأمر بعدم تسليم نسخة من المحضر أو باقي وثائق الملف كليا أو جزئيا لمدة لا تتجاوز خمسة عشر يوما ابتداء من تاريخ الاستنطاق الابتدائي.",
                  "يقبل أمر قاضي التحقيق الصادر بالقبول أو الرفض الاستئناف خلال اليوم الموالي لصدوره طبقا للمقتضيات المتعلقة باستئناف أوامر قاضي التحقيق.",
                  "يستمر أمر المنع الصادر عن قاضي التحقيق إذا تعلق الأمر بالطعن بالاستئناف في أحد قراراته أمام الغرفة الجنحية التي يتعين على رئيسها المحافظة على سرية الملف والوثائق المدرجة به طيلة مراحل المسطرة.",
                  "لا يجوز في هذه الحالة استنطاق المتهم تفصيليا إلا بعد مرور أجل خمسة عشر يوما على وضع الملف كاملا رهن إشارة المحامي المعني بالأمر للحصول على نسخة من المحضر والوثائق.",
                  "يمنع على المحامي تسليم نسخة من المحضر أو الوثائق التي حصل عليها للغير، وذلك تحت طائلة العقوبات المقررة في الفصل 446 من مجموعة القانون الجنائي.",
                  "إذا نص محضر الاستنطاق أو المواجهة أو الاستماع على حضور المحامي وعدم دفعه بأي إخلال يتعلق بالاستدعاء أو بالاطلاع على ملف القضية، فإنه لا يجوز للمحامي أو للطرف الذي يمثله أن يثير هذا الدفع فيما بعد."
                ]
              },
              {
                "number": "140",
                "paragraphs": [
                  "لا يمكن لمحامي المتهم ولا لمحامي الطرف المدني أن يتناولا الكلمة إلا لتوجيه أسئلة بعد انتهاء استنطاق المتهم أو مواجهته بغيره أو بعد الاستماع إلى الطرف المدني، بعد أن يأذن لهما بذلك قاضي التحقيق، فإن رفض الإذن لهما بالكلمة تعين تسجيل الأسئلة في المحضر أو إرفاق نصها به.",
                  "دون الإخلال بما سبق يجوز للمحامي الحاضر أن يقدم لقاضي التحقيق ملاحظات أو وثائق تضم إلى المحضر وترفق به."
                ]
              },
              {
                "number": "141",
                "paragraphs": [
                  "توضع محاضر الاستنطاقات والمواجهات وفقا للكيفيات المنصوص عليها في المادتين 124 و126."
                ]
              }
            ]
          },
          {
            "name": "الباب الثامن",
            "title": "أوامر قاضي التحقيق",
            "sections": [
              {
                "name": "الفرع الأول",
                "title": "أحكام عامة",
                "articles": [
                  {
                    "number": "142",
                    "paragraphs": [
                      "يمكن لقاضي التحقيق في القضايا الجنائية أو الجنحية أن يصدر حسب الأحوال أمرا بالحضور أو أمرا بالإحضار أو أمرا بالإيداع في السجن أو أمرا بإلقاء القبض طبقا للمقتضيات المقررة في المواد من 144 إلى 158 أدناه.",
                      "يراعي قاضي التحقيق، في كل الأحوال، عند إصدار الأوامر المنصوص عليها في الفقرة الأولى أعلاه خطورة الأفعال والمتهمين بارتكابها بما لا يمس بقرينة البراءة. ويتم تنفيذ هذه الأوامر تحت إشرافه ومراقبته.",
                      "يمكنه لضرورة التحقيق الأمر بوضع المتهم تحت المراقبة القضائية أو الاعتقال الاحتياطي طبقا للمقتضيات المقررة في المواد من 160 إلى 188 من هذا القانون.",
                      "وله متى قامت دلائل كافية على جدية الاتهام في جرائم الاعتداءات على الحيازة أن يأمر بإرجاع الحالة إلى ما كانت عليه.",
                      "ويقبل الأمر الصادر عن قاضي التحقيق في هذه الحالة الاستئناف لدى الغرفة الجنحية بناء على ملتمس من النيابة العامة أو الأطراف أو دفاعهم.",
                      "يجوز له في حالة عدم وجود منازعة جدية أو عدم توفر وسائل إثبات كافية أن يأمر برد الأشياء والأدوات ووسائل النقل أو الإنتاج التي ضبطت أثناء البحث أو التحقيق لمن له الحق فيها مع تكليفه عند الاقتضاء بحراستها واتخاذ كافة التدابير لمنع تفويتها ما لم تكن لازمة لسير الدعوى أو خطيرة.",
                      "يجوز لقاضي التحقيق أن يأمر ببيع الأشياء المحجوزة التي يخشى فسادها أو تلفها أو لتعذر الاحتفاظ بها."
                    ]
                  },
                  {
                    "number": "143",
                    "paragraphs": [
                      "يجب أن يشار في كل أمر إلى نوع التهمة والنصوص القانونية المطبقة عليها، وأن تبين فيه هوية المتهم ورقم بطاقة تعريفه عند الاقتضاء.",
                      "ويؤرخ الأمر ويوقعه القاضي الذي أصدره ويختمه بطابعه.",
                      "وتكون الأوامر القضائية الصادرة عن قاضي التحقيق نافذة المفعول في جميع أنحاء المملكة."
                    ]
                  }
                ]
              },
              {
                "name": "الفرع الثاني",
                "title": "الأمر بالحضور",
                "articles": [
                  {
                    "number": "144",
                    "paragraphs": [
                      "يقصد من الأمر بالحضور إنذار المتهم بالحضور أمام القاضي في التاريخ والساعة المبينين في نص الأمر.",
                      "يقوم بتبليغ الأمر بالحضور وتسليم نسخة منه إلى المعني بالأمر عون قضائي أو ضابط أو عون للشرطة القضائية أو أحد أعوان القوة العمومية."
                    ]
                  },
                  {
                    "number": "145",
                    "paragraphs": [
                      "يجب على قاضي التحقيق أن يستنطق فورا المتهم الذي تقدم إليه بناء على أمر بالحضور.",
                      "يستعين قاضي التحقيق بمترجم إذا كان المتهم يتحدث لغة أو لهجة لا يفهمها قاضي التحقيق، ويستعين بكل شخص يحسن التخاطب مع المتهم إذا كان هذا الأخير أصما أو أبكما.",
                      "يحق لمحامي المتهم حضور الاستنطاق."
                    ]
                  }
                ]
              },
              {
                "name": "الفرع الثالث",
                "title": "الأمر بالإحضار",
                "articles": [
                  {
                    "number": "146",
                    "paragraphs": [
                      "الأمر بالإحضار هو الأمر الذي يعطيه قاضي التحقيق للقوة العمومية لتقديم المتهم أمامه في الحال.",
                      "يقوم بتبليغ هذا الأمر وتنفيذه أحد ضباط أو أعوان الشرطة القضائية أو عون من القوة العمومية، ويعرضه على المتهم ويسلم له نسخة منه.",
                      "إذا كان الشخص في حالة اعتقال، فإن رئيس المؤسسة السجنية هو الذي يبلغه الأمر ويسلم له نسخة منه.",
                      "يمكن في حالة الاستعجال نشر الأمر بالإحضار بكافة الوسائل، ويجب أن تحدد بدقة جميع البيانات الأساسية الواردة في الأصل وخصوصا هوية المتهم ونوع التهمة واسم القاضي الصادر عنه الأمر وصفته، ويوجه أصل الأمر في أسرع وقت إلى العون المكلف بتنفيذه."
                    ]
                  },
                  {
                    "number": "147",
                    "paragraphs": [
                      "يجب أن يستنطق في الحال المتهم المقدم إلى قاضي التحقيق تنفيذا للأمر بالإحضار الصادر عنه.",
                      "يحق لمحامي المتهم حضور هذا الاستنطاق.",
                      "إذا تعذر استنطاق المتهم على الفور، ينقل إلى المؤسسة السجنية حيث لا يجوز اعتقاله فيها أكثر من أربع وعشرين ساعة.",
                      "إذا انتهت هذه المدة ولم يتم بعد استنطاق المتهم، فيجب على رئيس المؤسسة السجنية أن يقدمه تلقائيا إلى قاضي النيابة العامة المختصة، الذي يلتمس من قاضي التحقيق، وعند تغيبه، من أي قاض من قضاة الحكم استنطاق المتهم فورا، وإلا فيطلق سراحه.",
                      "يستعين قاضي التحقيق بمترجم إذا كان المتهم يتحدث لغة أو لهجة لا يفهمها قاضي التحقيق، ويستعين بكل شخص يحسن التخاطب مع المتهم إذا كان هذا الأخير أصما أو أبكما."
                    ]
                  },
                  {
                    "number": "148",
                    "paragraphs": [
                      "كل متهم ألقي عليه القبض بناء على أمر بالإحضار واحتفظ به في المؤسسة السجنية أكثر من أربع وعشرين ساعة دون أن يستنطق، يعتبر معتقلا اعتقالا تعسفيا.",
                      "كل قاض أو موظف أمر بإبقاء المتهم في السجن أو سمح بإبقائه فيه عن قصد يتعرض للعقوبات المقررة للزجر عن الاعتقال التعسفي."
                    ]
                  },
                  {
                    "number": "149",
                    "paragraphs": [
                      "إذا كان المتهم المطلوب إحضاره بموجب أمر صادر عن قاضي التحقيق يوجد خارج دائرة نفوذ هذا القاضي، فإنه يقدم للنيابة العامة لمكان إلقاء القبض.",
                      "يسأل قاضي النيابة العامة المتهم عن هويته ويتلقى تصريحاته بعد إشعاره بأنه حر في عدم الإدلاء بها، ثم يأمر بنقله إلى مقر قاضي التحقيق المكلف بالقضية.",
                      "غير أنه إذا اعترض المتهم على نقله مستدلا بحجج قوية لنفي التهمة عنه، فإنه ينقل إلى المؤسسة السجنية، ويوجه في الحال وبأسرع الوسائل إشعار بذلك إلى قاضي التحقيق المختص، كما يوجه إليه دون تأخير محضر حضور المتهم متضمنا أوصافه الكاملة وجميع البيانات التي تساعد على معرفة هويته أو على فحص ما تقدم به من حجج.",
                      "يجب أن ينص في المحضر على إشعار المتهم بحريته في عدم الإدلاء بأي تصريح.",
                      "يقرر قاضي التحقيق ما إذا كان هناك مبرر لإصدار أمر بنقل المتهم."
                    ]
                  },
                  {
                    "number": "150",
                    "paragraphs": [
                      "إذا تعذر العثور على المتهم الصادر ضده أمر بالإحضار، فإن السلطة المكلفة بالتنفيذ ترجع هذا الأمر إلى قاضي التحقيق مرفوقا بمحضر يثبت عدم العثور عليه."
                    ]
                  },
                  {
                    "number": "151",
                    "paragraphs": [
                      "إذا رفض المتهم الامتثال للأمر بالإحضار أو حاول الهروب بعد أن صرح باستعداده للامتثال، فإنه يجبر على ذلك بالقوة العمومية.",
                      "يستعمل المكلف بتنفيذ الأمر بالإحضار في هذه الحالة القوة العمومية الموجودة بأقرب مكان مجاور، ويتعين على هذه القوة الاستجابة لطلب التسخير المضمن في نص الأمر."
                    ]
                  }
                ]
              },
              {
                "name": "الفرع الرابع",
                "title": "الأمر بالإيداع في السجن",
                "articles": [
                  {
                    "number": "152",
                    "paragraphs": [
                      "الأمر بالإيداع في السجن هو أمر يصدره قاضي التحقيق إلى رئيس المؤسسة السجنية كي يتسلم المتهم ويعتقله اعتقالاً احتياطياً.",
                      "يبلغ قاضي التحقيق إلى المتهم الأمر بالإيداع في السجن، ويشار إلى هذا التبليغ في محضر الاستنطاق.",
                      "يسمح هذا الأمر أيضاً بالبحث عن المتهم أو بنقله إذا كان قد بلغ إليه قبل ذلك."
                    ]
                  },
                  {
                    "number": "153",
                    "paragraphs": [
                      "لا يمكن لقاضي التحقيق أن يصدر أمراً بإيداع المتهم في السجن إلا بعد استنطاقه، وبشرط أن تكون الأفعال المرتكبة جناية أو جنحة يعاقب عليها بعقوبة سالبة للحرية.",
                      "يقوم العون المكلف بتنفيذ الأمر بالإيداع في السجن بتسليم المتهم إلى رئيس المؤسسة السجنية الذي يعطيه إشهاداً بتسليمه."
                    ]
                  }
                ]
              },
              {
                "name": "الفرع الخامس",
                "title": "الأمر بإلقاء القبض",
                "articles": [
                  {
                    "number": "154",
                    "paragraphs": [
                      "الأمر بإلقاء القبض هو الأمر الصادر للقوة العمومية بالبحث عن المتهم ونقله إلى المؤسسة السجنية المبينة في الأمر حيث يتم تسلمه واعتقاله فيها.",
                      "يصدر هذا الأمر بعد أخذ رأي النيابة العامة إذا كان المتهم في حالة فرار أو مقيماً خارج أراضي المملكة، وكانت الأفعال الجرمية توصف بأنها جناية أو جنحة يعاقب عليها بعقوبة سالبة للحرية.",
                      "يبلغ الأمر بإلقاء القبض وينفذ طبقاً للكيفيات المنصوص عليها في الفقرتين الثانية والثالثة من المادة 146.",
                      "يمكن في حالة الاستعجال نشر الأمر المذكور وفقاً لما هو منصوص عليه في الفقرة الأخيرة من نفس المادة."
                    ]
                  },
                  {
                    "number": "155",
                    "paragraphs": [
                      "ينقل على الفور المتهم المقبوض عليه بمقتضى أمر بإلقاء القبض إلى المؤسسة السجنية المبينة في نص ذلك الأمر، بصرف النظر عن الحالة المنصوص عليها في الفقرة الثانية من المادة 156 بعده.",
                      "يدفع رئيس تلك المؤسسة إلى العون المكلف بتنفيذ الأمر إشهاداً بتسلمه المتهم."
                    ]
                  },
                  {
                    "number": "156",
                    "paragraphs": [
                      "إذا ضبط المتهم داخل دائرة نفوذ قاضي التحقيق الصادر عنه الأمر، تعين على هذا القاضي أن يستنطقه خلال ثمان وأربعين ساعة من الاعتقال، وإذا مضت هذه المدة دون أن يستنطق، تطبق مقتضيات المادتين 147 و148 أعلاه.",
                      "إذا ضبط المتهم خارج دائرة نفوذ قاضي التحقيق الصادر عنه الأمر، يقدم حالاً إلى وكيل الملك أو الوكيل العام للملك للمكان الذي ضبط فيه كي يتعرف على هويته ويتلقى تصريحاته بعد إشعاره بأن له الحرية في الكلام أو في الإمساك عنه، ويوجه المحضر المحرر بذلك في الحال إلى القاضي المختص.",
                      "يخبر وكيل الملك أو الوكيل العام للملك في نفس الوقت قاضي التحقيق المختص، ويلتمس نقل المتهم، وإن تعذر نقله في الحال، فإن وكيل الملك أو الوكيل العام للملك يستشير في ذلك قاضي التحقيق.",
                      "إذا ألقي القبض على المتهم بعد أن تخلى قاضي التحقيق عن القضية بإحالتها إلى المحكمة المختصة، تعين في جميع الأحوال على وكيل الملك أو الوكيل العام للملك للدائرة التي ضبط فيها المتهم أن يتحقق من هوية هذا الأخير، وأن يشعره علاوة على ذلك بأنه يمكنه أن يتلقى منه تصريحاته، وأنه حر في عدم الإدلاء بأي تصريح، وينص على هذا الإشعار في المحضر.",
                      "يتعين على وكيل الملك أو الوكيل العام للملك داخل أربع وعشرين ساعة أن يوجه هذا المحضر إلى النيابة العامة لدى المحكمة المختصة التي تقوم بإحالة المعني بالأمر عند الاقتضاء على المحكمة المعروضة عليها القضية أو على المحكمة التي لها صلاحية البت في طلب السراح المؤقت طبقاً للفقرة الثالثة من المادة 180 من هذا القانون إذا كان الملف معروضاً على محكمة النقض.",
                      "يوضع حد بقوة القانون للأمر بإلقاء القبض إذا صدر حكم يقضي ببراءة الشخص المطلوب إلقاء القبض عليه أو بالغرامة أو الحبس الموقوف التنفيذ أو بالإعفاء من العقوبة أو من المسؤولية أو سقوط الدعوى العمومية، وتسهر النيابة العامة على تنفيذ هذا الإجراء."
                    ]
                  },
                  {
                    "number": "157",
                    "paragraphs": [
                      "لا يجوز للعون المكلف بتنفيذ أمر بإلقاء القبض أن يدخل منزلاً لضبط متهم قبل الساعة السادسة صباحاً وبعد التاسعة ليلاً.",
                      "يحق له أن يصطحب قوة كافية للحيلولة دون تملص المتهم من أحكام القانون، وتؤخذ هذه القوة من أقرب محل للمكان الذي يجب فيه تنفيذ الأمر بإلقاء القبض، ويجب على هذه القوة أن تمتثل للأوامر بالتسخير التي يتضمنها الأمر بإلقاء القبض.",
                      "إذا تعذر ضبط المتهم، فإن الأمر بإلقاء القبض يبلغ بتعليقه في المكان الذي يوجد فيه آخر محل سكناه ويحرر محضر بذلك.",
                      "ينجز هذا المحضر حامل الأمر بإلقاء القبض بحضور شخصين يختارهما من بين من يجده من أقرب جيران المتهم ويوقعه الشخصان الحاضران، فإن كانا لا يعرفان التوقيع اكتفي ببصمتيهما، وإذا رفضا التوقيع أو الإبصام أو تعذر عليهما يضمن ذلك في المحضر، كما يشار إلى استجوابهما عن ذلك.",
                      "يقوم حامل الأمر بإلقاء القبض بعرض المحضر على ضابط الشرطة المختص محلياً للتأشير عليه، وفي حال غيابه يقوم بهذا التأشير ضابط الشرطة الذي يخلفه ويحتفظ بنسخة من المحضر.",
                      "يوجه الأمر بإلقاء القبض مع المحضر، حسب الأحوال، إما إلى قاضي التحقيق الصادر عنه الأمر وإما إلى النيابة العامة المختصة."
                    ]
                  },
                  {
                    "number": "158",
                    "paragraphs": [
                      "تعرض عدم مراعاة الشكليات المأمور بها في هذا الفرع كلا من ممثل النيابة العامة وقاضي التحقيق، وعند الاقتضاء كاتب الضبط، إلى عقوبات تأديبية إذا ترتب عن ذلك مس بالحرية الفردية، بصرف النظر عن المتابعات الجنائية في حالة الاعتقال التعسفي."
                    ]
                  }
                ]
              }
            ]
          },
          {
            "name": "الباب التاسع",
            "title": "الوضع تحت المراقبة القضائية والاعتقال الاحتياطي",
            "articles": [
              {
                "number": "159",
                "paragraphs": [
                  "الوضع تحت المراقبة القضائية والاعتقال الاحتياطي تدبيران استثنائيان، يعمل بهما في الجنايات أو في الجنح المعاقب عليها بعقوبة سالبة للحرية."
                ]
              }
            ],
            "sections": [
              {
                "name": "الفرع الأول",
                "title": "الوضع تحت المراقبة القضائية",
                "articles": [
                  {
                    "number": "160",
                    "paragraphs": [
                      "يعتبر الوضع تحت المراقبة القضائية بديلاً عن الاعتقال الاحتياطي، ولا يمكن اتخاذهما معاً في آن واحد. ويتم وضع حد للمراقبة القضائية بقوة القانون في حالة تنفيذ الأمر بالاعتقال الاحتياطي.",
                      "يمكن أن يوضع المتهم تحت المراقبة القضائية في أية مرحلة من مراحل التحقيق لمدة شهرين قابلة للتجديد ثلاث مرات لنفس المدة إذا تعلق الأمر بجناية، ولمدة شهر قابلة للتجديد مرتين لنفس المدة إذا تعلق الأمر بجنحة، ولاسيما لأجل ضمان حضوره، ما لم يكن هناك سبب من الأسباب المنصوص عليها في المادة 175-1 أدناه تستوجب اعتقاله احتياطياً. غير أنه يمكن تمديد مدة الوضع تحت المراقبة القضائية لخمس مرات ولنفس المدة بالنسبة للجنايات المنصوص عليها في المادة 108 أعلاه.",
                      "يصدر قاضي التحقيق بشأن الوضع تحت المراقبة القضائية أمراً يبلغه في الحال شفهياً للمتهم ويسجل هذا التبليغ في المحضر، ويبلغه أيضاً إلى ممثل النيابة العامة داخل أربع وعشرين ساعة. ولهما الحق في استئنافه خلال اليوم الموالي لصدوره طبقاً للشكليات المتعلقة باستئناف أوامر قاضي التحقيق بشأن الإفراج المؤقت، ويجب على الغرفة الجنحية بمحكمة الاستئناف أن تبت في هذا الاستئناف داخل أجل خمسة أيام من تاريخ الإحالة.",
                      "يمكن لقاضي التحقيق تغيير التدبير المتخذ أو إضافة تدبير آخر أو أكثر، تلقائياً أو بناء على طلب النيابة العامة أو المتهم أو محاميه بعد أخذ رأي النيابة العامة إن لم تكن هي التي تقدمت بالطلب.",
                      "يمكن لقاضي التحقيق إلغاء الوضع تحت المراقبة تلقائياً أو بناء على طلب النيابة العامة أو المتهم أو محاميه.",
                      "يمكن إلغاء الوضع تحت المراقبة القضائية أثناء جميع مراحل التحقيق إذا لم يحترم المتهم الالتزامات المفروضة عليه بمقتضى الأمر الصادر عن قاضي التحقيق أو إذا توافرت أحد الأسباب الواردة في المادة 175-1 أدناه. وفي هذه الحالة يصدر قاضي التحقيق ضده أمراً بالإيداع في السجن أو أمراً بإلقاء القبض بعد أخذ رأي النيابة العامة.",
                      "يحق للمتهم أو دفاعه أن يتسلم نسخة من الأمر بالوضع تحت المراقبة القضائية."
                    ]
                  },
                  {
                    "number": "161",
                    "paragraphs": [
                      "يتضمن الأمر بوضع المتهم تحت المراقبة القضائية، الخضوع تبعاً لقرار قاضي التحقيق لواحد أو أكثر من التدابير أو الالتزامات التالية:",
                      "عدم مغادرة الحدود الترابية المحددة من طرف قاضي التحقيق.",
                      "عدم التغيب عن المنزل أو محل الإقامة المحدد من طرف قاضي التحقيق.",
                      "التردد أو عدم التردد على بعض الأمكنة التي يحددها قاضي التحقيق.",
                      "إشعار قاضي التحقيق بأي تنقل خارج الحدود المعينة.",
                      "التقدم بصفة دورية أمام المصالح والسلطات المعينة من طرف قاضي التحقيق.",
                      "الاستجابة للاستدعاءات الموجهة إلى الخاضع للمراقبة من أية سلطة أو أي شخص مؤهل معين من طرف قاضي التحقيق.",
                      "الخضوع لتدابير المراقبة المتعلقة بالنشاط المهني أو حول مثابرته على تعليم معين.",
                      "إغلاق الحدود.",
                      "تقديم الوثائق المتعلقة بهويته لاسيما جواز السفر إما لكتابة الضبط أو لمصلحة الشرطة أو الدرك الملكي مقابل وصل.",
                      "المنع من سياقة جميع الناقلات أو بعضها، أو تسليم رخصة السياقة لكتابة الضبط مقابل وصل، ويمكن لقاضي التحقيق أن يأذن له باستعمال رخصة السياقة لمزاولة نشاطه المهني.",
                      "المنع من الاتصال ببعض الأشخاص المحددين على وجه الخصوص من قبل قاضي التحقيق.",
                      "الخضوع لتدابير الفحص والعلاج أو لنظام الاستشفاء سيما من أجل إزالة التسمم.",
                      "إيداع كفالة مالية يحدد قاضي التحقيق مبلغها وأجل أدائها، مع الأخذ بعين الاعتبار الحالة المادية للمعني بالأمر.",
                      "عدم مزاولة بعض الأنشطة ذات طبيعة مهنية أو اجتماعية أو تجارية ماعدا المهام الانتخابية أو النقابية، وذلك في الحالة التي ترتكب فيها الجريمة أثناء ممارسة هذه الأنشطة أو بمناسبتها، أو إذا كان يخشى ارتكاب جريمة جديدة لها علاقة بممارسة النشاط المعني. غير أنه إذا تعلق الأمر بعدم مزاولة مهنة المحاماة، فإن الوكيل العام للملك يحيل الأمر بطلب من قاضي التحقيق على مجلس هيئة المحامين الذي يبت طبقاً لمقتضيات المواد من 65 إلى 69 من القانون المنظم لمهنة المحاماة، وفي حالة عدم البت داخل أجل شهرين من تاريخ الإحالة يعود لقاضي التحقيق اتخاذ القرار بنفسه. ويمكن الطعن في قرار مجلس الهيئة طبقاً لأحكام المادة 90 وما يليها إلى المادة 93 من القانون المذكور.",
                      "عدم إصدار الشيكات.",
                      "عدم حيازة الأسلحة وتسليمها إلى المصالح الأمنية المختصة مقابل وصل.",
                      "تقديم ضمانات شخصية أو عينية يحددها قاضي التحقيق تستهدف ضمان حقوق الضحية.",
                      "إثبات مساهمة المتهم في التحملات العائلية أو أنه يؤدي بانتظام النفقة المحكوم بها عليه.",
                      "الوضع تحت المراقبة الإلكترونية."
                    ]
                  },
                  {
                    "number": "162",
                    "paragraphs": [
                      "يقوم قاضي التحقيق المكلف بالملف، أو القاضي الذي ينتدبه لهذه الغاية بالمكان الذي يسكن به المتهم، بتعيين شخص ذاتي أو اعتباري مؤهل للمشاركة في تطبيق الوضع تحت المراقبة القضائية أو بتعيين مصلحة للشرطة أو للدرك الملكي أو أية مصلحة قضائية أو إدارية مختصة."
                    ]
                  },
                  {
                    "number": "163",
                    "paragraphs": [
                      "تتأكد السلطات أو الأشخاص المكلفون بالمشاركة في تطبيق الوضع تحت المراقبة القضائية من أن المتهم امتثل للالتزامات المفروضة عليه، ويمكنهم لهذه الغاية استدعاؤه أو زيارته.",
                      "يقومون بكل الإجراءات والأبحاث المفيدة لتنفيذ مهمتهم ويبلغون قاضي التحقيق عن إنجاز مهمتهم وعن سلوك المتهم ضمن الشروط التي حددها.",
                      "إذا تملص المتهم من تطبيق التدبير أو التدابير المفروضة عليه أشعروا قاضي التحقيق فوراً."
                    ]
                  },
                  {
                    "number": "164",
                    "paragraphs": [
                      "تؤدى تعويضات ومصاريف الأشخاص الذين يجرون أبحاثاً حول شخصية المتهم في نطاق الوضع تحت المراقبة القضائية باعتبارها مصاريف قضائية في الميدان الجنائي."
                    ]
                  },
                  {
                    "number": "165",
                    "paragraphs": [
                      "يجب ألا يمس تطبيق الوضع تحت المراقبة القضائية بحرية الرأي بالنسبة للأشخاص الخاضعين له، ولا بمعتقداتهم الدينية أو السياسية ولا بحقهم في الدفاع."
                    ]
                  },
                  {
                    "number": "166",
                    "paragraphs": [
                      "تقوم المصالح أو السلطات التي يجب على المتهم أن يتقدم إليها طبقاً للبند 5 من المادة 161 أعلاه بتسجيل تواريخ حضوره ضمن الشروط المقررة من طرف قاضي التحقيق."
                    ]
                  },
                  {
                    "number": "167",
                    "paragraphs": [
                      "يمكن للسلطة أو الشخص المؤهل الذي عينه قاضي التحقيق لمراقبة النشاط المهني للمتهم أو مواظبته على التعليم طبقاً للبند 7 من المادة 161 أعلاه أن يطلب من المتهم اطلاعه على كل الوثائق أو المعلومات المتعلقة بعمله أو بدراسته."
                    ]
                  },
                  {
                    "number": "168",
                    "paragraphs": [
                      "يجب أن يشير الوصل الذي يسلم للمتهم مقابل الوثائق المنصوص عليها في البند 9 من المادة 161 أعلاه إلى نوع الوثيقة المسحوبة والبيانات المتعلقة بها واسم المتهم الشخصي والعائلي وتاريخ ومكان ولادته ورقم بطاقة هويته.",
                      "يجب في الحالة المنصوص عليها في هذا البند أن توضع على الوصل صورة حديثة للمتهم وأن يبين فيه أنه سلم مقابل وثيقة الهوية.",
                      "يجب على المتهم أن يرجع الوصل المذكور عندما تعاد إليه الوثيقة المسحوبة منه."
                    ]
                  },
                  {
                    "number": "169",
                    "paragraphs": [
                      "يمكن للمتهم إذا أخضع للتدبير المنصوص عليه في البند 12 من المادة 161 أعلاه أن يختار الطبيب المختص أو المؤسسة التي تتولى ذلك.",
                      "تسلم لقاضي التحقيق جميع الوثائق التي يطلبها من طرف المتهم أو الطبيب أو المؤسسة."
                    ]
                  },
                  {
                    "number": "170",
                    "paragraphs": [
                      "إذا قرر قاضي التحقيق تطبيق التدابير المنصوص عليها في البند 14 من المادة 161 أعلاه، فإنه يشعر بذلك عند الاقتضاء المشغل أو السلطة التسلسلية التي يتبع لها المتهم أو الهيئة المهنية التي ينتمي إليها أو السلطة المختصة لممارسة المهنة أو النشاط المهني."
                    ]
                  },
                  {
                    "number": "171",
                    "paragraphs": [
                      "يتم إشعار رئيس مصلحة الشرطة أو الدرك الملكي بمكان إقامة المتهم بأي تدبير من تدابير الوضع تحت المراقبة القضائية يعهد إليه بتنفيذه، ويشعر كذلك بكل تغيير يطرأ على هذه التدابير.",
                      "تسلم المصالح المشار إليها في البند 16 من المادة 161 أعلاه للمتهم وصلاً عن الأسلحة المودعة لديها وتشعر بذلك قاضي التحقيق."
                    ]
                  },
                  {
                    "number": "172",
                    "paragraphs": [
                      "إذا أمر قاضي التحقيق بتطبيق التدبير المنصوص عليه في البند 15 من المادة 161، فإنه يشعر بذلك الفرع أو الوكالة البنكية أو الشخص أو المؤسسة أو المصلحة التي تسير الحساب البنكي للمتهم وبنك المغرب."
                    ]
                  },
                  {
                    "number": "173",
                    "paragraphs": [
                      "تودع الكفالة المالية المنصوص عليها في البند 13 من المادة 161 بصندوق المحكمة التي يوجد بها قاضي التحقيق مقابل وصل، وتسلم نسخة من الوصل لقاضي التحقيق."
                    ]
                  },
                  {
                    "number": "174",
                    "paragraphs": [
                      "إذا أمر قاضي التحقيق بمساهمة المتهم في التحملات العائلية أو بأداء نفقة، فإنه يشعر المستفيد منها بذلك."
                    ]
                  },
                  {
                    "number": "174-1",
                    "paragraphs": [
                      "تتم المراقبة الإلكترونية بواسطة قيد إلكتروني يسمح برصد تحركات المتهم داخل الحدود الترابية التي يحددها له قاضي التحقيق.",
                      "يتم تنفيذ الوضع تحت المراقبة الإلكترونية تحت إشراف قاضي التحقيق طبقاً للتدابير المنصوص عليها في المواد من 647-10 إلى 647-14 من هذا القانون."
                    ]
                  },
                  {
                    "number": "174-2",
                    "paragraphs": [
                      "ينجز محضر بعملية وضع القيد الإلكتروني يوجه إلى قاضي التحقيق الذي يضمه إلى ملف المعني بالأمر.",
                      "ترفع التقارير إلى قاضي التحقيق كلما دعت الضرورة إلى ذلك أو إذا طلبها هذا القاضي."
                    ]
                  },
                  {
                    "number": "174-3",
                    "paragraphs": [
                      "يمكن لقاضي التحقيق أن يخضع المعني بالأمر بناء على طلبه لفحص طبي للتحقق من تأثير القيد الإلكتروني على صحته."
                    ]
                  }
                ]
              },
              {
                "name": "الفرع الثاني",
                "title": "الاعتقال الاحتياطي",
                "articles": [
                  {
                    "number": "175",
                    "paragraphs": [
                      "الاعتقال الاحتياطي تدبير استثنائي لا يُلجأ إليه في الجنايات أو الجنح المعاقب عليها بعقوبة سالبة للحرية إلا إذا تعذر تطبيق تدبير آخر بديل عنه، وفي جميع الأحوال فإن قرار الاعتقال الاحتياطي يجب أن يكون كتابياً ويبين فيه القاضي الأسباب المبررة للاعتقال."
                    ]
                  },
                  {
                    "number": "175-1",
                    "paragraphs": [
                      "لا يمكن الأمر بالاعتقال الاحتياطي إلا إذا ظهر أن هذا التدبير ضروري لأحد الأسباب التالية:",
                      "تفادي عرقلة سير إجراءات التحقيق.",
                      "وضع حد للجريمة أو منع تكرارها.",
                      "الحفاظ على الأدلة والحيلولة دون تغيير معالم الجريمة.",
                      "القيام بالأبحاث والتحريات التي تستلزم حضور أو مشاركة المشتبه فيه.",
                      "وضع المتهم رهن إشارة العدالة والحيلولة دون فراره.",
                      "الحيلولة دون ممارسة أي ضغط على الشهود أو الضحايا أو أسرهم أو أقاربهم.",
                      "منع المتهم من التواطؤ مع الأشخاص المساهمين أو المشاركين في الجريمة.",
                      "وضع حد للاضطراب الذي أحدثه الفعل بسبب خطورته أو ظروف ارتكابه أو الوسيلة التي استعملت في ارتكابه، أو أهمية الضرر الناتج عنه، أو بالنظر لخطورة المشتبه فيه."
                    ]
                  },
                  {
                    "number": "175-2",
                    "paragraphs": [
                      "يمكن إصدار أمر بالاعتقال الاحتياطي في أي مرحلة من مراحل التحقيق، ولو ضد متهم خاضع للوضع تحت المراقبة القضائية، إذا توفر أحد الأسباب المشار إليها في المادة 175-1 أعلاه.",
                      "يشعر فوراً بهذا الأمر المتهم والنيابة العامة وفقاً لما هو منصوص عليه في الفقرة الثالثة من المادة 160 أعلاه.",
                      "يصدر القاضي في هذه الحالة أمراً بالإيداع في السجن يكون سنداً للاعتقال، أو أمراً بإلقاء القبض إن كان المتهم في حالة فرار.",
                      "يحق للمتهم أو دفاعه تسلم نسخة من الأمر بالاعتقال الاحتياطي بمجرد طلبها."
                    ]
                  },
                  {
                    "number": "176",
                    "paragraphs": [
                      "لا يجوز في القضايا الجنحية أن يتجاوز الاعتقال الاحتياطي شهراً واحداً.",
                      "إذا ظهرت عند انصرام هذا الأجل ضرورة استمرار الاعتقال الاحتياطي، جاز لقاضي التحقيق تمديد فترته بمقتضى أمر قضائي معلل يبين فيه الأسباب المبررة للتمديد، ويصدره بناء على طلبات النيابة العامة المدعمة أيضاً بأسباب.",
                      "لا يمكن تمديد مدة الاعتقال الاحتياطي إلا إذا كانت ضرورة التحقيق تستدعي ذلك بالنظر لعدم استكمال الإجراءات أو إذا كانت أسباب الاعتقال الاحتياطي المشار إليها في المادة 175-1 أعلاه ما تزال قائمة.",
                      "لا يمكن أن يكون التمديد إلا لمرة واحدة ولنفس المدة، مع مراعاة مقتضيات الفقرة الأخيرة من المادة 462-1 من هذا القانون.",
                      "إذا لم يتخذ قاضي التحقيق خلال هذه المدة أمراً طبقاً لمقتضيات المادة 217 من هذا القانون، يطلق سراح المتهم بقوة القانون ويستمر التحقيق."
                    ]
                  },
                  {
                    "number": "177",
                    "paragraphs": [
                      "لا يمكن أن يتعدى أمد الاعتقال الاحتياطي شهرين في الجنايات.",
                      "إذا ظهرت عند انصرام هذا الأجل ضرورة استمرار الاعتقال الاحتياطي، جاز لقاضي التحقيق تمديد فترته بمقتضى أمر قضائي معلل يبين فيه الأسباب المبررة للتمديد، ويصدره بناء على طلبات النيابة العامة المدعمة أيضاً بأسباب.",
                      "لا يمكن تمديد مدة الاعتقال الاحتياطي إلا إذا كانت ضرورة التحقيق تستدعي ذلك بالنظر لعدم استكمال الإجراءات أو إذا كانت أسباب الاعتقال الاحتياطي المشار إليها في المادة 175-1 أعلاه ما تزال قائمة.",
                      "لا يمكن أن تكون التمديدات إلا في حدود مرتين ولنفس المدة، غير أنه يمكن تمديد مدة الاعتقال الاحتياطي لخمس مرات ولنفس المدة بالنسبة لجرائم أمن الدولة أو الإرهاب.",
                      "إذا لم يتخذ قاضي التحقيق أمراً بانتهاء التحقيق أثناء هذه المدة، يطلق سراح المتهم بقوة القانون ويستمر التحقيق."
                    ]
                  },
                  {
                    "number": "178",
                    "paragraphs": [
                      "يجوز لقاضي التحقيق في جميع القضايا، بعد استشارة النيابة العامة، أن يأمر بالإفراج المؤقت تلقائياً إذا كان الإفراج غير مقرر بموجب القانون، بشرط أن يلتزم المتهم بالحضور لجميع إجراءات الدعوى كلما دعي لذلك، وبأن يخبر قاضي التحقيق بجميع تنقلاته أو بالإقامة في مكان معين، كما يمكن ربط الإفراج المؤقت بإدلاء المعني بالأمر بشهادة من مؤسسة عمومية أو خاصة للصحة أو التعليم تؤكد تكفلها بالمتهم أثناء مدة هذا الإفراج.",
                      "يمكن كذلك أن يتوقف هذا الإفراج على وجوب الالتزام بتقديم ضمانة مالية أو ضمانة بنكية أو ضمانة شخصية.",
                      "يمكن علاوة على ذلك أن يكون الإفراج المؤقت مرفوقاً بالوضع تحت المراقبة القضائية وفقاً للشكليات المقررة في المواد من 160 إلى 174-3 أعلاه.",
                      "يمكن للنيابة العامة أيضاً أن تلتمس في كل وقت وحين الإفراج المؤقت، وعلى قاضي التحقيق أن يبت في ذلك خلال أجل خمسة أيام من تاريخ تقديم هذه الملتمسات."
                    ]
                  },
                  {
                    "number": "179",
                    "paragraphs": [
                      "يمكن في كل وقت أن يقدم طلب الإفراج المؤقت إلى قاضي التحقيق من طرف المتهم أو محاميه، مع مراعاة الالتزامات المنصوص عليها في المادة السابقة.",
                      "يجب على قاضي التحقيق خلال أربع وعشرين ساعة من وقت وضع طلب الإفراج المؤقت أن يوجه الملف إلى النيابة العامة لتقديم ملتمساتها، وأن يشعر بذلك الطرف المدني خلال نفس الأجل برسالة مضمونة ليمكنه الإدلاء بملاحظاته.",
                      "يجب عليه في جميع الحالات أن يبت في طلب الإفراج المؤقت بأمر قضائي معلل يصدره خلال خمسة أيام من يوم وضع الطلب.",
                      "يمكن للمتهم إذا لم يبت قاضي التحقيق في طلب الإفراج المؤقت خلال أجل خمسة أيام المحددة في الفقرة السابقة أن يرفع طلبه مباشرة إلى الغرفة الجنحية بمحكمة الاستئناف التي تبت فيه داخل أجل أقصاه خمسة عشر يوماً، وذلك بعد أن تقدم لها النيابة العامة ملتمسات كتابية معللة، وإلا فيقع مباشرة الإفراج المؤقت عن المتهم ما لم يكن هناك إجراء إضافي للتحقيق.",
                      "يودع الطلب لدى النيابة العامة التي تجهز الملف وتحيله على الغرفة الجنحية في أجل ثمان وأربعين ساعة.",
                      "يحق أيضاً للنيابة العامة طبق نفس الشروط والآجال أن ترفع طلباً بالإفراج المؤقت إلى الغرفة المذكورة.",
                      "إذا كان في الدعوى طرف مدني فلا يمكن لقاضي التحقيق إصدار أمره إلا بعد ثمان وأربعين ساعة من تاريخ إشعاره بتقديم طلب الإفراج المؤقت."
                    ]
                  },
                  {
                    "number": "180",
                    "paragraphs": [
                      "يمكن في كل وقت أن يقدم طلب الإفراج المؤقت، ويمكن أن يطلبه في أية مرحلة من مراحل المسطرة وطبق الشروط المنصوص عليها في الفقرات التالية كل من المتهم أو محاميه أو ممثل النيابة العامة.",
                      "تختص هيئة الحكم بالبت في طلب الإفراج المؤقت عند إحالة القضية إليها، فإذا كانت هذه الهيئة هي غرفة الجنايات الاستئنافية أو غرفة الجنح الاستئنافية فإن القرار الصادر عن إحدى الغرفتين لا يقبل الطعن إلا وفقاً لمقتضيات الفقرة الثانية من المادة 524 من هذا القانون.",
                      "في حالة تقديم طلب طعن لم يقع البت فيه بعد، تبت في طلب الإفراج المؤقت ووضع حد للمراقبة القضائية أو تغيير تدابيرها آخر محكمة نظرت في موضوع القضية، ويكون قرارها غير قابل لأي طعن.",
                      "تطبق نفس الإجراءات إذا تعلق الأمر بصدور قرار بعدم الاختصاص وكان ملف القضية لم يحل بعد على المحكمة التي تقرر إحالة ملف القضية عليها.",
                      "تبت الهيئات المشار إليها في هذه المادة داخل أجل ثمانية أيام من تقديم الطلب.",
                      "إذا تعين على هيئة الحكم أن تبت في إحدى الحالات المنصوص عليها في هذه المادة يستدعى الأطراف ومحاموهم بواسطة إحدى الطرق المنصوص عليها في المادة 117 من هذا القانون، ويصدر المقرر القضائي بعد الاستماع إلى النيابة العامة والأطراف أو محاميهم إذا حضروا.",
                      "وعلاوة على ذلك يمكن للمحكمة أن تمنح الإفراج المؤقت مقابل واحد أو أكثر من التدابير المنصوص عليها في المادة 161 من هذا القانون."
                    ]
                  },
                  {
                    "number": "181",
                    "paragraphs": [
                      "تقبل مقررات الإفراج المؤقت أو رفع المراقبة القضائية أو تغيير تدابيرها الصادرة عن المحكمة الابتدائية الطعن بالاستئناف لغاية نهاية اليوم الموالي لصدورها، وتبت في الاستئناف غرفة الجنح الاستئنافية.",
                      "إذا استأنف المتهم أو وكيل الملك تعين تهييئ ملف القضية وتوجيهه إلى الوكيل العام للملك داخل أجل الأربع وعشرين ساعة الموالية لإيداع طلب الاستئناف.",
                      "يتعين على غرفة الجنح الاستئنافية أن تبت خلال ثمان وأربعين ساعة من يوم عرض الملف عليها.",
                      "لا يكون للاستئناف ولا للمسطرة الموالية له أثر موقف على سير الدعوى، وتتابع المحكمة مناقشتها في الجوهر.",
                      "تبت المحكمة بدون حاجة لحضور المتهم في الحالات المشار إليها في هذه المادة.",
                      "يوضع حد لاعتقال المتهم احتياطياً ولتدابير المراقبة القضائية المتخذة في حقه إذا قضت المحكمة بالإفراج المؤقت أو برفع المراقبة القضائية حسب الأحوال، وذلك بالرغم من استئناف النيابة العامة ما لم يتعلق الأمر بجرائم أمن الدولة أو الإرهاب."
                    ]
                  },
                  {
                    "number": "181-1",
                    "paragraphs": [
                      "تقبل مقررات الإفراج المؤقت أو رفع المراقبة القضائية أو تغيير تدابيرها الصادرة عن غرفة الجنايات الابتدائية الطعن بالاستئناف لغاية نهاية الساعة الثانية عشرة ظهراً من اليوم الموالي لصدورها، وتبت في الاستئناف غرفة الجنايات الاستئنافية.",
                      "إذا استأنف المتهم أو الوكيل العام للملك، فإنه يتعين تهييء ملف القضية وتوجيهه إلى غرفة الجنايات الاستئنافية داخل أجل ثمان وأربعين ساعة الموالية لإيداع طلب الاستئناف.",
                      "يتعين على غرفة الجنايات الاستئنافية أن تبت خلال عشرة أيام من يوم طلب الاستئناف.",
                      "تبت غرفة الجنايات الاستئنافية دون حاجة لحضور المتهم في الحالات المشار إليها أعلاه.",
                      "لا يكون للاستئناف ولا للمسطرة الموالية له أثر موقف لسير الدعوى، وتتابع غرفة الجنايات الابتدائية مناقشتها في الجوهر.",
                      "يوضع حد لاعتقال المتهم احتياطياً ولتدابير المراقبة القضائية المتخذة في حقه إذا قضت الغرفة بالإفراج المؤقت أو برفع المراقبة القضائية حسب الأحوال، وذلك بالرغم من استئناف النيابة العامة، مع استثناء القضايا المتعلقة بالجرائم الماسة بأمن الدولة أو بالجرائم الإرهابية."
                    ]
                  },
                  {
                    "number": "182",
                    "paragraphs": [
                      "إذا ظل المتهم في حالة سراح أو إذا أفرج عنه إفراجاً مؤقتاً أو غير مقرون بالوضع تحت المراقبة القضائية، فإن هيئة التحقيق أو الحكم التي اتخذت القرار تبقى وحدها مختصة في تقرير إغلاق الحدود في حقه وسحب جواز السفر، كما يجوز لهيئة التحقيق وهيئة الحكم إذا رأت ذلك ضرورياً أن تعين له محل إقامة يحظر عليه الابتعاد عنه دون رخصة قبل اتخاذ أمر بعدم المتابعة أو صدور مقرر قضائي مكتسب لقوة الشيء المقضي به.",
                      "إذا كانت هيئة التحقيق هي التي اتخذت القرار المشار إليه في الفقرة الأولى أعلاه، فإن مفعوله ينتهي في جميع الأحوال بقوة القانون بانصرام سنة من اتخاذه.",
                      "يقرر لزوماً حجز جواز السفر وإغلاق الحدود في حالة تعيين محل للإقامة الإجبارية إذا تعلق الأمر بأجنبي.",
                      "يمكن للسلطة التي أمرت بالتدابير السالفة الذكر أياً كانت أن تعدلها أو أن تراجعها في كل وقت تلقائياً أو بطلب من النيابة العامة أو من الطرف الذي يعنيه الأمر.",
                      "يكون القرار الصادر في شأن التدابير المنصوص عليها في الفقرات السابقة من هذه المادة غير قابل للطعن بالنقض.",
                      "تبلغ هذه القرارات إلى المصالح الأمنية المعنية التي يرجع لها الاختصاص قصد تنفيذها.",
                      "يعاقب كل من تملص من إحدى الالتزامات المبينة أعلاه بالحبس من ثلاثة أشهر إلى سنتين وبالغرامة من 2000 إلى 12000 درهم."
                    ]
                  },
                  {
                    "number": "183",
                    "paragraphs": [
                      "إذا متع المتهم بالإفراج المؤقت سواء كان ذلك بكفالة أو بدون كفالة، وجب عليه قبل الإفراج عنه أن يقوم بتقديم تصريح إلى كتابة ضبط المؤسسة السجنية يعين فيه محل المخابرة معه، إما في المكان الذي يواصل فيه التحقيق وإما في المكان الذي يوجد به مقر المحكمة المحالة إليها القضية.",
                      "يخبر رئيس المؤسسة السجنية السلطة المختصة بتقديم هذا التصريح وبمضمونه.",
                      "إذا استدعي المتهم للحضور بعد تمتيعه بالإفراج المؤقت ولم يحضر، أو إذا طرأت ظروف جديدة وخطيرة تجعل اعتقاله ضرورياً، يمكن لقاضي التحقيق أو لهيئة الحكم المعروضة عليها القضية أن تصدر أمراً قضائياً في شأنه قبل الحكم أو بمقتضى الحكم الصادر في الجوهر.",
                      "إذا منحت الغرفة الجنحية بمحكمة الاستئناف الإفراج المؤقت بناء على استئناف أمر صادر عن قاضي التحقيق، فلا يمكن لقاضي التحقيق إصدار أمر جديد بالاعتقال إلا إذا سحبت هذه الغرفة تمتيع المتهم بمقررها بناء على ملتمسات كتابية للنيابة العامة."
                    ]
                  },
                  {
                    "number": "184",
                    "paragraphs": [
                      "إذا كان الإفراج المؤقت متوقفاً على وجوب تقديم كفالة، فإن هذه الكفالة تضمن حضور المتهم في جميع إجراءات التحقيق وتنفيذ الحكم.",
                      "تضمن الكفالة كذلك أداء ما سيذكر حسب الترتيب الآتي: المصاريف المسبقة التي أداها الطرف المدني، والمبالغ الواجب إرجاعها ومبالغ التعويض عن الضرر أو أداء نفقة إذا كان المتهم متابعاً من أجل ذلك، والمصاريف التي أنفقها مقيم الدعوى العمومية، والغرامات.",
                      "يحدد مقرر الإفراج المؤقت القدر المخصص لكل جزء من جزئي الكفالة، ويمكن أن ينص على تخصيصها كلها لأداء حقوق الضحايا."
                    ]
                  },
                  {
                    "number": "185",
                    "paragraphs": [
                      "يدفع مبلغ الكفالة نقداً أو بواسطة الأداء الإلكتروني أو بواسطة التطبيقات البنكية أو بشيك مضمون الأداء معتمد من طرف البنك أو بواسطة شيك صادر عن محامي المتهم، أو سندات صادرة عن الدولة أو مضمونة من طرفها، ويدفع المبلغ إلى صندوق كتابة ضبط المحكمة أو إلى القابض، ويختص هذا القابض وحده بتسلم الكفالة إذا كانت في شكل سندات.",
                      "تأمر النيابة العامة حالاً بمجرد اطلاعها على وصل الدفع بتنفيذ مقرر الإفراج المؤقت."
                    ]
                  },
                  {
                    "number": "186",
                    "paragraphs": [
                      "إذا حضر المتهم لجميع إجراءات المسطرة وقام بتنفيذ الحكم، يرد له الجزء الأول من مبلغ الكفالة المقدم لضمان حضوره لتلك الإجراءات ولتنفيذ ذلك الحكم.",
                      "يصبح هذا الجزء ملكاً للدولة من اليوم الذي يتخلف فيه المعني بالأمر عن أي إجراء من إجراءات المسطرة أو عن تنفيذ الحكم دون أن يعتذر بسبب مشروع.",
                      "غير أنه يمكن لقاضي التحقيق في حالة إصدار أمر بعدم المتابعة أن يأمر برد ذلك الجزء، كما يمكن لهيئة الحكم أن تأمر برده في حالة إعفاء المتهم أو الحكم ببراءته."
                    ]
                  },
                  {
                    "number": "187",
                    "paragraphs": [
                      "يرد دائماً الجزء الثاني من الكفالة المدفوع لضمان أداء الصوائر والغرامة والمبالغ الواجب ردها ومبالغ التعويض عن الضرر إذا صدر مقرر بعدم المتابعة أو بالبراءة أو بالإعفاء.",
                      "إذا صدر مقرر بالإدانة فيخصص ذلك الجزء لتسديد المصاريف وتأدية الغرامة ورد المبالغ الواجب ردها وأداء النفقة المحكوم بها وأداء تعويض عن الضرر حسب الترتيب المبين في المادة 184، ويرد الباقي."
                    ]
                  },
                  {
                    "number": "188",
                    "paragraphs": [
                      "يتعين على النيابة العامة أن تقدم إلى القابض تلقائياً أو بطلب من الطرف المدني إما شهادة من كتابة الضبط تثبت المسؤولية التي يتحملها المتهم في الحالة المقررة في الفقرة الثانية من المادة 186، وإما موجزاً للقرار أو الحكم في الحالة المنصوص عليها في الفقرة الثانية من المادة 187.",
                      "يتعين على صندوق الإيداع والتدبير أن يقوم في الحال بتوزيع المبالغ المودعة على مستحقيها.",
                      "تبت المحكمة في غرفة المشورة بناء على طلب في كل نزاع بشأن هذه النقط باعتباره صعوبة في التنفيذ."
                    ]
                  }
                ]
              }
            ]
          },
          {
            "name": "الباب العاشر ",
            "title": "الإنابة القضائية",
            "articles": [
              {
                "number": "189",
                "paragraphs": [
                  "يمكن لقاضي التحقيق أن يطلب بواسطة إنابة قضائية من أي قاض آخر للتحقيق، أو أي قاض أو أي ضابط من ضباط الشرطة القضائية الموجودة في نفس دائرة محكمته، القيام بإجراء ما يراه لازماً من أعمال التحقيق في الأماكن الخاضعة لنفوذ كل واحد منهم.",
                  "يمكنه أن يعهد بتنفيذ الإنابة القضائية خارج دائرة نفوذ محكمته لأي قاض آخر من قضاة التحقيق أو قضاة الحكم، وعلى القاضي المنتدب إشعار النيابة العامة التي تنفذ الإنابة في دائرة نفوذها.",
                  "يشار في الإنابة القضائية إلى نوع الجريمة موضوع المتابعة، ويؤرخها القاضي الصادرة عنه، ثم يوقعها ويضع طابعه عليها.",
                  "لا يمكن أن يؤمر في الإنابة القضائية سوى بإجراءات التحقيق المتعلقة مباشرة بالجريمة المشار إليها في المتابعة.",
                  "يحدد قاضي التحقيق الأجل الذي يجب أن يوجه إليه خلاله ضابط الشرطة القضائية المحاضر التي يحررها، فإن لم يحدد ذلك الأجل توجه إليه المحاضر في ظرف الثمانية أيام الموالية ليوم نهاية العمليات المنجزة بموجب الإنابة القضائية."
                ]
              },
              {
                "number": "190",
                "paragraphs": [
                  "يمارس القضاة أو ضباط الشرطة القضائية المنتدبون لتنفيذ الإنابة القضائية، ضمن حدود هذه الإنابة، جميع السلطات المخولة لقاضي التحقيق.",
                  "غير أنه لا يمكن لضباط الشرطة القضائية استجواب المتهم ومواجهته مع غيره، كما لا يمكنهم الاستماع إلى الطرف المدني إلا بطلب منه وبعد موافقة قاضي التحقيق المنتدب لتنفيذ الإنابة القضائية."
                ]
              },
              {
                "number": "191",
                "paragraphs": [
                  "يتعين على كل شاهد استدعي لأداء شهادته أثناء تنفيذ إنابة قضائية الحضور وأداء اليمين والإدلاء بشهادته.",
                  "إذا لم يستجب الشاهد لهذا الالتزام، تعين إشعار القاضي الصادرة عنه الإنابة، الذي له أن يجبره على الحضور بواسطة القوة العمومية، وأن يتخذ ضده العقوبات المنصوص عليها في الفقرة الأولى من المادة 128."
                ]
              },
              {
                "number": "192",
                "paragraphs": [
                  "إذا اقتضت ضرورة تنفيذ الإنابة أن يبقي ضابط الشرطة القضائية شخصاً رهن إشارته، تطبق مقتضيات المواد 66 و66-1 و66-2 و66-3 و67 و68 و69 و80 المتعلقة بالوضع تحت الحراسة النظرية، ويشعر قاضي التحقيق."
                ]
              },
              {
                "number": "193",
                "paragraphs": [
                  "إذا تضمنت الإنابة القضائية الأمر بالقيام في آن واحد بإجراءات في أماكن مختلفة من تراب المملكة، فيمكن بناء على أمر من قاضي التحقيق أن توجه نظائر مستخرجة منها أو نسخ مطابقة للأصل إلى السلطات المكلفة بتنفيذ الإنابة.",
                  "يمكن أيضاً في حالة الاستعجال توجيه الإنابة القضائية بجميع الوسائل، غير أنه يجب أن توضح عند كل توجيه البيانات الأساسية المضمنة في الأصل، خصوصاً نوع التهمة واسم القاضي الصادرة عنه الإنابة وصفته."
                ]
              }
            ]
          },
          {
            "name": "الباب الحادي عشر",
            "title": "ٌإجراء الخبرة",
            "articles": [
              {
                "number": "194",
                "paragraphs": [
                  "يمكن لكل هيئة من هيئات التحقيق أو الحكم كلما عرضت عليها مسألة تقنية أو فنية أن تأمر بإجراء خبرة إما تلقائياً وإما بطلب من النيابة العامة أو من الأطراف، ويمكن للهيئات المذكورة بصفة خاصة أن تأمر بإجراء خبرة لتحديد فصيلة البصمات البيولوجية والجينية للمتهمين.",
                  "يقوم الخبير أو الخبراء بمهمتهم تحت مراقبة قاضي التحقيق أو المحكمة المعروضة عليها القضية أو القاضي الذي تعينه المحكمة عند الاقتضاء.",
                  "إذا ارتأى قاضي التحقيق أنه لا موجب للاستجابة للطلب الخاص بإجراء الخبرة، فعليه أن يصدر في ذلك أمراً معللاً قابلاً للاستئناف، طبق الكيفيات وضمن الآجال المنصوص عليها في المادتين 222 و223."
                ]
              },
              {
                "number": "195",
                "paragraphs": [
                  "يعين لإنجاز الخبرة خبير مسجل بجدول الخبراء القضائيين ما عدا إذا تعذر ذلك، وفي هذه الحالة يؤدي الخبير اليمين المنصوص عليها في المادة 345 بعده أمام قاضي التحقيق.",
                  "يجب أن توضح دائماً في المقرر الصادر بإجراء الخبرة مهمة الخبراء التي لا يمكن أن تنصب إلا على دراسة مسائل تقنية."
                ]
              },
              {
                "number": "196",
                "paragraphs": [
                  "إذا صدر القرار بإجراء الخبرة من قاضي التحقيق، يجب تبليغه إلى النيابة العامة والأطراف، ويشار في التبليغ إلى اسم الخبير وصفته، ويضمن فيه نص المهمة التي كلف بها.",
                  "لا يقبل القرار الصادر بإجراء الخبرة الطعن بالاستئناف.",
                  "غير أنه يمكن للنيابة العامة وللأطراف أن يبدوا ملاحظاتهم خلال الثلاثة أيام الموالية لتاريخ التبليغ، ويمكن أن تتعلق هذه الملاحظات إما باختيار الخبير وإما بالمهمة المنوطة به، وعلى قاضي التحقيق أن يبت في شأن هذه الملاحظات داخل أجل أربع وعشرين ساعة."
                ]
              },
              {
                "number": "197",
                "paragraphs": [
                  "إذا صدر القرار عن قاضي التحقيق وكان من المتعين إجراء الخبرة على أشياء من بينها علامات أو مواد أو منتوجات قابلة للتغير أو الاندثار، فبإمكان النيابة العامة أو الأطراف أو محاميهم أن يختاروا خلال أجل ثلاثة أيام خبراء مساعدين لمؤازرة الخبير المعين، وفي هذه الحالة يجب على قاضي التحقيق تعيين هؤلاء الخبراء.",
                  "إذا تعدد المتهمون تعين عليهم أن يتفقوا على اختيار الخبير المساعد، ويمكن بصفة استثنائية في حالة تعارض مصالحهم فقط أن يقع الاختيار على خبيرين على الأكثر.",
                  "غير أنه يمكن لقاضي التحقيق أن يصدر عند الضرورة قراراً معللاً يأمر فيه الخبير المعين بأن يشرع فوراً في إنجاز المعاينات أو العمليات التي لها طابع الاستعجال.",
                  "يحرر الخبير أو الخبراء تقريراً بالمهام التي كلفوا بإنجازها."
                ]
              },
              {
                "number": "198",
                "paragraphs": [
                  "تسري على الخبير المساعد مقتضيات الفقرة الأولى من المادة 195 أعلاه.",
                  "يجب أن يستدعي الخبير المعين الخبير المساعد عند إجراء جميع عمليات الخبرة ليتابع سيرها وليقدم كل الاقتراحات التي يراها مفيدة للقيام بالمهمة على أكمل وجه.",
                  "يجب على الخبير المعين عند عدم مراعاته لهذه الاقتراحات أن يشير إلى ذلك في تقريره وأن يبين أسباب رفضه."
                ]
              },
              {
                "number": "199",
                "paragraphs": [
                  "يجب أن يحدد في كل قرار يصدر بتعيين خبير أجل يتعين على الخبير إنجاز مهمته خلاله.",
                  "يجوز بناء على طلب من الخبير المعين تمديد هذا الأجل لمدة لا تتجاوز نصف الأجل المحدد بموجب قرار معلل يصدره القاضي أو المحكمة التي عينته إذا اقتضت ذلك أسباب خاصة.",
                  "إذا لم يضع الخبير المعين تقريره ضمن الأجل المحدد له فإن القاضي ينذره بوضع تقريره داخل أجل سبعة أيام تحت طائلة استبداله بخبير آخر مع ترتيب الآثار القانونية في حقه، ويتعين عليه إذ ذاك أن يحيط القاضي علماً بما قام به من عمليات.",
                  "إذا لم يدل الخبير بأسباب جدية للتأخير فإن القاضي يقوم باستبداله بخبير آخر ويشعر النيابة العامة والأطراف ورئيس المحكمة أو الرئيس الأول بحسب الأحوال لترتيب الآثار القانونية.",
                  "يجب عليه أيضاً أن يرد خلال الثماني والأربعين ساعة الأشياء والمستندات والوثائق التي قد يكون عهد بها إليه قصد إنجاز مهمته، وعلاوة على ذلك يمكن أن تتخذ ضده تدابير تأديبية."
                ]
              },
              {
                "number": "200",
                "paragraphs": [
                  "يجب على الخبير القيام بمهمته باتصال مع قاضي التحقيق أو المحكمة أو القاضي المعهود إليه بذلك، كما يجب عليه أن يخبرهم بتطور عملياته في أي وقت وحين لتمكينهم من اتخاذ كل الإجراءات المفيدة.",
                  "يمكن دائماً لقاضي التحقيق أثناء سير عملياته أن يستعين بخبراء إن رأى ذلك مفيداً."
                ]
              },
              {
                "number": "201",
                "paragraphs": [
                  "إذا طلب الخبراء أن توضح لهم مسألة لا تدخل في اختصاصهم، فيمكن لقاضي التحقيق أن يأذن لهم في الاستعانة بتقنيين تتم تسميتهم من بين التقنيين المؤهلين خاصة لذلك.",
                  "يؤدي التقنيون المعينون على الوجه المذكور اليمين أمام قاضي التحقيق أو هيئة الحكم التي أمرت بإجراء خبرة وفق الصيغة المنصوص عليها في المادة 345 بعده ما لم يكونوا مسجلين في جدول الخبراء القضائيين.",
                  "يضاف تقريرهم بكامله إلى التقرير المذكور في المادة 205."
                ]
              },
              {
                "number": "202",
                "paragraphs": [
                  "يجب على قاضي التحقيق أو على القاضي الذي تعينه المحكمة أن يعرض على المتهم طبقاً للفقرة الرابعة من المادة 104 الأشياء المختوم عليها التي لم تفتح أختامها أو لم يقع إحصاؤها وذلك قبل إرسالها إلى الخبراء.",
                  "عليه أن يحصي الأشياء المختوم عليها في المحضر المحرر قصد إثبات تسليمها إلى الخبراء.",
                  "يجب على الخبراء أن يذكروا في تقريرهم ما فتحوه أو ما أعادوا فتحه من الأختام مع إحصاء الأشياء التي فتحت أختامها."
                ]
              },
              {
                "number": "203",
                "paragraphs": [
                  "يمكن للخبراء أن يتلقوا على سبيل الإخبار وللقيام بمهامهم فقط تصريحات أشخاص آخرين غير المتهم، ويمضي المصرحون على تصريحاتهم.",
                  "إذا رأوا أن هناك ما يستلزم استنطاق المتهم، فإن هذا الاستنطاق يقوم به بحضورهم قاضي التحقيق أو القاضي الذي تعينه المحكمة، ويجري طبق الكيفيات وضمن الشروط المنصوص عليها في المواد 139 و140 و141 أعلاه.",
                  "غير أنه يمكن للخبراء الأطباء المكلفين بفحص المتهم أن يلقوا عليه في غيبة القاضي والمحامين الأسئلة الضرورية لإنجاز مهمتهم."
                ]
              },
              {
                "number": "204",
                "paragraphs": [
                  "يمكن للأطراف أن يطلبوا أثناء إنجاز أعمال الخبرة من قاضي التحقيق أو من المحكمة التي أمرت بها أن تأمر الخبراء بإجراء بعض الأبحاث أو بالاستماع إلى كل شخص معين قد يكون بإمكانه تزويدهم بمعلومات تقنية."
                ]
              },
              {
                "number": "205",
                "paragraphs": [
                  "يحرر الخبير المعين عند انتهاء عمليات الخبرة تقريراً يجب أن يتضمن وصف تلك العمليات ونتائجها، ويجب عليه أن يشهد بكونه أنجز شخصياً العمليات التي عهد إليه بها أو بكونه قام بمراقبتها ثم يوقع على تقريره.",
                  "إذا كانت لدى الخبير المساعد تحفظات يريد أن يقدمها، فيضمنها في مذكرة ويجب على الخبير المعين إضافتها إلى تقريره مع ملاحظاته الخاصة بشأنها."
                ]
              },
              {
                "number": "206",
                "paragraphs": [
                  "إذا تعدد الخبراء المعينون وحدث أن اختلفت آراؤهم أو كانت لهم تحفظات في شأن النتائج المشتركة، يبين كل واحد منهم رأيه في التقرير المشترك مع إبداء تحفظاته المعللة."
                ]
              },
              {
                "number": "207",
                "paragraphs": [
                  "يودع التقرير والأشياء المختوم عليها أو ما تبقى منها لدى كتابة الضبط للمحكمة التي أمرت بإجراء الخبرة، ويثبت هذا الإيداع بواسطة إشهاد من كتابة الضبط."
                ]
              },
              {
                "number": "208",
                "paragraphs": [
                  "يستدعي قاضي التحقيق أو القاضي المكلف من طرف المحكمة الأطراف ليطلعهم على استنتاجات الخبير، وليتلقى تصريحاتهم ويحدد لهم الأجل الذي يمكن لهم خلاله إبداء ملاحظاتهم أو تقديم طلباتهم، خاصة بقصد إجراء خبرة تكميلية أو خبرة مضادة.",
                  "يحق للأطراف الحصول على نسخة من تقرير الخبير.",
                  "لا يمكن رفض تلك الطلبات إلا بقرار معلل، وإذا تعلق الأمر بأمر صادر عن قاضي التحقيق يكون هذا الأمر قابلاً للاستئناف طبق الكيفيات وضمن الآجال المنصوص عليها في المواد 222 إلى 224."
                ]
              },
              {
                "number": "209",
                "paragraphs": [
                  "يجوز في الجلسة الاستماع إلى الخبراء بصفة شهود طبق الشروط المنصوص عليها في المواد 335 و345 و346."
                ]
              }
            ]
          },
          {
            "name": "الباب الثاني عشر",
            "title": "بطلان اجراءات التحقيق",
            "articles": [
              {
                "number": "210",
                "paragraphs": [
                  "يجب مراعاة مقتضيات المادتين 134 و135 من هذا القانون المنظمتين للحضور الأول للاستنطاق، والمادة 139 المتعلقة بحضور المحامي أثناء الاستنطاقات والمواجهات، والمواد 59 و60 و62 و101 المنظمة للتفتيشات، وذلك تحت طائلة بطلان الإجراء المعيب والإجراءات الموالية له.",
                  "يتم تقدير مدى هذا البطلان وفقاً لما هو منصوص عليه في الفقرة الثالثة من المادة 211."
                ]
              },
              {
                "number": "211",
                "paragraphs": [
                  "إذا ظهر لقاضي التحقيق أن إجراء من إجراءات التحقيق معرض للبطلان، فعليه أن يحيله إلى الغرفة الجنحية للبت فيه بعد استشارة النيابة العامة وإخبار المتهم والطرف المدني.",
                  "إذا ظهر للنيابة العامة أو للمتهم أو للطرف المدني أن إجراءً مشوباً بالبطلان قد اتخذ، فلهم أن يطلبوا من قاضي التحقيق أن يوجه ملف الدعوى إلى النيابة العامة لإحالته إلى الغرفة الجنحية بمحكمة الاستئناف رفقة الطلب الذي يبينون فيه أسباب البطلان خلال خمسة أيام.",
                  "تقرر هذه الغرفة ما إذا كان يجب أن يقتصر البطلان على الإجراء المقصود أو يمتد كلياً أو جزئياً إلى الإجراءات اللاحقة."
                ]
              },
              {
                "number": "212",
                "paragraphs": [
                  "يترتب كذلك البطلان عن خرق المقتضيات الجوهرية للمسطرة إذا كانت نتيجتها المساس بحقوق الدفاع لكل طرف من الأطراف.",
                  "يمكن لكل متهم أو طرف مدني أن يتنازل عن ادعاء البطلان المقرر لفائدته، ويجب أن يكون هذا التنازل صريحاً.",
                  "لا يقبل تنازل المتهم إلا بحضور محاميه أو بعد استدعائه قانونياً.",
                  "يعرض التنازل على الغرفة الجنحية وفقاً للمادة السابقة."
                ]
              },
              {
                "number": "213",
                "paragraphs": [
                  "تسحب من ملف التحقيق وثائق الإجراءات التي أبطلت وتحفظ في كتابة الضبط بمحكمة الاستئناف.",
                  "يمنع الرجوع إليها لاستخلاص أدلة ضد الأطراف في الدعوى، تحت طائلة متابعات تأديبية في حق القضاة والمحامين."
                ]
              }
            ]
          },
          {
            "name": "الباب الثالث عشر",
            "title": "الأوامر القضائية بشأن انتهاء التحقيق",
            "articles": [
              {
                "number": "214",
                "paragraphs": [
                  "يوجه قاضي التحقيق الملف إلى النيابة العامة بعد ترقيم أوراقه من طرف كاتب الضبط بمجرد ما يعتبر أن البحث قد انتهى.",
                  "على النيابة العامة أن توجه إلى قاضي التحقيق ملتمساتها خلال ثمانية أيام على الأكثر من توصلها بالملف."
                ]
              },
              {
                "number": "215",
                "paragraphs": [
                  "إذا ارتأى قاضي التحقيق أن الأفعال ليست من اختصاصه، يصدر أمراً بعدم الاختصاص.",
                  "يحتفظ كل أمر يكون قد أصدره قاضي التحقيق ضد المتهم بقوته التنفيذية.",
                  "يحيل قاضي التحقيق داخل أجل ثمانية أيام ابتداء من صدور هذا الأمر ملف القضية إلى النيابة العامة.",
                  "تحتفظ إجراءات المتابعة والتحقيق المنجزة بأثرها القانوني."
                ]
              },
              {
                "number": "216",
                "paragraphs": [
                  "يصدر قاضي التحقيق أمراً بعدم المتابعة إذا تبين له أن الفعل لا يكون مخالفة للتشريع الجنائي أو لم يعد خاضعاً لأحكامه، أو أنه ليست هناك أدلة كافية ضد المتهم، أو أن الفاعل ظل مجهولاً، أو في حالة سقوط الدعوى العمومية طبقاً لمقتضيات المادة 4 من هذا القانون.",
                  "يبت في نفس الوقت في شأن رد الأشياء والأموال والممتلكات المحجوزة.",
                  "يصفي صوائر الدعوى، وإذا كان فيها طرف مدني يحكم عليه بالمصاريف كلاً أو بعضاً، غير أنه يمكن إعفاء الطرف المدني إذا كان حسن النية من أداء هذه المصاريف بموجب مقرر خاص معلل، ما لم يكن هو الذي أقام الدعوى العمومية.",
                  "يفرج حالاً عن المتهمين المعتقلين ما لم يكونوا معتقلين لسبب آخر رغم استئناف النيابة العامة.",
                  "ينتهي مفعول الأمر بالوضع تحت المراقبة القضائية.",
                  "يمكن لقاضي التحقيق أن يأمر بنشر القرار بعدم المتابعة كلياً أو جزئياً بناء على طلب الشخص المعني أو بطلب من النيابة العامة بصحيفة أو عدة صحف أو عبر وسائل الاتصال السمعية البصرية أو الإلكترونية.",
                  "يحدد القاضي البيانات القابلة للنشر، ويقبل هذا القرار الطعن أمام الغرفة الجنحية وفقاً للشروط المشار إليها في المادتين 222 و223."
                ]
              },
              {
                "number": "217",
                "paragraphs": [
                  "إذا تبين لقاضي التحقيق لدى المحكمة الابتدائية أن الأفعال تكون مخالفة، أحال الملف على النيابة العامة وأمر بوضع حد للوضع تحت المراقبة القضائية وبالإفراج عن المتهم المعتقل ما لم يكن معتقلاً لسبب آخر.",
                  "إذا تعلق الأمر بجنحة، أصدر قاضي التحقيق أمراً بإحالة المتهم على المحكمة المختصة، ولا يمكن الطعن في هذا الأمر إلا بالنقض وفق الشروط المنصوص عليها في المادتين 523 و524 من هذا القانون.",
                  "يبت قاضي التحقيق في شأن الاعتقال الاحتياطي والأمر بالوضع تحت المراقبة القضائية ومدى استمرار الأمر بإلقاء القبض الصادر في حق المتهم.",
                  "يحيل قاضي التحقيق ملف القضية على وكيل الملك من أجل الاستدعاء طبقاً لما هو منصوص عليه في المادتين 308 و309، ويخفض الأجل المقرر في الفقرة الأولى من المادة 309 إلى خمسة أيام إذا كان المتهم معتقلاً.",
                  "إذا تعلق الأمر بجناية، صرح قاضي التحقيق بعدم اختصاصه وأحال الملف على النيابة العامة، وتطبق عندئذ أحكام المادة 215 أعلاه.",
                  "يبقى الأمر الصادر بإلقاء القبض على المتهم أو بإيداعه في السجن قابلاً للتنفيذ إلى أن يصبح المقرر القضائي لهيئة الحكم مكتسباً لقوة الشيء المقضي به، ما لم تقرر المحكمة المعروضة عليها القضية وضع حد له تلقائياً أو بناء على ملتمس من النيابة العامة أو بطلب من أحد الأطراف أو دفاعهم."
                ]
              },
              {
                "number": "218",
                "paragraphs": [
                  "إذا تبين لقاضي التحقيق لدى محكمة الاستئناف أن الأفعال تكون جناية، أصدر أمراً بإحالة المتهم على غرفة الجنايات.",
                  "يجب أن يتضمن هذا الأمر هوية المتهم وبيان الأفعال الجرمية وجميع الظروف التي من شأنها أن تشدد أو تخفف العقوبة، وينص كذلك على الوصف القانوني للجريمة مع الإشارة إلى النصوص المطبقة.",
                  "لا يمكن الطعن في الأمر المذكور إلا بالنقض وفق الشروط المنصوص عليها في المادتين 523 و524.",
                  "يحيل قاضي التحقيق ملف القضية على الوكيل العام للملك من أجل الاستدعاء طبق الشروط المنصوص عليها في المادتين 419 و420 من هذا القانون.",
                  "يبقى الأمر الصادر بإلقاء القبض على المتهم أو بإيداعه في السجن قابلاً للتنفيذ إلى أن يصبح مقرر هيئة الحكم مكتسباً لقوة الشيء المقضي به، ما لم تقرر المحكمة المعروضة عليها القضية وضع حد له تلقائياً أو بناء على ملتمس من النيابة العامة أو بطلب من الأطراف أو دفاعهم.",
                  "يبت قاضي التحقيق بشأن الاعتقال الاحتياطي والوضع تحت المراقبة القضائية ومدى استمرار الأمر بإلقاء القبض الصادر في حق المتهم.",
                  "إذا تعلق الأمر بجنحة أو مخالفة، أصدر قاضي التحقيق أمراً بالإحالة على المحكمة المختصة وبت في شأن الاعتقال الاحتياطي والوضع تحت المراقبة القضائية."
                ]
              },
              {
                "number": "219",
                "paragraphs": [
                  "يجوز خلال إجراء التحقيق إصدار أوامر بعدم المتابعة جزئياً."
                ]
              },
              {
                "number": "220",
                "paragraphs": [
                  "توجه إلى محامي المتهم ومحامي الطرف المدني خلال الأربع والعشرين ساعة الموالية لصدور كل أمر قضائي بالبريد المضمون أو بأي وسيلة اتصال أو تقنية تترك أثراً كتابياً لإشعارهما بالأمر الصادر عن قاضي التحقيق.",
                  "يشعر المتهم والطرف المدني طبقاً لنفس الكيفيات وضمن نفس الآجال بالأوامر القضائية بانتهاء التحقيق وبالأوامر التي يمكن استئنافها.",
                  "إذا كان المتهم معتقلاً يخبره بذلك رئيس المؤسسة السجنية.",
                  "يشعر كاتب الضبط النيابة العامة بكل أمر قضائي في نفس يوم صدوره."
                ]
              },
              {
                "number": "221",
                "paragraphs": [
                  "تصدر الأوامر القضائية الصادرة عن قاضي التحقيق عملاً بمقتضيات هذا الفرع بعد ملتمسات النيابة العامة.",
                  "تشمل هذه الأوامر، مع مراعاة مقتضيات المادة 143 أعلاه، اسم المتهم العائلي والشخصي ونسبه وتاريخ ومحل ولادته ومحل سكناه ومهنته.",
                  "يبين في الأوامر القضائية الوصف القانوني للفعل المنسوب للمتهم، كما تبين فيها بدقة الأسباب التي من شأنها أن تدعم وجود أدلة كافية أو عدم وجودها."
                ]
              }
            ]
          },
          {
            "name": "الباب الرابع عشر",
            "title": "استئناف أوامر قاضي التحقيق",
            "articles": [
              {
                "number": "222",
                "paragraphs": [
                  "يحق للنيابة العامة أن تستأنف لدى الغرفة الجنحية كل أمر قضائي يصدره قاضي التحقيق، باستثناء الأوامر الصادرة بإجراء خبرة طبقاً لمقتضيات المادة 196.",
                  "يتم هذا الاستئناف في صيغة تصريح يقدم إلى كتابة الضبط بالمحكمة التي يوجد بها قاضي التحقيق في اليوم الموالي لإشعارها بصدور الأمر.",
                  "يبقى المتهم معتقلاً في حالة صدور أمر بالإفراج المؤقت إلى حين انصرام أجل الاستئناف المنصوص عليه في الفقرة السابقة، ما لم توافق النيابة العامة على الإفراج عنه في الحال.",
                  "تسري نفس المقتضيات إذا تعلق الأمر برفع المراقبة القضائية.",
                  "يترتب عن الاستئناف الذي تقدمه النيابة العامة إبقاء المتهم في حالة اعتقال إلى أن يبت في هذا الاستئناف."
                ]
              },
              {
                "number": "223",
                "paragraphs": [
                  "يحق للمتهم أن يستأنف لدى الغرفة الجنحية بمحكمة الاستئناف الأوامر المنصوص عليها في المواد 94 و139 و152 و175 و175-1 و175-2 و176 و177 و179 و181 و181-1 و194 (الفقرة الأخيرة) و208 و216 (الفقرات 2 و3 و6 و7).",
                  "يحق له كذلك استئناف الأمر الذي يبت في الاختصاص الصادر عن قاضي التحقيق، إما تلقائياً وإما بناء على دفع الأطراف بعدم الاختصاص.",
                  "يقدم الاستئناف بتصريح إلى كتابة ضبط المحكمة التي يوجد بها مقر قاضي التحقيق خلال الثلاثة أيام الموالية ليوم تبليغ الأمر إلى المتهم طبقاً للمادة 220 أعلاه.",
                  "إذا كان المتهم معتقلاً فإن هذا التصريح يكون صحيحاً إذا تلقته كتابة الضبط للمؤسسة السجنية التي يجب عليها أن تقيده حالاً في سجل خاص، وعلى رئيس المؤسسة أن يقوم بتوجيه هذا التصريح لكتابة الضبط للمحكمة في ظرف أربع وعشرين ساعة وإلا تعرض لعقوبات تأديبية."
                ]
              },
              {
                "number": "224",
                "paragraphs": [
                  "يمكن للطرف المدني أن يستأنف لدى الغرفة الجنحية الأوامر الصادرة بعدم إجراء التحقيق وبعدم المتابعة وكذا الأوامر التي تمس بمصالحه المدنية.",
                  "غير أنه لا يمكنه بأي حال من الأحوال أن يستأنف أمراً قضائياً متعلقاً باعتقال المتهم أو مقتضى من مقتضيات أمر قضائي يتعلق بهذا الاعتقال أو بالمراقبة القضائية.",
                  "يمكن للطرف المدني استئناف الأمر الذي يبت في الاختصاص الصادر عن قاضي التحقيق إما تلقائياً أو بناء على دفع الأطراف بعدم الاختصاص.",
                  "يقدم الطرف المدني استئنافه طبق الكيفيات المنصوص عليها في الفقرة الثالثة من المادة 223 أعلاه خلال الثلاثة أيام الموالية لتبليغ الأمر القضائي في موطنه الحقيقي أو المختار."
                ]
              },
              {
                "number": "225",
                "paragraphs": [
                  "إذا قدم الاستئناف فإن قاضي التحقيق يوجه ملف التحقيق أو النسخة المأخوذة منه طبقاً للمادة 85 إلى النيابة العامة لمحكمته في ظرف أربع وعشرين ساعة من تاريخ الاستئناف.",
                  "وإذا كان الأمر يتعلق بالمحكمة الابتدائية فإن وكيل الملك لديها يحيل الملف خلال ثمان وأربعين ساعة إلى الوكيل العام للملك.",
                  "يجب على الوكيل العام للملك بعد التوصل بالملف أن يوجهه مرفقاً بملتمساته إلى الغرفة الجنحية خلال خمسة أيام على الأكثر من تاريخ هذا التوصل."
                ]
              },
              {
                "number": "226",
                "paragraphs": [
                  "إذا كان الأمر القضائي المستأنف لا يتعلق بانتهاء التحقيق، فلقاضي التحقيق أن يواصل تحقيقه ما لم تصدر الغرفة الجنحية مقرراً بخلاف ذلك."
                ]
              },
              {
                "number": "227",
                "paragraphs": [
                  "لا يمكن إثارة الدفع ببطلان إجراءات التحقيق بعد صدور قرار قاضي التحقيق أو الغرفة الجنحية القاضي بالإحالة على هيئة الحكم."
                ]
              }
            ]
          },
          {
            "name": "الباب الخامس عشر",
            "title": "إعادة التحقيق بسبب ظهور أدلة جديدة",
            "articles": [
              {
                "number": "228",
                "paragraphs": [
                  "إذا صدر أمر بعدم متابعة المتهم، فلا يمكن متابعته من أجل نفس الفعل إلا إذا ظهرت أدلة جديدة."
                ]
              },
              {
                "number": "229",
                "paragraphs": [
                  "تعد أدلة جديدة شهادة الشهود والمستندات والمحاضر التي لم يكن في الإمكان عرضها على قاضي التحقيق لدراستها.",
                  "يجب أن تكون هذه الأدلة من طبيعتها إما أن تعزز الأدلة التي تبين أنها جد ضعيفة، وإما أن تعطي للأفعال تطورات مفيدة لإظهار الحقيقة."
                ]
              },
              {
                "number": "230",
                "paragraphs": [
                  "يحق للنيابة العامة أن تقرر ما إذا كان هناك مبرر لالتماس إعادة التحقيق بسبب ظهور أدلة جديدة."
                ]
              }
            ]
          }
        ]
      },
      {
        "name": "القسم الرابع",
        "title": "الغرفة الجنحية بمحكمة الاستئناف",
        "chapters": [
          {
            "name": "الباب الأول",
            "title": "أحكام عامة",
            "articles": [
              {
                "number": "231",
                "paragraphs": [
                  "تنظر الغرفة الجنحية بمحكمة الاستئناف، وهي مكونة من الرئيس الأول أو من ينوب عنه ومن مستشارين اثنين بحضور ممثل النيابة العامة وكاتب الضبط.",
                  "تنظر أولاً في طلبات الإفراج المؤقت المقدمة إليها مباشرة طبقاً لمقتضيات الفقرتين الرابعة والخامسة من المادة 179، وفي تدابير الوضع تحت المراقبة القضائية المتخذة طبقاً للمادة 160 من هذا القانون.",
                  "تنظر ثانياً في طلبات بطلان إجراءات التحقيق المنصوص عليها في المواد من 210 إلى 213 أعلاه.",
                  "تنظر ثالثاً في الاستئنافات المرفوعة ضد أوامر قاضي التحقيق طبقاً للمواد من 222 إلى 227 أعلاه.",
                  "تنظر رابعاً في كل إخلال منسوب لضابط من ضباط الشرطة القضائية خلال مزاولته لمهامه طبقاً لما هو منصوص عليه في المواد من 29 إلى 35 من هذا القانون.",
                  "تنظر خامساً في كل ما يسند إليها القانون صراحة البت فيه."
                ]
              },
              {
                "number": "232",
                "paragraphs": [
                  "يقوم بتمثيل النيابة العامة لدى الغرفة الجنحية الوكيل العام للملك لدى محكمة الاستئناف أو أحد نوابه.",
                  "يقوم بمهمة كاتب الضبط أحد كتاب الضبط بنفس المحكمة."
                ]
              },
              {
                "number": "233",
                "paragraphs": [
                  "تجتمع الغرفة الجنحية بدعوة من رئيسها أو بطلب من الوكيل العام للملك كلما اقتضت الضرورة ذلك."
                ]
              },
              {
                "number": "234",
                "paragraphs": [
                  "يتولى الوكيل العام للملك تهييء القضية وإحالتها مرفقة بملتمسه إلى الغرفة الجنحية في ظرف خمسة أيام من توصله بالملف.",
                  "يجب أن تبت هذه الأخيرة في قضايا الاعتقال الاحتياطي والوضع تحت المراقبة القضائية خلال الآجال المنصوص عليها في المادتين 160 و179 أعلاه."
                ]
              },
              {
                "number": "235",
                "paragraphs": [
                  "يمكن للأطراف ولمحاميهم أن يطلعوا على الملف المشتمل على ملتمسات الوكيل العام للملك، ويسمح لهم بتقديم مذكرات تطلع عليها النيابة العامة والأطراف الآخرون، مع مراعاة الفقرة السادسة من المادة 139 من هذا القانون.",
                  "تودع المذكرات في كتابة الضبط بمحكمة الاستئناف، ويؤشر عليها كاتب الضبط مع بيان يوم إيداعها."
                ]
              },
              {
                "number": "236",
                "paragraphs": [
                  "تجرى المناقشات بصفة سرية، وتبت الغرفة الجنحية في غرفة المشورة بعد الاطلاع على تقرير المستشار المكلف بالقضية ودراسة الملتمسات الكتابية للوكيل العام للملك ومذكرات الأطراف.",
                  "تصدر الغرفة قرارها في جلسة علنية.",
                  "يمكن للغرفة أن تأمر بحضور الأطراف شخصياً والاستماع إليهم وبإحضار أدوات الاقتناع."
                ]
              },
              {
                "number": "237",
                "paragraphs": [
                  "لا يمكن لممثل النيابة العامة ولا لكاتب الضبط حضور مداولات الغرفة الجنحية."
                ]
              },
              {
                "number": "238",
                "paragraphs": [
                  "يمكن للغرفة الجنحية، إما بطلب من الوكيل العام للملك أو بطلب من أحد الأطراف أو تلقائياً، أن تأمر بإجراء أي تحقيق تكميلي تراه مفيداً.",
                  "يقوم بإجراء التحقيق التكميلي أحد أعضاء الغرفة أو قاضي تحقيق تنتدبه الغرفة لهذه الغاية، مع مراعاة مقتضيات القسم الثالث من الكتاب الأول من هذا القانون المتعلق بالتحقيق الإعدادي.",
                  "يمكن للقاضي المكلف بالتحقيق التكميلي أن يصدر جميع الأوامر، غير أن الغرفة تبقى مختصة للبت في الإفراج المؤقت ضمن الشروط المنصوص عليها في الفقرتين الثانية والرابعة من المادة 180 أعلاه.",
                  "إذا وضعت الغرفة حداً للاعتقال المؤقت لمتهم، فإنه يفرج عن هذا الأخير حالاً ما لم يكن معتقلاً لسبب آخر."
                ]
              },
              {
                "number": "239",
                "paragraphs": [
                  "إذا أحيل إلى الغرفة الجنحية طلب بإبطال إجراء من إجراءات التحقيق، فإنها تصرح، إذا كان لذلك موجب، ببطلان الإجراء المعيب.",
                  "يمكن للغرفة أن تقضي ببطلان الإجراءات التي تليه كلاً أو بعضاً، طبقاً لما هو منصوص عليه في الفقرة الثالثة من المادة 211 أعلاه.",
                  "إذا اقتصرت الغرفة على إبطال جزء من الإجراءات، فيمكنها أن تأمر إما بإجراء تحقيق تكميلي طبق الشروط المنصوص عليها في المادة 238 أعلاه، وإما بإحالة الملف إلى القاضي المكلف بالتحقيق أو إلى أحد قضاة التحقيق لمتابعة إجراءات البحث.",
                  "إذا تبين من الإبطال الكلي للمسطرة أن هذه الأخيرة كانت معيبة من بدايتها، فإن الغرفة الجنحية تحيل المسطرة إلى النيابة العامة لتتخذ في شأنها ما تراه مناسباً، وتبت في شأن الاعتقال الاحتياطي أو المراقبة القضائية."
                ]
              },
              {
                "number": "240",
                "paragraphs": [
                  "يكون للمقرر المحال إلى الغرفة الجنحية مفعوله التام إذا أيدته هذه الغرفة."
                ]
              },
              {
                "number": "241",
                "paragraphs": [
                  "عندما ينتهي التحقيق التكميلي، تأمر الغرفة الجنحية بإيداع ملف المسطرة بكتابة الضبط لدى محكمة الاستئناف.",
                  "تقوم كتابة الضبط بإخبار الأطراف ومحاميهم بهذا الإيداع بواسطة رسائل مضمونة.",
                  "يبقى ملف المسطرة مودعاً بكتابة الضبط خلال ثمان وأربعين ساعة في قضايا الاعتقال الاحتياطي والوضع تحت المراقبة القضائية، ولمدة خمسة أيام في غيرها من القضايا، ثم يتم إجراء المسطرة وفقاً للمادتين 235 و236 أعلاه."
                ]
              },
              {
                "number": "242",
                "paragraphs": [
                  "إذا أصدرت الغرفة الجنحية قراراً بعدم اختصاص قاضي التحقيق، فإنها تعين هيئة الحكم أو التحقيق التي تختص بالنظر في القضية."
                ]
              },
              {
                "number": "243",
                "paragraphs": [
                  "إذا أيدت الغرفة الجنحية أمراً بعدم المتابعة فإنها تصدر قراراً بذلك.",
                  "إذا ألغت أمراً بعدم المتابعة فإنها تقرر إحالة القضية إلى المحكمة الابتدائية المختصة إذا تعلق الأمر بمخالفة أو جنحة تدخل في اختصاصها.",
                  "تحيل القضية إلى غرفة الجنايات إذا تبين للغرفة الجنحية أن الأفعال تكون جناية.",
                  "في هذه الحالة الأخيرة، تحيل الغرفة الجنحية إلى غرفة الجنايات الجنح والمخالفات غير القابلة للتجزئة، كما يمكنها أن تحيل إليها الجنح والمخالفات المرتبطة بتلك الجناية."
                ]
              },
              {
                "number": "244",
                "paragraphs": [
                  "يجب تحت طائلة البطلان أن يتضمن قرار الإحالة إلى غرفة الجنايات بياناً بالأفعال ووصفها القانوني والنصوص المطبقة.",
                  "يمكن للغرفة الجنحية أن تأمر في نفس القرار بإيداع المتهم في السجن أو بإلقاء القبض عليه."
                ]
              },
              {
                "number": "245",
                "paragraphs": [
                  "يوقع الرئيس وكاتب الضبط على قرارات الغرفة الجنحية.",
                  "تبين في هذه القرارات أسماء القضاة وممثل النيابة العامة وكاتب الضبط.",
                  "يشار فيها إلى إيداع المستندات والمذكرات وملتمسات النيابة العامة، وعند الاقتضاء إلى حضور الأطراف."
                ]
              },
              {
                "number": "246",
                "paragraphs": [
                  "تؤجل الغرفة الجنحية البت في المصاريف إذا كان قرارها لا ينهي الدعوى التي نظرت فيها.",
                  "إذا كان قرار الغرفة منهياً للدعوى فإنها تقوم بتصفية المصاريف وتحملها الطرف المحكوم عليه.",
                  "غير أنه إذا كان الطرف المدني حسن النية يمكن إعفاؤه من المصاريف كلاً أو بعضاً بموجب قرار خاص معلل ما لم يكن هو الذي أثار الدعوى العمومية.",
                  "تبت الغرفة في رد الأشياء المحجوزة، ولها أن تقرر ردها ما لم تكن لازمة لسير الدعوى أو خطيرة أو قابلة للمصادرة."
                ]
              },
              {
                "number": "247",
                "paragraphs": [
                  "تبلغ قرارات الغرفة الجنحية إلى الأطراف ومحاميهم في ظرف الأربع والعشرين ساعة من صدورها بواسطة رسالة مضمونة طبق الشروط المنصوص عليها في قانون المسطرة المدنية أو بأي وسيلة اتصال أو تقنية تترك أثراً كتابياً."
                ]
              }
            ]
          },
          {
            "name": "الباب الثاني",
            "title": "السلطات الخاصة برئيس الغرفة الجنحية",
            "articles": [
              {
                "number": "248",
                "paragraphs": [
                  "يتحقق رئيس الغرفة الجنحية أو من ينوب عنه من حسن سير غرف التحقيق التابعة لنفوذ محكمة الاستئناف، ويعمل على ألا تتأثر المسطرة بأي تأخير غير مبرر.",
                  "لهذه الغاية، تعد غرف التحقيق كل ثلاثة أشهر لائحة بجميع القضايا الرائجة مع الإشارة إلى تاريخ تنفيذ آخر إجراء من إجراءات التحقيق.",
                  "توجه هذه اللوائح كل ثلاثة أشهر إلى رئيس الغرفة الجنحية وإلى الوكيل العام للملك.",
                  "يشار في لائحة خاصة إلى القضايا المتعلقة بالمتهمين المعتقلين احتياطياً."
                ]
              },
              {
                "number": "249",
                "paragraphs": [
                  "يقوم رئيس الغرفة الجنحية أو من ينوب عنه بزيارة المؤسسات السجنية التابعة لنفوذ محكمة الاستئناف مرة كل ثلاثة أشهر على الأقل، ويتحقق من حالة المتهمين الموجودين في حالة اعتقال احتياطي.",
                  "يعد تقريراً بالزيارة يضمن فيه ما لاحظه، ويحيل نسخة منه إلى الوكيل العام للملك وإلى قاضي التحقيق.",
                  "يمكنه أن يطلب من قاضي التحقيق جميع البيانات اللازمة.",
                  "إذا ظهر له أن الاعتقال لا مبرر له، فإنه يرفع الأمر إلى الوكيل العام للملك وإلى قاضي التحقيق لاتخاذ الإجراء المناسب."
                ]
              },
              {
                "number": "250",
                "paragraphs": [
                  "يضع رئيس الغرفة الجنحية أو من ينوب عنه تقريراً سنوياً عن سير أعمال غرف التحقيق التابعة لنفوذ محكمة الاستئناف، ويوجه نسخة منه إلى الوكيل العام للملك."
                ]
              }
            ]
          }
        ]
      }
    ]
  }